{
    "Ko te reo Māori te reo o te tangata whenua o Aotearoa. Nā te ture anō i whakamana te reo Māori hei reo a te motu o Aotearoa. 160,000 ngā kaikōrero reo Māori i Aotearoa, e ai ki te tatauranga tangata o te motu i te tau 1996. Ko ngā takiwā kaha ki te mau i te reo hei reo hapori ko Te Tai-tokerau, ko Te Urewera, ko Te Tai-rāwhiti.\nHe reo o Porinīhia.\nKo te reo Māori nō te reo whānau o ngā iwi o Porinīhia ki te rāwhiti, arā he reo ka ahu mai nō te Moana-nui-a-Kiwa, me te aha, e ōrite ana te reo Māori ki te reo o Rarotonga, o Manihiki-Rakahanga, o Tahiti, ā, o ngā moutere Tuamotu anō hoki. He whanaunga āhua tawhiti anō ki te reo o Hawaii, o Nuku Hiva, o Rapa Nui me ētahi atu moutere o te Moana-nui-o-Kiwa. Ahakoa he nui atu i te kotahi mano tau i wehe mai i ērā o aua reo whanaunga, he tata tonu. I te taenga mai o Kāpene Kuki ki Aotearoa i te 1769, he rangatira nō Tahiti, ko Tupaea te ingoa, i runga i tana kaipuke. Ko te mahi a Tupaea, he kōrero tahi ki ngā Māori, i mārama rātou ki tana reo, kore rawa he raruraru; arā he kaiwhakamāori ia kia mōhio ai a Kuki ki ngā whakaaro o te Māori o taua wā. Mā te ripanga i raro iho nei e whakamārama ngā hononga i waenganui i ngā reo o Porinīhia:\nHe reo tapu, he reo whai mana.\nKi tō te Māori whakaaro, ko te reo Māori he reo tapu, he reo tuku iho nā ngā atua ki ngā tūpuna. He mana tō te reo, he ihi tō te reo, he tapu tō te reo. He wairua tō te reo, he mauri anō tō te reo. Mā te wairua ka rangona te reo, mā te mauri ka mana ai te reo. I kī mai ngā tūpuna, ko te reo rauriki te reo tapu o Ranginui rātou ko ngā atua; ko te reo reiuru e kōrerotia ake nei ko te reo tapu o Papatūānuku. Nā, ko te reo rauriki te reo hei kawe i te manawa tapu o ngā karakia, ā, ka whakauru atu ki roto i te tangata, kia pērā anō te mana o tana kupu i tō ngā atua ki tā rātou i whakahau mai ai i te rangi. Ko te reo reiuru, ko tōna kōrero ko te reo e taea ai e te tangata te kōrero, te mātau rānei ki ngā momo reo kē o Papatūānuku, arā te reo o ngā manu, o ngā ika, o ngā kararehe, o ngā rākau, o ngā uri katoa o Papatūānuku. Kia nei te reo wāhine hei whakaoho ake i te hunga wairua i runga anō i te tangi karanga ka whakapāoho ki runga i ngā marae. E kore e taea e te tangata te mau ki ēnei reo, mena kāhore noa e tapu pono ki ngā atua, ko te mea nui ko te reo tapu me ngā karakia tapu. Mā te reo ka manaakitia te tangata, ko taua reo anō ka kanga i te tangata; mā te reo ka piki te tangata ki ngā taumata whakahirahira, ko taua reo anō ka heke te tangata ki te pito kukume tonu o Whirotetupua. Nō reira, ko te reo tapu he tohu mana nō te tangata, he mana tūturu nō te atua, e kore e whakapōreareatia e te tangata kē (Barlow 1991:112).\n Reo-ā-iwi.\nHe rerekē te tangi me te mita o te reo o ia iwi, o ia iwi, o ia iwi; hei tauira, he rerekē te tangi mai o te reo o Waikato ki tērā o Te Wai-pounamu. Nā Te Manihera (R. Maunsell), te ātirīkona o Tāmaki Makaurau, i kōrerohia ngā reo-ā-iwi i roto i te tuawhā o ngā putanga o tana pukapuka Grammar of the New Zealand Language i te 1894. E ai ki Te Manihera, e whitu ngā reo-ā-iwi nō roto tonu i Te Ika-a-Māui. Nāna hoki te kōrero, he rerekētanga anō i roto tonu o aua reo e whitu. Mai i taua wā, nā ētahi atu tohunga wetereo e whakarerekēngia ai aua whakaaro; engari mā te ripanga nei e whakaatu ētahi o aua rerekētanga: \nWaimemehatanga.\nNō ngā tau whakatuwhera o te Rautau 19, ka tīmata te noho tahi a te Pākehā ki te Māori i Aotearoa nei. Nō te tau 1815, ka puta te pukapuka tuatahi i tāia ki te reo, He Korao o Niu Tireni nā Tāmati Kānara. Ko te whakamārama o te taitara o taua pukapuka, 'He kōrero o Aotearoa'. Nō muri ake, ka tāia e Koroneho, e Wiremu he pukapuka i roto i te reo. Ko tētahi pukapuka whaimana i tāia i taua wā ko te Paipera Tapu. He kaha hoki te Māori ki te tuhituhi kōrero i te reo. Ka taea hoki te kī, i taua wā, he pai ake ngā Māori i ngā Pākēhā ki te tuhituhi.\n \nKo te mea whakahinapōuri kē ki te ngākau Māori, ka tahuri ngā Pākehā ki te hāpai i te mana o tō rātou ake reo. Nō te tau 1867, i kī te ture mō ngā kura Māori, kia akongia ki te reo Ingarihi i ngā kura, kia kaua ngā tamariki e kōrero i te Reo i roto i ngā kura. Ka tīmata i konei te waimemehatanga o te reo rangatira, nā te mea ki te kōrero Māori ngā tamariki i roto i ngā kura ka patua e ngā kaiako Pākehā. He raruraru nui tērā. Koia rā i mataku ai rātou ki te kōrero i te reo, ka tahuri kē ki te reo Pākehā. Ka mōhio mai tātou, ki te kore e kōrero i te reo i roto i ngā tū āhua mahi katoa a te iwi, ia rā, ia rā, ka hohoro te ngaro, ka mate hoki te reo. Ko te mea tika me kōrero tonu te reo i ngā wā katoa, i roto i ngā karakia, i ngā wāhi mahi, i ngā toa hokohoko, i ngā wheketere, i ngā wāhi tākaro, i ngā kura; nō reira, mā ēnei whakaritenga ka tupu kaha te reo - kia kaua e ngaro. Nā reira, itiiti noa iho ngā wāhi kōrero i te reo Māori; ki ngā marae, me ētahi kura, hāhi, me ngā kohanga reo... Ahakoa, e kaha ana te Māori ki te whakamana i te reo hei reo tūturu mō ngā tāngata o tō tātou motu. E kore pea e taea kia noho ia hei reo mō ētahi taikanga motuhake i roto i te iwi, pēnei i te reo mihi i runga i ngā marae, hei reo kōrero hoki mō ētahi o ngā whānau. Ko te tumanako kia hāpaitia tonutia te reo kia kore e ngaro, engari kia pūāwai i runga i ngā tikanga o te Tiriti o Waitangi, kia whakapuare huarahi kia noho pūmau tonu te reo hei taonga whakahirahira mō ake tonu atu (Barlow 1991:113).\nI whakatūhia Te Rōpū Whakamana i Te Tiriti o Waitangi i te marama o Whiringa-a-nuku, 1975. I puta te rangahau mō te āhuatanga o te reo Māori 1973-78 a te Kaunihera Rangahau Mātauranga o Aotearoa (NZCER) e kī ana 18-20 ōrau anake o te iwi Māori e matatau ana ki te kōrero i te reo Māori, ā, i kī anō hoki kei te noho tino mōrearea te reo Māori. I te tau 1986 i rongohia e te Rōpū Whakamana i Te Tiriti o Waitangi te kereme mō Te Reo Māori. Nā tēnei i tū ai Te Taura Whiri i te Reo Māori i te tau 1987. Nā te mahi rangahau a te motu 1995, e pā ana ki te āhua o te reo, i whakapūmau ngā kitenga a tērā o ngā rangahau ki mua, me te tohu mai ahakoa e kōrerotia ana te reo Māori e te 59 ōrau o ngā pakeke Māori, e kitea ana ko te tokomaha (83 ōrau) o rātou he paku noa iho te matau mō te kōrero, ko ētahi kāre i paku kōrero i te reo Māori. E 8 ōrau anake o ngā pakeke Māori e tino matatau ana ki te reo Māori, ā, 33 ōrau o rātou, 60 tau te pakeke - neke atu rānei.\nTe Taura Whiri i te Reo Māori.\nI te tau 1986, i mauria atu he kerēme ki te Rōpū Whakamana i Te Tiriti o Waitangi, ko te kerēme mō te reo Māori. Kātahi te ture mo te Reo Māori ka pahure hei Reo atoato i Aotearoa. I taua wā tonu, ka tū Te Taura Whiri i te Reo Māori hei Tari Kawana hei whanaketanga hei tautoko hoki i te Reo, i runga i te whakaaro i tukuna kētia te kerēme mo Te Reo Māori ki te Rōpū Whakamana. Ka whakamanahia-ā-ture te Ture Reo Māori i te Here-turi-kōkā o 1987. E toru ōna kaupapa:\nKei ngā kōti, kei ngā Kōmihana uiui me ngā Taraipiunara, e whakatau ake ana tēnei ture i te whakaae kia kōrero Māori i te kōti ahakoa mema kōti rānei, ko wai ake rānei o te kōti, kaituku kōrero, kaiāwhina rānei.\nKa tū rā hoki i a ia Te Taura Whiri i te Reo Māori. Ko tā Te Taura Whiri he whakatairanga i te reo Māori me ngā kaupapa reo; he hikihiki taumata mō te tuhituhi me te kōrero i te reo, arā mā te ara rūmaki, mā te whakamātautau reo, mā te niureta ia toru marama e kīa nei He Muka, ā, me ngā kōrero tautoko mai anō hoki a te hunga mahi kāwanatanga; he whakamana-ā-ture i ngā whakamātautau o te hunga e whai nei i te mahi whakamāori-ā-tuhi, ā-waha rānei; he rangahau huarahi e whakatairangatia ai, e hāpai tonutia ai te ahu whakamua o te reo; te hanga papa kupu. Kia ono anō ngā hui o Te Taura Whiri i ia tau. He tumuākī tō te hunga mahi, ka mutu ko ngā mahi he rangahau, he ārahi ture, he whakahoki tirohanga i ngā mahi whakamāori, he whakatairanga, me ērā atu mahi e homai e ngā Kaiwhiri. Whakapā mai i konei ka whiti rānei ki te wāhi whakahoki kōrero hei tuku kōrero mai rā.\nTe Wiki o te Reo Māori.\nKo Te Wiki o te Reo Māori he kaupapa o Te Taura Whiri i te Reo Māori kia whakatairangatia te whakamahia o te reo MāoriI tīmata te Wiki o te Reo Māori i te tau 1975. I te tīmatanga i whakatūhia he rā hei whakanui i te reo Māori. Ko te 14 o Mahuru 1972 te rā i whakatakotohia ki mua o te aroaro o te Pāremata te petihana mō te Reo Māori e mau ana i ngā waitohu 30,000. Nō te tau 1973 ka huri te rā hei wiki whakanui i te reo. I muri mai i tēnei ka nekehia e te Tāhuhu Mātauranga ki te marama o Hōngongoi kia hāngai ki te wāhanga kura o taua tau, ā, kei te mau tonu ki taua marama. \nKīwaha.\nKo ngā kīwaha he momo kōrero e whakaahua ana i ngā āhuatanga o ia rā, o ia rā, ā, me uaua ka kitea te tikanga tūturu i te papakupu, i te pukapuka wetereo rānei. Ki te whāia he tikanga ake o tēnā, o tēnā kupu, kāore tonu e kitea he māramatanga, i te mea kei tua kē te aronga o te kōrero. Nā Te Taura Whiri i Te Reo ēnei whakamārama:\nAutaia (tonu) - whakamahia ai tēnei kupu hei whakaatu i te pai (autaia), i te āhua pai rānei (autaia tonu) o tētahi mea. Tērā pea e hāngai ana ki te tangata (autaia koe), ki te mahi rānei a te tangata, ki tētahi atu āhuatanga rānei.\nEngari tonu - he momo whakamihi tēnei i te tangata, i tāna mahi, i tētahi kaupapa rānei, ā, e āhua whakaatu ana anō hoki i te mīharo o te kaikōrero ki tētahi tūāhua. Arā te kīwaha e āhau rite ana ki tēnei, ko te 'koia kei a koe'. Engari he wā anō tōna e whakahē ana i te kōrero a tētahi atu mēnā he rerenga whakakāhore taua kōrero, he wā anō e whakaū ana, e whakaae ana ki te kōrero a tētahi atu mēnā ehara i te rerenga whakakāhore. I ōna wā anō e tohu ana tēnei kīwaha i mōhio tonu te kaikōrero ka puta tētahi āhuatanga.\nHe aha hoki!  - whakamahia ai tēnei kīwaha hei whakautu i tētahi atu kōrero, ā, he momo whakakāhore i taua kōrero rā i runga i te wairua whakaiti, whakatakē, whakangahau rānei. Tērā pea e hāngai ana ki te tangata nāna tonu te kōrero, tērā rānei e hāngai ana ki tētahi atu.\nHe aha te aha  - ka noho mai tēnei kīwaha ki te wāhanga whakamutunga o tētahi rerenga. E tohu ana i te kore whaihua, i te moumou taima noa iho rānei o tētahi āhuatanga e whakaahuatia ana i te wāhanga tuatahi o te kōrero.\nHei aha (noa iho) - ko tētahi tikanga o tēnei kīwaha, ko te 'kāore he take o te māharahara', pērā tonu i te 'aua atu'. Ko tētahi atu tikanga o te 'hei aha noa iho' e whakaatu ana i te whakapono o te kaikōrero kāore he take o te whai i tētahi mahi, i tētahi āhuatanga rānei.\nKei runga noa atu koe - he momo whakanui tēnei i te tangata, mōna i mahi i tētahi mahi pai. Me uaua ka rangona e whakamahia ana e te tangata mōna anō, engari arā pea ētahi wā ruarua ka taea. He wā anō ka taea te whakamahi hei whakaahua i te pai o tētahi atu mea, pērā i tētahi kaupapa.\nKoia kei (a koe) - ko tā tēnei kīwaha, he whakaatu tahi i te tautoko me te āhua mīharo o te kaikōrero ki te whakaaro, ki te mahi rānei a tētahi atu. Engari i tōna wā anō, ko tā tēnei kīwaha he whakahē i te kōrero, i te mahi rānei a tētahi tangata, me te tohu anō hoki he wā ka taka, ka kai taua tangata i ana hamuti, arā, ka hoki mai ngā hua kino o tāna mahi ki runga ki a ia. \n(Ka/he/te) tau kē (hoki)! - he whakamihi anō tēnei i te pai o te tangata, o tētahi mahi, o tētahi atu āhuatanga rānei. Mehemea ko te 'tau' te kupu tuatahi, me mātua noho mai te kupu 'kē' hei hoa mōna. I ētahi atu whakamahinga, kei a koe te tikanga ina raua atu te 'kē', kāore rānei.\nPiki, heke - ko tētahi tikanga o tēnei kīwaha, ko te 'kāore he take o te māharahara'; ko tā te tangata mahi mai rā anō, he kimi huarahi māna e tutuki ana tino kaupapa arā noa iho ngā āhuatanga o te wā. \nTe mutunga (kē) mai (nei) o te ... - whakamahia ai tēnei kōrero hei whakakaha ake i tētahi whakaaro, tae atu ki ngā whakaaro whakamihi i te tangata, i tētahi atu āhuatanga rānei, pērā i 'te mutunga mai o te pai'.\nTirohia hoki.\nHoto ki waho  .\nTohutoro.\n": {
        "id": 1,
        "processed": 1,
        "page_id": 585,
        "text_id": 74562
    },
    "He whenua, he kāhui moutere a Aotearoa i Te Moana-nui-a-Kiwa. Ko ngā moutere matua ko Te Ika-a-Māui ki te raki, ko Te Wai-pounamu, arā Te Waka-a-Māui ki waenganui, me Rakiura ki te tonga. Ko ngā whenua o roto o te Kīngitanga o Aotearoa ko ngā whenua moutere nei ko ngā Kuki Airani, ko Niue; he kāwanatanga ake o aua whenua, engari ka mau tonu he pānga wātea ki Aotearoa; ko Tokelau, me ngā wāhi kerēmetia rā o Antarctica ki ngā tahatai o te Moana o Ross. Ko Aotearoa he rōpū moutere e tū mokemoke ana, e roa rawa te tawhiti ki whenua kē.  E 2000 kiromita te tawhiti ki Ahitireiria, ko Te Tai-o-Rehua te moana wehe i aua whenua e rua.  Ko ngā whenua e tū tata ana ki te raki ko Niu Karatonia, ko Whiti, ko Te Moutere Nōpoke, ko Tonga. Nō te tau kotahi mano iwa rau mā whitu (1907), ka whakatūria a Aotearoa hei whenua āhua tū wehe. \n Ngā Ingoa.\nKo Aotearoa te ingoa Māori o nāianei mō te motu. Engari i tērā atu rautau, ko 'Aotearoa' tētahi o ngā ingoa mo Te Ika-a-Māui anakē. Koiarā i kī ai ngā tūpuna, 'ki a tātou ngā iwi o Aotearoa me te Wai-pounamu'. Nō ngā tau whakatūwhera o tērā rautau, arā nō te wā i mua i te Pakanga Tuatahi o te Ao, ka hurihia hei ingoa mō te motu katoa. Ko tētahi ingoa kāhore i te tino whakamahia i tēnei wā, ko Niu Tīreni, arā te whakamāoritanga o New Zealand. Ki ētahi, ko Nū Tīrani kē. Ko Aotearoa te ingoa e rangona whānuitia ana i tēnei wā.\n Ngā Reo.\nE toru ngā reo a te motu o Aotearoa: ko te reo Māori, ko te reo Pākehā, ko te NZSL.  Engari he nunui ngā reo e kōrerotia ana e ngā tāngata maha o Aotearoa nei. Hei tauira, ko te reo Hāmoa me te reo Rarotonga.\n Tirohia hoki.\n Hoto ki waho.\n": {
        "id": 2,
        "processed": 1,
        "page_id": 665,
        "text_id": 81648
    },
    "Ko Ūropi tētahi o ngā whenua rahi tuku iho e whetu o te Ao. Pērā i ngā whenua rahi katoa, he rerekē tōna rohe mēnā ka kōrerotia ā-tikangatia, ā-torangapūtia, ā-aha rānei. Heoti, e ai ki te nuinga ka toha a Ūropi mai te Moana Tiri ki te raki, ki te Moana Ranatiki ki te hauāuru, ki te Moana Rōwhenua ki te tonga, ki te tonga rāwhiti ki ngā Maunga Kaukas me te Moana Mangu, ā, ka wehuriatia i a Āhia e ngā Maunga Ural, e te Awa Ural me te Moana Kaspia ki te rāwhiti.\nAtu i tēnei whakamāramatanga auau, ki ētahi atu he wāhanga a Ūropi o Eurāhia (koi hauāuru), o Eurawherāhia rānei. E tapaina hokia ana i ētahi wā ko te 'whenua rahi tawhito' (te 'ao tawhito' rānei), hei aronga kē mō te 'Ao Hou', arā, ngā Amerika. \nE ai ki tōna rahinga whenua ko Ūropi te whenua rahi iti rawa tuarua o te Ao, me ōna km² 10,180,000, arā, 2% o te mata o te Ao. Engari, koia te mea nui rawa ruatoru e ai ki tōna taupori (whai muri mai i a Āhia me Āwherika), me ōna kainoho e 710,000,000, 11% rānei o ngā tāngata o te Ao. Ko Ruhia tōna whenua nui rawa ā-rahinga, ā-taupori hoki, ā, ko te Tāone Vatikano te mea iti rawa. \nKo Ūropi te wāhi whānau o te tikanga Hauāuru. He tūnga whakaawe ō ngā whenua o Ūropi mai te rautau 16; tae noa atu ki ngā rautau 17, 18 hoki i raro iho te nuinga o Āwherika, ngā Amerika me Āhia i te maru o ngā whenua o Ūropi. I timu haere tō Ūropi mana maru o runga o ngā take aohuri a muri i ngā Pakanga o te Ao e rua, kia riro ai i ngā Wehe Whakakotahi me te Kotahitanga Soviet. Nā te Pakanga Mātao i waenganui i ēnei whenua e rua a Ūropi e weheruatia ki ia taha o te Ārai Rino. Ka puta te Kaunihera o Ūropi me te Kotahitanga Ūropi i te kōmitimiti ki te hauāuru, ahakoa kei te whakawhānui whakaterāwhiti nō te hinganga o te Kotahitanga Sovet i te tau 1991. \n Mātai Whenua Torangapū.\n \n \n Hoto ki waho.\n": {
        "id": 3,
        "processed": 1,
        "page_id": 1570,
        "text_id": 82087
    },
    "Ko Hāmoa he whenua i te Moana-nui-a-Kiwa. He Porinīhia nga tangata. Ko te reo Hāmoa (reo Hamoa gagana Samoa) te reo o nga tangata whenua. I te tau 2009, e 179,000 nga tangata e noho i roto o te whenua katoa. He tekau nga motu, ko Savai'i me Upolu nga motu nui. Ko Apia te tāone nui, e tu i Upolu, anō, te papa rererangi nui ko Fale'olo International Airport.\nI te tau 1962, na tutahi ai Hāmoa mai Aotearoa.\nHe tino nui nga tangata Hāmoa e noho i nāianei ki waho o ratou motu. I te tau 2001, he 115,000 i roto o Aotearoa,  me he nui hoki ngā Hāmoa ki Hononga-o-Amerika, Hawai'i me Ahitereiria.\nKo Silisili te maunga teitei rawa o Hāmoa, e tu ki te motu o Savai'i. E 1,858 mita te teitei.\n Ngā wā ō mua.\nKāore e tino mōhiotia te wā i tae atu ai ngā tāngata Porinīhia ki Hāmoa. Engari, ki nga whakatewhatewha o nga kaipūtaiao Pakeha i Hāmoa, he whakapono ratou, na tatūngia nga tangata i nga motu, mai ano 3,000 tau. Ko Te Rangi Hīroa tētahi kaituhi na haere i Hāmoa mo tona mahi me ka tuhituhi e ia te pukapuka Samoa Material Culture.\nAnō, ko Robert Louis Stevenson tētahi kaituhi na noho i Hāmoa ma tōna whānau ki te kāinga o Vailima. Ko te wā o tana matenga ki Hāmoa ko te tau 1894 me he nehua ia ki te maunga o Vaea ki Upolu. \n Ngā motu.\nHe 10 ngā motu o Hāmoa, ngā ahi tipua katoa. E whā ngā motu e tu ai nga kāinga, ko Upolu, Savai'i, Manono me Apolima. Kāore e tu ngā kāinga ki motu iti'iti, ko Nu'utele, Nu'ulua, Namua, Fanuatapu, Nu'ulopa me Nu'usafe'e.\n \nKo Savai'i te motu nui rawa atu i te whenua katoa. E ai ki te whakataukī o reira, ko Savai'i 'te wairua o Hāmoa'. 43,103 (2006) ngā tāngata e noho ana i reira. Ehara i te tino nui ngā tāone i Savai'i; he kāinga rīriki noa iho te nuinga. Kei Upolu, he motu anō, ngā tāone nunui. E rua herenga kaipuke i Savai'i, ko Salelologa te tāone nui o te motu me Asau tētehi.\nI Savai'i hoki ngētehi wāhi nō nehe noa atu: koia hoki te puke o Pulemele'i, ngā pehu wai tai o Taga (ko Alofa'aga tētahi ingoa), me te Tapuae o Moso. E rua tekau maero atu a Falealupo i te Rārangi Huringa Wā o te Ao, ā, koia te kāinga hauāuru rawa atu i Hāmoa. Kei roto i ngā pukapuka o Pākehā, i ngā tau tīmata o tērā atu rautau, i ngētehi wā i karangahia rā te motu ko Pola. Ko Matavanu he maunga ahi tipua anō hoki i runga i a Savai'i, i hū i nga tau 1905 - 1911, ā, ka puta mai te rangitoto, ka rere iho i te tihi o te maunga.\nE tu ngā wāpu ki Mulifanua i Upolu me Salelologa ki Savai'i mo ngā waka tere ki waenganui o Savai'i me Upolu. \n Takiwā tōrangapū.\nHe 11 nga takiwā tōrangapū o Hāmoa; he 6 ki Savai'i me 5 ki Upolu me nga motu iti ētahi atu.\nNga takiwā tōrangapū e 6 kei te raki o Savai'i ko Fa'asaleleaga, Gaga'emauga, Gaga'ifomauga, Palauli, Satupa'itea me Vaisigano.\nNga takiwā tōrangapū e 5 kei te raki o Upolu ko A'ana, Aiga i le Tai, Atua, Tuamasaga me Va'a o Fonoti. Te takiwā o Aiga i le Tai tae ana nga motu o Manono, Apolima me Nu'ulopa. \nE rua nga papakainga no Savai'i e tu i Upolu, ko Samalae'ulu me Le'ava'a. Nga papakainga e rua ēnei kua whakamōtī i te hūnga o te ahi tipua, te maunga Matavanu ki Savai'i.\n Reo Hāmoa.\nKo te reo Hāmoa nō te reo whānau o ngā iwi o Porinīhia, arā he reo ka ahu mai nō te Moana-nui-a-Kiwa, me te aha, e ōrite ana te reo Hāmoa ki te reo o Māori, o Tonga, ā, o ngā moutere Porinīhia anō hoki. Ko te mihinare George Pratt (1817-1894) ka tuhituhi te tikinare mataati o Hāmoa i te tau 1862.\nE 40 tau i noho ai Pratt ki Savai'i.\n \n Whakaahua.\n \n Tohutoro.\n": {
        "id": 4,
        "processed": 1,
        "page_id": 3645,
        "text_id": 82156
    },
    "He Pūranga tēnei o te whārangi kōrero o te Hau Kāinga.\nSome of these comments could be just as good or better on our general talk page.  Anyone who likes can copy to there; but Hau Kāinga is a good page to look at when thinking about these points.\n Te in page names.\nSome readers may have noticed in my recent page history comment that I was wondering whether page names should include Te.\nOnly one of our articles currently does (te reo Maori); but a great many of the links in Hau Kāinga are looking to create pages starting with Te. \nHere are some reasons AGAINST:\nRobin Patterson 03:12, 17 Apr 2004 (UTC)\n:I think you're probably right - it makes sense not to include te. -- Vardion 02:28, 1 May 2004 (UTC)\nKa pai! Thanks for dropping by and adding to your already long list of contributions. You may notice I already excluded most of the te from the links. Robin Patterson 11:38, 1 May 2004 (UTC)\n Coloured boxes.\nRobin here again. Can someone (preferably the person who composed or translated the heading) explain the meaning - and perhaps the envisaged long-term scope - of Iwi Whānui (so that some of us can get a better idea of whether it might be just as good underneath the much bigger box)? It looks a bit small since I moved the stuff that didn't relate to this Māori Wikipedia. 202.27.88.100 06:38, 21 Apr 2004 (UTC)\n:(Sorry about the slow response - I didn't notice this question...). I intended Iwi Whānui to mean community, as in the Wikipedia community. Whether I've used the term in the proper context, I'm not entirely certain. The box was based on the equivalent one on the old English Wikipedia main page, which served much the same function as the new Community Portal page. -- Vardion 02:28, 1 May 2004 (UTC)\nE pai ana, e hoa! I had worked out that you probably meant something like that (which means my translation sources must agree with yours). I'm considering moving it too, to go BELOW the specifically NZ material, so that the NZ columns have more room to display and expand. We have such a swag of material there, with scope for much more, and those specifically Maori subjects are what most of our serious visitors will have come to see - not the general Wikipedia links. I would be pleased if you decided to move it there, because you are far more used to tables than I am! \nNow I hope you and less frequent visitors have a glance at most of the new additions and changes, with a harder look at some of them. Kind regards - Robin Patterson 11:38, 1 May 2004 (UTC)\n New Meta page - List of articles all languages should have.\nHi. I dont know if this is the right place to post this, but you may want to see our new Meta page: List of articles all languages should have. It is intended to give a boost to the smaller languages. Hope it helps. 64.12.116.12 20:27, 29 May 2004 (UTC)\n:OK, had a look. Impressive list, which could be a handy checklist. But it's not finished yet, so we had better revisit the Meta page from time to time. The Latin WP has made a copy, which is in the process of being translated (with Simple English visible as links.) - Robin Patterson 08:40, 3 Jun 2004 (UTC)\nContacting speakers; contributions from learners.\nHi, has anyone contacted any of the grassroots organizations yet?  Just curious.  Though I imagine even a sort of simple Maori (i.e. Maori composed using available vocabulary) written by young learners would be useful.  67.242.13.42 17:02, 9 Oct 2004 (UTC)\n:Yes, I have (as mentioned on the Korero page) communicated in one way or another with Maori TV, the Maori Language Commission, CommunityNet, and several tribal websites or  guestbooks. More approaches planned. Also mentioned it to all or most NZ members of the English Wikipedia. And as a new though old learner I've contributed about 95% of the articles. Ever hopeful of getting significant contributions from more than the current handful of contributors who know more than I do. Kia ora koe. Robin Patterson 22:40, 10 Oct 2004 (UTC)\nRemoval of Māori-language content from the main page (and elsewhere).\nI'm not prepared to allow it unless it is replaced in the same edit by better-quality Māori material. Robin Patterson 11:37, 10 July 2005 (UTC)\n Revert of node_ue's changes.\nHi Robin, hi node_ue,\nI have reverted the two changes by node_ue.\n1) concerning the position of the English intro: \n1.1) I firmly believe that it is up to the mi team to decide where to place this invitation for English-speaking people. Unfortunately the majority of ethnic Maoris do not speak their own language well. Besides Maori is official language in New Zealand, and we have to assume that a \n:Yes, that is certainly true, but this Wikipedia is for people who DO speak Maori, not just everyone of a Maori ethnic background.\ngreat number of people from New Zealand with non-Maori background will just come around to have a look. From what I know, at least a bit of Maori is taught to everyone in NZ at school. So node_ue, you do not have to be the language police here. Just leave it up to true Kiwis to decide where to put this. So far I have not seen any complaints about the mi main page, apart from you, who are neither Maori nor Kiwi.\n:Why should being from Germany give you any more authority than me, if you're not Maori? And if being from New Zealand is such a big deal, why is Rocastelo a sysop, hailing from Galicia in Spain? And why do you presume so much authority, being in Hamburg? \n1.2) While it might be arguable, whether or not the English invitation deserves the first line, I think that it is definitely out of place where node placed it. It is below a longer paragraph in English. I think a good place would be an info box in a right column. But I do not want to \n:I don't think it's arguable. I think it DEFINITELY doesn't belong on the first line. I just didn't want to remove it altogether because I knew Robin Patterson would have a fit.\ninterfere with that. Let us just leave that for the Maori team to decide. And node: you and I do not belong to this team. So just leave them in peace.\n:Please see Template:Stub which I recently improved. What are your contributions here? What are your qualifications? Is your Maori any better than mine? Are you Maori? Or are you a white guy who can't speak very much Maori at all, and who likes to think he's more qualified than others just because he's from Germany?? And if I have no business here, what business do you have here Heiko? Why don't you go work on the Low Saxon Wikipedia?\n:Also, I find your view of Wikipedia communities as exclusive and impenetrable laughable and at the same time very offensive. The whole point of Wikipedia is collaboration, not saying Ha ha ha! You can't join!.\n2) Concerning the Macron-edit:\n2.1) node, your version has added two links, one to Haere mai and one to Wikipedia. But these two pages do not exist so far. Of course a page about Wikipedia will eventually be written. But we \n:So what? That's what redlinks are for. So that people will make the pages there.\ndo not know whether the mi team will have a separate page Haere mai, which (as far as I know) means welcome. So I think it would have been better in this case to wait until such a page exists before it is linked to. \n:Why wouldn't we have one here? Most other Wikipedias have one. I think that we, as a community striving to build a Maori-language Wikipedia, are desparately in need of a good welcome page in Maori that explains who we are, what we are all about, and how to edit Wikipedia. Redlinks are an invitation for the creation of such pages.\n2.2) the macron-text was inside a comment, so it is not visible and it did not annoy anyone but the language police. For someone who was blocked for a week here, node, I think that this is not a good restart for you here.\n:Heiko, in case you didn't notice, the exact same text is reproduced in MediaWiki:Copyrightwarning and so the comment on each page has been rendered obsolete. Currently, it's a waste of space.\nMy proposition to node: before making any further changes in any article, you should propose your changes in a *friendly* way on the corresponding talk page. Otherwise I fear you are in danger of getting a much, much longer blocking here.\n:My proposition to you, Heiko: either join a community, or stay out, but don't sit on the fence telling people they can't come in when you aren't really even in yourself.\nMy proposition to Robin: write protect the main page. You have had trouble enough about it. Everyone would still be able to leave comments in the talk page.\nMY* proposition to Robin: Revert Heiko Evermann's changes, or at least unprotect the page. mi.wiki is relatively low-traffic, explicit vandalism to the mainpage is generally fixed very quickly and doesn't happen very often at that. As a Wikipedia page, the whole point is for it to be editable by everyone. Sure, there may be some edit conflicts, but unless it degenerates into a full-scale edit war, protection is unreasonable.\n:For examples of relatively large Wikipedias that don't have protected mainpages for the very reasons I gave above: Estonian, with over 10700 articles; Korean, with over 11700 articles; Ukrainian, with over 19100 articles... Compared to the less than 1000 articles on the Maori Wikipedia, don't you think that it's a bit unreasonable for us to have a protected mainpage? You may think these people never deal with revert wars or vandalism but in fact they do. They are just very committed to the spirit of Wikipedia. --Node ue\nNode_ue since you're from Arizona you shouldn't be putting others down for being from where they come from. But since they are here they must be interested in the Maori language as well. Concerning  the protecting of the main page, it is interesting to note that you seem to be in the habit of deleting content from the Ladino wikipedia, to the extent that it could be considered vandalism. Auxilingua\n:Auxilingua, I notice you have a sort of ongoing campaign of slander against me at various Wikipedias. You seem to like to tell people that I have vandalised lad.wp. Well, I have not. And besides, you don't have much of a position there -- you're sysop why, because your buddy from ia.wp, Jay, made you one? Because of course, we all know you're from Turkey/Israel/Morocco. --Node ue 15:42, 28 Whiringa-ā-nuku 2006 (UTC)\nDeprecated project.\nKia ora. Please remove the link to sep11.wikipedia.org from your main page. It is no longer supposed to be linked to (check 95% of the other Wikipedias, including en:). Thank you. 11:30, 20 August 2005 (UTC)\nIdo language.\n Redesign.\nDoes any one agree that the main page needs a redesign? I would have a go at it, but I'm just any ordinary user (need admin access to edit the main page).\nHeoi anō; nā Brian New Zealand 09:24, 15 December 2005 (UTC)\n: I had a quick go  see here for my design, if no one objects to it by the 18 December, I'll put it live (since my last post I have been made an admin)\n:Heoi anō; nā Brian New Zealand 23:34, 15 December 2005 (UTC)\nSee my final proposed redesign HERE, Heoi anō; nā Brian  (talk) 19:01, 17 December 2005 (UTC)\n:I Retreat, as User:Robin Patterson pointed out, their are, a few bugs to work thru. I will work them out, and have a second final draft soon (might be after christmas/new year, as I am about to go on a hoilday) Please feel free to leave me comments HERE, My current design is located HERE. if you view the page, and see any errors, please let me know. \n:Heoi anō; nā Brian  (talk) 06:00, 18 December 2005 (UTC)\n Latin.\nPlease add latin to the links on the front page. Thank you.\n Logo.\nPlease make a Maori version of the logo. 2006-02-05 17:12:08 66.177.138.113\n:See similar heading below. Robin Patterson 21:27, 20 Hui-tanguru 2006 (UTC)\nPukapuka Taki Pātauranga was a typo.\nI looked at  - http://en.wikipedia.org/wiki/Main_Page_alternate_%28Classic_2004%29 - the en. Wiki main page as of 2004 and realised that that was the basis of our Hau Kāinga page. The headings equivalent to our 'Pukapuka Taki Pātauranga' and 'Iwi Whānui' were 'Encyclopedia' and 'Community.' I retranslated Community, since Iwi Whānui isnt quite right for that. Then I looked up 'Encyclopedia' in various M. dictionaries, and in the Ngata dictionary it is 'Pukapuka Taki Mātauranga'. So that explains where the mystery Pātauranga came from - a typo!!!  I retranslated that heading as Mātāpunenga (encyclopedia) in accordance with what we call ourselves. I also replaced the obscure (but in the dictionary) Kohuku meaning unfinished with the plainer and more comprehensible 'hei whakaoti' 'to be completed'.  Kahuroa 18:35, 14 Hui-tanguru 2006 (UTC)\nRevamped main page.\nGreat stuff! Now I wonder whether Āwhina mai - whakamāoritia! is the best starter. We seem to have lost the invitation for first-time visitors to browse and LEARN something. A recent version had the heading Akona followed by Hei tauira, titiro koa ki ēnei whārangi papai: ...; and the sitenotice mentioned the idea of learning too. Most visitors are unlikely to contribute directly but may turn into devotees and ambassadors if they like what they read. Robin Patterson 19:33, 19 Hui-tanguru 2006 (UTC)\n:Tēnā. Shifted stuff around - have to keep a rough balance (in the amount of content) between the two columns as well - how's that. Kahuroa 04:28, 20 Hui-tanguru 2006 (UTC)\nTino pai! I've just printed a copy (regrettably not in colour) and pinned it to the second-floor kitchenette noticeboard in Guardian Trust House, Poneke. Interesting to see that the printable version put only a single line of print to the right of the image then resumed at the bottom. Perfectly legible though. Ka kite, e hoa. Robin Patterson 19:11, 20 Hui-tanguru 2006 (UTC)\nFloating logos/icons.\nBother! The printed version has a more serious error: the logos for the sister projects float up to near the top of the page (p2) instead of sitting in their boxes. We need an image expert. BrianNZ?? (An alternative could be to put those on another page altogether.) Robin Patterson 21:27, 20 Hui-tanguru 2006 (UTC)\n:See what BrianNZ has to say - otherwise I've got a mate I could ask Kahuroa 22:56, 20 Hui-tanguru 2006 (UTC)\nAs soon as I'm at a printer (or as soon as my new ink arrives) , I'll have a look. (The the printable version link makes it look okay) Heoi anō; nā Brian  (talk) 23:42, 20 Hui-tanguru 2006 (UTC)\n: it looks ok on my system. Text beside image ok, not broken up into different sections. No floating icons. The left column is a bit skinnier than the right one, but otherwise ok. Kahuroa 08:03, 21 Hui-tanguru 2006 (UTC)\n::I printed it and it looks okay for me. The only complaint is the left column is smaller than the right one. (No big deal, as the main page is not likey going to be highly printed) Heoi anō; nā Brian  (talk) 08:45, 21 Hui-tanguru 2006 (UTC)\nStill crook, folks! When I click for the printable version now, the logos for Ngā pūtere kōpūtahi display floating at the top of the page, so I'm not even going to try printing again. Maybe it's time for Kahuroa's mate to come on board? Or User:Grutness, another image expert? Robin Patterson 21:18, 21 Hui-tanguru 2006 (UTC)\n": {
        "id": 5,
        "processed": 1,
        "page_id": 4038,
        "text_id": 45280
    },
    ":Robin: What Internet browzer are you using? 125.236.44.45 21:48, 21 Hui-tanguru 2006 (UTC)\nIE; probably version 6; the main folders in C:\\Program Files\\Internet Explorer are dated July 2002. But we recently had parts of Office 2003 installed. Robin Patterson 23:18, 21 Hui-tanguru 2006 (UTC)\n:Ha, I just got an email from my mate, he's doing a big OE in Montreal so probably wouldn't want to get involved! Sorry. It's actually more likely to be a minor error in the table code than anything to do with images per se. Anyway I'll redo the whole page over the next week or so, testing it on my user page. Kahuroa 08:04, 22 Hui-tanguru 2006 (UTC)\n::Looks fine for me when its printed 125.236.44.43 20:21, 22 Hui-tanguru 2006 (UTC)\nThank you all for taking an interest. My display is back to how it should be but the actual print of the printable version still floats the dear little beggars to the top of their page. I may try temporary solution: Give that section its own page, with links from main (so that our initial presentation is closer to flawless) and portal. Robin Patterson 21:15, 22 Hui-tanguru 2006 (UTC)\nLogo (moko).\nThe  Wikipedia The Free Encyclopedia image at the top left of the page should be translated into Māori too. 2006-02-21 09:07:03 203.109.164.4\n:Kia ora! People have been giving some thought to that. Not top priority yet. See Wikipedia:Kōrero/2005c. Robin Patterson 21:27, 20 Hui-tanguru 2006 (UTC)\n Te Matatiki has a much better word for logo: waitohu. And the page could be called Waitohu o Wikipedia - funny without the 'o'.  BTW Any thought been given to the transliteration of Wikipedia, since there is no d in the M alphabet? The closest would be Wikipiria  - I note that Hawaiian has Wikipikia' which is the closest you can get in Hawaiian Kahuroa 22:54, 20 Hui-tanguru 2006 (UTC) copied comment to logo page Heoi anō; nā Brian  (talk) 23:52, 20 Hui-tanguru 2006 (UTC)\n:Please see  Wikipedia:Kōrero/2005c,for a Korero, about our Waitohu. (page has been there for a while now  Last modified December 17, 2005) Heoi anō; nā Brian  (talk) 23:26, 20 Hui-tanguru 2006 (UTC)\nMore ideas for minor main page adjustments.\nShould I try them direct or would you folks like to see them tried elsewhere first? Robin Patterson 20:33, 19 Poutū-te-rangi 2006 (UTC)\nDone a few little ones. I suppose I could list the bigger ones here for perusal. That will have to wait till lunchtime. Robin Patterson 22:34, 19 Poutū-te-rangi 2006 (UTC)\n(Sorry, got tied up. And no PC at home just now.)\n:One important thing we need to do to improve the functionality and attractiveness of the main page is to to reduce the number of links in each section. There should be a limit as to how many there are. Too many is overkill. Kahuroa 00:25, 21 Poutū-te-rangi 2006 (UTC)\n::Well, maybe you should have removed those italicised links instead of just restoring their otherwise unexplained disorder (alphabetically). Cut away! Robin Patterson 01:31, 21 Poutū-te-rangi 2006 (UTC)\nMost or all of the Wikipedia reo kē appear elsewhere on the page. I'd be quite happy to lose all of the ones that don't have the justification of a Maori translation. Robin Patterson 01:31, 21 Poutū-te-rangi 2006 (UTC)\nI think we could do without the sister projects; some other page, OK, but I see no value in having them on our main page. Robin Patterson 01:31, 21 Poutū-te-rangi 2006 (UTC)\n:Please don't delete the sisters. Their value is in the colour and graphic elements they introduce. Removing them will return the main page to its bleak former state - a bland boring collection of links. Kahuroa 19:42, 21 Poutū-te-rangi 2006 (UTC)\nI also have plans to remove 70% of the English content: everything starting from There are at least ... - that may please some of you! Most of what's virtually repeated on the Tomokanga hapori is unnecessary on the front page. Robin Patterson 01:31, 21 Poutū-te-rangi 2006 (UTC)\n: Like your ideas re the main page - I just had to do a temporary reversion since the placement of the welcome line (in Maori) upset the format by introducing a line of colour above the heading. Once I fixed that I expanded the welcome line into a paragraph and moved some of the Maori content to the other column to keep it balanced and then tried to recreate your changes such as the removal of the extra English content (the inclusion of which wasn't my idea in the first place by the way). Many thanks!! Kahuroa 10:57, 23 Poutū-te-rangi 2006 (UTC)\nGood recent reshuffle, Kahuroa. I had been thinking that the Tīmata pēnei was a little premature near the top left, inviting response start what? - so your moving it to the other column and renaming is great. I had a feeling there was scope for integrating that para and the following one, but only a fluent speaker could start on that sort of task! Robin Patterson 20:25, 23 Poutū-te-rangi 2006 (UTC)\nShould the tāone nui be a subsection of Aotearoa? Maybe replace at the bottom with a short Whenua me tāone o te Ao? Robin Patterson 20:25, 23 Poutū-te-rangi 2006 (UTC)\n:Sure - tho I'd prefer we called the new short section Ao whānui as a catch all for overseas stuff. Kahuroa 00:17, 24 Poutū-te-rangi 2006 (UTC)\nMoved the towns without replacement, a few days ago. Problem with Ao whānui is that the other sections belong in it too, don't they? How about Tāone nui o te Ao (ie anything bigger than Akarana)? Robin Patterson 03:42, 10 Paenga-whāwhā 2006 (UTC)\n:Comment: We have a section Aotearoa. That is, NZ. I was suggesting another section Ao whānui = rest of world/wider world. Then you could have a subsection under that  Taone nui   Kahuroa 06:20, 10 Paenga-whāwhā 2006 (UTC)\n::But doesn't Ao whānui include the whole world, not just the rest of the world? And it includes tikanga and tāngata? Robin Patterson 20:20, 10 Paenga-whāwhā 2006 (UTC)\n:::Not when it is contrasted with Aotearoa. You seem to have a different understanding of whānui. Ao whānui = the wide world. I like it, there's nothing wrong with it. Alternative is 'Whenua kē'. (Whenua me taone...' is a bit anglified).Kahuroa 00:12, 11 Paenga-whāwhā 2006 (UTC)\nThat image that just went up is nice, well done! :) Heoi anō; nā Brian  (talk) 00:25, 9 Paenga-whāwhā 2006 (UTC)\nFor better column balance, how about moving Akona: he whārangi papai hei tauira to right-hand column? Robin Patterson 03:42, 10 Paenga-whāwhā 2006 (UTC)\n:Comment:Wouldn't that make it worse? The left-hand column has a little less in it than the right as it is. Or do you mean something else by balance? Kahuroa 05:58, 10 Paenga-whāwhā 2006 (UTC)\nThat's interesting - on my display in Cologne Blue skin the left-hand is longer: weta is in line with YahooNews. Maybe it's time I left that page alone and tried to add some more real content. Robin Patterson 20:20, 10 Paenga-whāwhā 2006 (UTC)\n:Naku i whakatakoto ētahi o ō whakaaro. Pai ake. Kia ora. Kahuroa 10:24, 18 Haratua 2006 (UTC)\n Revisions.\nDear Maori Wikipedians, I really enjoyed those revisions, they seemed to give it a more ethnic feel.  I particularly liked the english box, as I think that ought to be a lot more ecumenical than the straight Maori look the last one had.  Sure hope this place can get more sites.  Cheers! Sincerely, 68.253.218.140 05:38, 23 Haratua 2006 (UTC)\nQuality.\nI think we need to apply some criteria to the pages used as examples etc, especially those cited as whārangi papai.\nWill be gradually implementing this. Kahuroa 23:10, 4 Pipiri 2006 (UTC)\nKa pai. Several of the links in the whārangi papai are now so much poorer than the best of the recent additions that I would be pleased if you would either improve them or delete them from that list. Fifteen excellent pages would be better than 15 excellent plus six patchy. (Slightly different criteria should apply to the formerly-matching list in the Wikipedia:Tomokanga hapori, because of its different target audience, but your improvements would be most welcome for pages listed there too). Robin Patterson 03:55, 12 Pipiri 2006 (UTC)\n Link to Macedonian Wiki.\nKia ora! I  am an administrator from the Macedonian Wiki and I see that you have only some languages listed directly at the bottom of the page and I was wondering if you could put the Macedonian Wiki there as well (in case you don't have some special criteria for that). Should you decide to accept it, the code should look like this: '. The original name of the language in the latin alphabet is Makedonski. I don't know whether you will transliterate it into Māori from the English name or directly from the original. I leave that to you. All best and thanks a lot. Б. Јанкулоски\nKia ora anō koe - nāku nei i āpiti Kahuroa 19:20, 11 Pipiri 2006 (UTC)\nMore revamp?.\n(First para copied from what Kahuroa wrote elsewhere.)\nI would like to reformat the page. To do it I need all the articles under 'Awa' or 'X' to be in the category 'Awa' or 'X' and for the Awa catpage or the 'X' catpage to have been created. It's daunting to have to do everything before you can start things. Kahuroa 19:29, 13 Pipiri 2006 (UTC)\n:Excellent idea. I thought we had a :category:awa but with very little in it. Maybe not. And several other subjects that would be ideal for such a revamp are definitely not categories yet. I'm happy to help in both aspects of that, but it needs a mi-3 to decide what the names of the categories should be. Robin Patterson 20:34, 13 Pipiri 2006 (UTC)\nOK - what about the titles of the subsections on the left side - like Ao Māori, Tikanga-ā-iwi, Pūtaiao - I did Maunga already or most of them - some of them may be cats already but the articles havent been tagged in some cases. Kahuroa 00:07, 14 Pipiri 2006 (UTC)\n:Great start; I'll see if I can get something usable before heading for home tonight. Robin Patterson 00:56, 14 Pipiri 2006 (UTC)\n Nice.\nHave not viewed mi for a while. The mainpage looks Kai Pai! 125.236.44.44 03:13, 16 Pipiri 2006 (UTC)\n:It does indeed - good work Kahuroa et al! Grutness 05:09, 23 Pipiri 2006 (UTC)\n": {
        "id": 6,
        "processed": 1,
        "page_id": 4038,
        "text_id": 45280
    },
    "Ko te Hāhi Tika o Ihu (Reo Pākehā: True Jesus Church) he hāhi tū wehe i whakatūria i Peihinga, Haina i te 1917. Ināianei, kua tae ki te 1.5 miriona ngā mema i ngā whenua whā tekau. I puta mai te hāhi hei rerenga hainamana o ngā hāhi e kīa nei he hāhi petekoha. Ka puta mai aua tūmomo hāhi i ngā tau whakatuwhera o tērā rautau. Ka whakahē te hāhi ki te tikanga o te tokotoru tapu; ka piri kē ki te whakaakoranga o te Ingoa o Ihu. Nō te 1990, ka poua te hāhi i Aotearoa e ngā tāngata manene i tau mai i Taiwana, he whenua i Āhia ki te rāwhiti. Kāhore e whakanuia e ngā mema o te hāhi ngā rā o te kirihimete, o te aranga rānei, i tō rātou whakaaro he rā mohoao ērā.\nNga Whakapono o te Hāhi:\n Ko te iriiritanga ki te wai te hākarameta hei muru i ngā hara, hei whakaora anō i te tangata. Ka iriiria te tangata i roto i te wai ora, wai tūturu pēnei i te awa, te moana, te puna rānei. Ka whakahaeretia te iriiritanga e tētahi Kaiiriiri kua iriiri kētia ki te wai, kua whiwhi kē i te Wairua Tapu, i runga anō i te ingoa o te Ariki Ihu Karaiti. Me rumaki katoa te kaiwhiwhi iriiritanga ki te wai, me te tupou, te anga whakararo hoki, o tōna māhunga.\n Mā te hakarameta o te horoi wae ka whai wāhi ai te tangata ki a Ihu Te Ariki. Hei whakamaumahara tonu rā ia me whiwhi e te tangata te aroha, te tapu, te whakaiti, te murunga hara, me te tūmautanga. Ko ia ka iriiritia ki te wai, kia horoia ōna wae ki te ingoa o Ihu Karaiti. Me whai ngā tikanga o te wā me te wāhi te horoia o ngā wae o tētahi e tōna hoa, me ō tōna hoa e ia. \n Ko te Kai Hapa he hakarameta hei whakanui i te matenga o Te Ariki Ihu Karaiti. Mā reira tātou ka kai ai i te kikokiko me te toto o tō tātou Ariki, ka noho pātata ai ki a Ia kia whai oranga mutungakore ai tātou, kia ara ake ai tātou i te Rā Whakamutunga. Me tū taua hakarameta nei I ngā wā ka taea. Kia kotahi te parāoa rēwena-kore, me te inu kerepi. \n Ko te Hāpati, te rā tuawhitu o te wiki (Rāhoroi) he Rā Tapu, nā Te Atua i whakatapu, nāna i whakapai. He mea whai i raro i te tohu aroha o Te Ariki, hei whakamaumaharatanga i te orokohanganga me te whakaoratanga a Te Atua, ā, ki te tūmanako hoki o te whakangā mutungakore o te ao kei te haere mai.\n Ko te kupu ko Ihu Karaiti nāna i whakakikokiko a tinana, nāna tonu i mate rīpeka kia murua ai ngā hara o te hunga mau a hara, nō te rā tuatoru, nāna hoki i whakaora ai, i whakairia ki te rangi tūhāhā. Koia anake te ōranga o te ira tangata, te kaihanga o te rangi me te whenua, te atua tupono o ngā atua katoa.\n Ko Te Paipera Tapu, arā Te Kawenata Tawhito me Te Kawenata Hōu, he ranga wairua nā Te Atua. Ko ia anake te pono ā-karaipiture, kei a ia anake ngā ritenga mō te ao Karaitiana.\n Ma te whakapono ki a Te Atua, ka tukuna mai e ia te aroha me te whakaoranga. Me whirinaki atu nga tangata whakapono ki te wairua tapu ki te whai i te tapuranga, ki te whakahonore i a Te Atua, me te aroha ki te tangata.\n Ko Te Rā Whakamutunga, ko te Hokinga Tuaruatanga o Te Atua ina heke mai ia i te rangi ki te wharite, whakawā i ngā iwi katoa; ka whakawhiwhia te hunga tika ki te oranga tonutanga, ka peia te hunga kino mō ake, ake, ake.\n Hoto ki waho.\n": {
        "id": 7,
        "processed": 1,
        "page_id": 5751,
        "text_id": 81807
    },
    "Ko Porinīhia Wīwī he whakaminenga o nga kahui moutere e rima kei te putahi o te Moananui a Kiwa kei nga pae 7° ki 27° S me nga pae 134° me 155° W.\n1,544 sq maero (4,000 sq km) te takiwa, 258,000 nga tangata noho, 130 nga motu a kua 5 nga kahui moutere ara ko te kahui o Tahiti (Society), ko te kahui o Tuamotu, ko te kahui o Mangareva (Gambier), Ko te kahui o Enana (Marquesas), ko te kahui o Tubuai.\nKo Tahitinui te motu nunui o te whakaminemnga nei a kei reira hoki te taone matua a Papaete. \n Nga Kahui Moutere.\n130 nga motu, kua 5 nga kahui moutere i whakamaua e Wīwī a kua tapiana ko Poronihia Wīwī.\n \n Ko te Kāhui o Tuamotu mai i Tahiti ka rere ki te rawhiti ka tae ki Tuamotu e 80 nga moutere nei 280 maero te takiwa. Ko Rangiroa te motu nui o tenei kahui 29 maero tona rahi. Kei te kahui o Tuamotu nga motu a Mururoa me  Fangataufa, nga mea i tukinotia e te pahu karihi o Wīwī. \n Ko te Kāhui o Tubuai (Australs) e 450 maero ki te tonga o Tahiti kua takoto nei a Tubuai 57 maero te takiwa e 4 nga motu noho tangata ko Rapa te mea noho mamao, a ko Marotiri me Maria nga motu kore tangata\n Nga Tangata.\nHe Tangata maori katoa nga tangata o nga Kahui moutere nei engari kia mohio pai ki a ratou me o ratou ake korero me titiro kia te hononga mo ia Kahui Moutere\n Korero Tupuna (Hitori).\nKei ia kahui moutere to ratou ake whakapapa me to ratou ake korero Tupuna. \nNa reira kua tuhia ki raro nei nga hitori mai i te taenga mai o Pakeha tae noa ki naianei\nI te rautau 1500 tokomaha ake nga tangata o nga moutere nei.  He kahui ariki nga mea tu ana ki  Tahiti, ki Bora-Bora, me Raiatea. Ko Teriaroa, ki te raki o Tahiti, te nohoanga ariki, a ko Taputapuatea, ki Raiatea, te marae tapu rawa o te Moananui a Kiwa. \nI te tau 1521 i kitea e Ferdinand Magellan i a Pukapuka i Tuamotu. I 1595 i kitea s Enua Enata, i kite ai a Makatea, Bora-Bora me Maupiti e Jacob Roggeveen ite tau 1722 a na Captain Samuel Wallis i kite i a Tahiti, Moorea, me Maiao Iti i 1767. \nI 1769 i haramai a Captain James Cook kia matataki i te rere o Kopu ki te rangi a i tapina te Kahui motu nei ko The Society Islands hei mihi ki the Royal Society nga mea i tautoko ai i tona tira. I kite ai a Tubuai e Cook i 1777. \nI te tau 1834 i haere mai nga mihinare no Wīwī ki Mangareva, a kua riro ki Wīwī i 1881. I haramai nga mihinare mai i Tahiti ki Tubuai. Engari i te tau i tono a Rimatara me Rurutu ki nga Ingarihi kia tu hei hoa mana engari i riro ano ki Wīwī i te tau 1900. \nKo Tuamotu he mea kei raro i te mana ariki o Pomare ariki o Tahiti, i riro ake enei me Tahiti i te tau 1847.\nKei te Kahui o Enua Enana (Marquesas), ko Nuku Hiva he mea riro tuatahi ki Amerika i te tau 1813 engari ka u mai tetehi manuao no Wīwī na te karanga o te ariki o Tahuata. Engari ka tautohe ratou me nga Wīwī, ka riri. Kua riro ki Wīwī ano te moutere ra i te tau 1842\n Te Whenua Wīwī.\nKua whakahaere nga kahui moutere nei hei taiwhenua o Wīwī.\nI 1885 kua tu he kawana no Wīwī me tethi kaunihere mo nga moutere. Engari kua riro ano te mana o tenei kaunihere i te tau 1899, a i 1903 kua korengia te mana o taua roopu.\nI 1940 tokomaha nga tangata maohi i uru ki te pakanga nui i Uropi ara WWII.\nI te tau 1946 i tapina ko Poronihia Wīwī he taiwhenua tawahi o Wīwī, ara kua tu he paremata taiwhenua a ka taea e ratou te tuku i tetehi tangata noa hei mangai mo ratou ki te Paremata nui ki Wīwī. I 1957 i whanuitia te mana o te paremata taiwhenua. \n Tahiti mo Tahiti.\nHei ahakoa te maunga o Wīwī i nga Kahui moutere nei ka whawhai tonu nga tangata maohi ra kia tu rangatira ano ratou.\nI te tau 1947 i tu rangatira ano ko Pouvanaa Tetuaapua Oopa me nga tangata karawhiu i te whakapehi o Wīwī. Kua aukatihia tetehi kaipuke no Wīwī. Kua mauheretia e te pirihimana engari i te tau 1949 i tautokohia te tangata hei mema o te paremata taiwhenua, a, i te tau 1951 ko tona roopu te mea nui o taua paremata taiwhenua a ko Pouvanaa Oopa te tumuaki tuarua. \nKo te kaupapa nui o Pouvanaa me ona hoa tautoko ko Tahiti mo Tahiti ara Tahiti for the Tahitians ... Vote NO so that the enslaving yoke will be quickly removed from around our necks'\nI mauheretia ano Pouvanaa Tetuaapua Oopa nei a kua tapaina tona roopu tautoko he mea ture-kore e te paremata nui ki Wīwī. E waru tau tona noho ki te whareherehere katahi ka panaia e te Wīwī kia noho kiritai\nI 1963 i timata ke nga Wīwī ki te whakapahu karihi ki  Mururoa. I 1975 i nekehia te whakapahupahu nei ki Fangataufa. Ka tu nga tangata maohi me etehi o nga tangata o te ao kia aukati te mahi tukino nei.\nI te tau 1975 i tu rangatira ano a Oscar Temaru me tona roopu torangapu a Tavini Huiraatira, e toru noa o ratou karanga ki tu rangatira te whenua o Tahiti ra, kia aukati te pahu o te pahu karihi o Wīwī, me te tohatoha pai i nga hua o te whenua. \n Te Raru o te Paremata.\nI te tau 2004 ka tu tautohe ano nga tangata na te nui o nga utu mo nga hua o te whenua me nga take pera. I te 15 o Pipiri 2004 i potihia a Oscar Temaru hei Tumuaki o Poronihia Wīwī, kua hinga ke te Tumuaki o mua ko Gaston Flosse. \nEngari ka kore e whakaae e te paremata (poti 27-28), a na Gaston Flosse i tono ki te Paremata matua ki Wīwī kia whakahaere tetehi poti hou mona.\nI tautokohia ano a Oscar Temaru i te tau 2006 kia tu hei pirihitane. Engari i te 13 o Hakihea 2006 kua whakakorengia ano e te paremata taiwhenua a kua pana.\nKua tu a Gaston Tong Sang hei Pirihitane i te 26 Hakihea 2006, engari i pana ano e te Paremata i te 31 o Hereturikoka 2007. Ka poti ano nga tangata o Poronihia Wīwī a te 10 Mahuru 2007\n": {
        "id": 8,
        "processed": 1,
        "page_id": 10980,
        "text_id": 80990
    },
    "Ko Taputapuatea te marae tino tapu rawa o te Moananui-a-kiwa e tu ana ki te papa whenua o Opoa ki te paerangi o Rangiātea (Ra'iatea).\nKo te marae tuatahi o konei ko Vai-otaha, no te 1200 pea ka whakawhanauihia, ka hanga te marae nui nei a Taputapuatea. E ai ki etehi na Kainuku Ariki me ona taina a Mahuta me Paea i kawekawe mai i nga papakohatu mai i Aitutaki me era o nga moutere kia hanga ai te tuahu o tenei marae nui e tu ana i te tahatai e ahu ana ki Avamo'a me te Moananui a Kiwa. \n Marae ātea.\nHe maha nga tahua paekiri, nga tuahu me era atu mea hanga kohatu ki Taputapuatea nei. Ko Taputapuatea me tona ahu te mea nuinui engari kei te taha e tu ana ko Havini. te marae o Tamatoa arii, me era atu o nga piringa marae. \nHei ahakoa ka whakaahua i raro nei te ahua o te Marae nui o Taputapuatea hei tauira.\nKo te ahua o te marae nui nei he tahua paekiri kua horangia ki te papakohatu. Kei tetehi pito e tu ana te tuahu me te ofai ti'a (he kohatu tapua rawa). 140 putu pea te roanga o te paepae i mua i te ahu, kua 10 putu pea te teitei o nga papakohatu kua titia kia tu hei paepae mo nga atua me nga ariki. Kua piri ano ki te paepae etehi papa whakairo e kia nei he unu\n Te Korero o te Marae nei.\nKo wai ka mohio inahea i hanga tuatahi mai te Marae Taputapuatea, i whakatapua ano. \nKua tawhito rawa te marae nei i nga rautau 1200, koina ko tenei wahi tetehi o nga kohanga o tatou nga uri o Hawaiki huri noa.\nKo te tikanga ko Taputapuatea te wahi i whakaminemine ai ngā tohunga me ngā whakatere waka kia whakatau i te wānanga kia whakatakato ano i nga ara moana mai i konei ki nga topito e wha o te Moanaui a Kiwa me ona motu. E ai ki nga tangata o Opoa ka noho tonu te tahu'a (Tohunga) o Taputapuatea ki reira engari ka taea e ia te tohu kei hea nga motu katoa o te Moananui a Kiwa, me te ara tika kia tae pai ki reira.\nKi ta etehi korero i nehera kua whakatapua a Taputapuatea ki te atua Tangaaroa, nawai ra ka tu ko Oro, atua o te riri hei atua matua ki Taputapuatea nei. Ko Oro te mea i mohiotia inaianei.\nMai i konei ka toro atu nga pononga o Oro ki era atu o nga moutere ara ki Moorea, ki Tahiti, ki Rarotonga tae atu ki Hawaii. Na ratou e kawe atu tetehi kohatu mai i Taputapuatea hei mauri kia hanga mai he marae ano ki era atu moutere.\n Fa'atau Aroha.\nNa ni'a Te-ao-uri, \nna raro te-ao-tea \nE to roa te manu e.\nKo te Hui Fa'atau Aroha (ara Whakatau Aroha) te hononga o nga iwi me nga moutere i runga o Taputapuatea nei. \nE ai ki etehi na Hironui (ara ko Whironui) te tangata nana i karangahia tenei huihuinga, ara nana e whakatere atu i tona waka ki nga moutere\nE rua nga minenga i whakatau mai nei ki tenei Hui Faatau Aroha ara te Te Aouri me te Te Aotea.\nKo nga motu Aouri era ki te tairawhiti i Raiatea ara ko Tahiti, tae atu ki Tuamotu, ki Rapa.\nKo nga motu Aotea era ki te taiuru i Raiatea ara ko Taha'a ko Porapora peka atu ki Rarotonga me era atu tae noa atu ki Aotearoa me Rotuma\nE ai ki Tu'au o Raiatea (Teuira Henry (1928, 119-128)) i timata ai te Fa'atau Aroha nei na te tamau o Poiriri, rangatira no Rotuma me Te'ura, wahine no Porapora. I tamaua ke ratou ki Opoa a ka hui mai nga ariki o nga moutere kia whakatau te aroha o ratou kia ratou.\n Te Hara i Awarua.\nTenei ano nga whakatauki o mua-\nToia e Rongorongo Aotea,\nka tere ki te moana.\nKo te hara ki Awarua i whiti mai ai i Hawaiki\nKo wai ka mohio te roanga o te Fa'atau Aroha ki Taputaopuatea nei. Ka penei tonu te whakaminemine mai o nga ariki, tohunga me nga matatoa kia tu te pure me nga tokotoko. Ko nga moutere o te Aouri me nga moutere o te Aotea nga mea i hui penei, e rua hoki nga amorangi e kia nei ko te Paoa-tea me te Paoa-uri.\nNawai ra ka puta te riri o tetehi o Paoa-uri a ka patua rawatia a Paoa-tea (tangata no Rarotonga) kia mate, ka patua hoki a Paoa-uri. Katahi ra ka rere atu Aotea. Kihai rawa ratou i puta ma Avamo'a, engari ma Avarua ka puta a na tenei ka aukati te ara i Avamo'a, ka aukati ano i te Fa'atau Aroha.\n Te Tangihanga o te Manu Mo'a.\nI te tau 1823 i kohikohi ano ia Teuira Henry tetehi korero mai i etehi tohunga e rua no Bora-Bora nei ko Auna-iti, ko Vai-aui te ingoa, kua tuhia ke ki tona pukapuka 'Ancient Tahiti'  \nE ai ki te tokorua ra\nI Opoa, i te whakaminenga o te 'Hau-pahu-nui'  i miharo tonu te minenga i te takanga mai o tetehi aitua. I te mutunga o nga ritenga o te pa'i-atua ka puta mai he hau awhiowhio (whirlwind) a ka katohia te kauru o tetehi rakau tamanu ko Paruru-mata'i-i-a'ana kia tu kau noa te tumu (trunk). He mea miharo tonu, he rakau taikaha te tamanu nei d.\nMiharo tonu te iwi, nawai ra ka tu mai a Vaita tah'u no Opoa me te ki E homa, eaha ta outou e feruri nei? (feruri = wherori) \nKo te whakautu Te feruri nei matou i te tapa'o o teie ra'au i motu nei, a'ita te ra'au nei i motu mai te po au'iu'i mai (tapa'o = tapako; teia = tenei;  au'iu'i = tau ukiuki), \nkatahi ra ka whakamaoritia e Vaita tona i kite ai  \nTe ite nei au, tei mua i au nei te aura'a o teie nei peu maere rahi! Tena mai te fanau'a 'una'una na te Tumu, e haere mai e hi'o i teie uru ra'au i Taputapuatea nei. E tino 'e to ratou e tino 'e to tatou, ho'e ana'e ra huru, no te Tumu mai, e e riro teie nei fenua ia ratou. \nE mou teie ha'apaoraa tahito nei, e e tae te manu mo'a o te moana, e te fenua nei, e haere mai e ta'ihaa i ta teie ra'au i motu e ha'api'i nei. \nKa aue tonu nga tohunga ki tenei kupu ui atu  ratou kia Vaita no whea tonu te fanau'a 'una'una na te Tumu\nKi ta Vaita Te haere mai nei na ni'a i te ho'e paha ama 'ore (Haramai ratou ma runga waka ama-kore), \n \nTautohe noa nga tohunga o te Hau-pahu-nui i a Vaita, e ai ki te tah'u o Huahine a Tereroa kua porangi ke a Vaita ko nga tahu'a a Opoa a Hua-tere me Fa'aarahia ka tautohe kia huri ona whakaaro nawai ra ka tauwehe nga tangata ra.\nEngari kua tae te rongo ki a Tamatoa ariki, a nana i tono kia Vaita ki haramai ki tona taha whakamaoritia ai; kei reira tonu te iwi e whakarongo ana. \n \nKa riri tonu nga tohunga nei engari ko Fa'aarahia me Tamatoa ariki ka rongo raua ki a Vaita.\nKa wehe takariri nga tohunga me te whakaaro kia taka te utu ki runga i Vaita ki kore e puta tona e korero.\nEngari ia kihai i taro ka puta mai tetehi waka ama-kore ara te waka o te pakeha me te haerenga mai o te Pakeha ki Matavai.\nKi etehi ko te kupu o Vaita he mea mo te haerenga mai o te Paipera tapu. Ana ko te Tumu ko te Atua, ko te (whanaunga)fanau'a 'una'una na te Tumu, te Mihinare me tona reo kunanu kua riro ia ratou te whenua a kua mutu te paopao o nga kawa tahito.  \nKua aukati nga kawa tahito o Taputapuatea tu kau ana nga papa kohatu ko nga manu mo'a o te moana nga mea e tangi ana i runga\n Te Hokinga Mai o Nga Waka.\nMohio katoatia tatou kua mutu katoa nga whakawhithwiti mai o nga waka hourua o te Moananui a Kiwa, e hia noa nga tau penei tae noa ki nga rautai 1800.\nMuri iho i te taenga mai o Pakeha ka timata ano nga tangata o te Moananui a Kiwa ki te whakawhiti atu ki whenua ke, pera kia Paora Tuhaere me ona haerenga ki Rarotonga me era atu.\nEhara maku te korero mo te Whakapehitanga o te Ao Pakeha, me nga huringa o nga tangata ki nga mea hou, a kua wareware ano tatou i nga ahuatanga o nga tupuna, pakaru haere te marae tapu nei a Taputapuatea.  \nI te tau 1929 i haramai a Te Rangihiroa ki Taputapuatea nei, a ka tuhia e ia nga kupu penei\nI had made my pilgrimage to Taputapu-atea, but the dead could not speak to me. It was sad to the verge of tears. I felt a profound regret, a regret for-I knew not what. Was it for the beating of the temple drums or the shouting of the populace as the king was raised on high? Was it for the human sacrifices of olden times? It was for none of these individually but for something at the back of them all, some living spirit and divine courage that existed in ancient times of which Taputapu-atea was a mute symbol. It was something that we Polynesians have lost and cannot find, something that we yearn for and cannot recreate. The background in which that spirit was engendered has changed beyond recovery. The bleak wind of oblivion had swept over Opoa. Foreign weeds grew over the untended courtyard, and stones had fallen from the sacred altar of Taputapu-atea. The gods had long ago departed. (Buck 1938, 81-82)\nKa roa ka penei te ahua ka tangi noa nga manu i runga o Taputapuatea.\nHei ahakoa i te tau 1976 i hoki ano mai a Hokulea o Hawaii ki Raiatea a ka tau atu ratou ki Taputapuatea. Ka whakatau ano ratou ki te marae ra engari ka tu tetehi tangata ko Parau Rahi te ingoa kohetehete noa i a ratou, notemea i uru mai a Hokulea ma Avarua ehara ma Avamoa, te awa tapu    \nKatahi ra ka puta te whakaaro ki te ngakau o etehi kia hoki ano mai nga waka kia hiki te tapu i Avamoa. Ko Pierre Sham Koua o Raiatea tetehi tangata kaha rawa kia tutuki pai i tenei kaupapa\nI te tau 1995 i rau mai nga kahui waka hourua mai i Hawaii, i Aotearoa, i Rarotonga me Tahiti ki Avamoa mo te Faatau aroha i Taputapuatea.\nKo tenei rau waka te whakahokinga mai o nga whakatere waka o te Moananui a Kiwa ki tenei marae tapu, he timatanga ano mo te wahi nei ki tu hei Marae Tapu no te Ao.\nKo Te Aurere o Aoteroa te waka tuatahi kia tomo ano mai ki Avamoa. Ka karakia haeremai te waka nei kia hiki te tapu kua takotoria i te Hara i Awarua, a ma penei ka tu ano te ara tapu i Taputapuatea kia tu ano te Fa'atau Aroha.\n Te Marae Tapu no te Ao.\nKua whakahoutia ano te marae Taputapuatea nei e ona uri ki Opoa. A Kua whakaturia tetehi roopu ko Na Papa e Vau hei kaitiaki mona. Ko tetehi tikanga nui ma ratou kia tohua te Marae Taputapuatea nei hei World Heritage Site i raro i te kawenata o Unesco.\nKoia ra i te 12 Hepetema 2007 i hui ano nga ariki o te Moananui a Kiwa ki Taputapuatea kia korerohia o ratou ake take. I hui mai nga kahui ariki o Tahiti Nui, o Tonga, o Hamoa, o Hawaii, o Rarotonga. Ko Tuheitia te kingi maori, me Te Heuheu ariki o Ngati Tuwharetoa nga mea i ahu mai i Aotearoa nei.\nI te 24 o Mahuru 2007 i hainatia tetehi tatau pounamu (he Natira'a ki to te reo o Tahiti Nui) i waenganui i te Marae Taputapuatea me nga piringa marae o Ngati Tuwharetoa. Ko te hainatanga tuatahi penei kia whakahonore te kaupapa kia tautapa Marae Taputapuatea hei Marae tapu no te Ao katoa.\n": {
        "id": 9,
        "processed": 1,
        "page_id": 12145,
        "text_id": 51383
    },
    "<a href=/w/wiki.phtml?title=Tau&action=edit class='new' title =Tau>Tau</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Tau class='internal' title =Special:Whatlinkshere>8 links</a>)\n<a href=/w/wiki.phtml?title=Rangatira&action=edit class='new' title =Rangatira>Rangatira</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Rangatira class='internal' title =Special:Whatlinkshere>7 links</a>)\n<a href=/w/wiki.phtml?title=Whenua&action=edit class='new' title =Whenua>Whenua</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Whenua class='internal' title =Special:Whatlinkshere>6 links</a>)\n<a href=/w/wiki.phtml?title=Tekau_tau&action=edit class='new' title =Tekau tau>Tekau tau</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Tekau_tau class='internal' title =Special:Whatlinkshere>6 links</a>)\n<a href=/w/wiki.phtml?title=20th_century&action=edit class='new' title =20th century>20th century</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=20th_century class='internal' title =Special:Whatlinkshere>6 links</a>)\n<a href=/w/wiki.phtml?title=Rau_tau&action=edit class='new' title =Rau tau>Rau tau</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Rau_tau class='internal' title =Special:Whatlinkshere>6 links</a>)\n<a href=/w/wiki.phtml?title=Ingoa&action=edit class='new' title =Ingoa>Ingoa</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Ingoa class='internal' title =Special:Whatlinkshere>5 links</a>)\n<a href=/w/wiki.phtml?title=Mate&action=edit class='new' title =Mate>Mate</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Mate class='internal' title =Special:Whatlinkshere>5 links</a>)\n<a href=/w/wiki.phtml?title=Rangatiratanga&action=edit class='new' title =Rangatiratanga>Rangatiratanga</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Rangatiratanga class='internal' title =Special:Whatlinkshere>5 links</a>)\n<a href=/w/wiki.phtml?title=1860s&action=edit class='new' title =1860s>1860s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1860s class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=Moana&action=edit class='new' title =Moana>Moana</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Moana class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=P%C5%8Dneke&action=edit class='new' title =Pōneke>Pōneke</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=P%C5%8Dneke class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=1840s&action=edit class='new' title =1840s>1840s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1840s class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=1868&action=edit class='new' title =1868>1868</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1868 class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=Waikato&action=edit class='new' title =Waikato>Waikato</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Waikato class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=1844&action=edit class='new' title =1844>1844</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1844 class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=1870s&action=edit class='new' title =1870s>1870s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1870s class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=1880s&action=edit class='new' title =1880s>1880s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1880s class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=19th_century&action=edit class='new' title =19th century>19th century</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=19th_century class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=1890s&action=edit class='new' title =1890s>1890s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1890s class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=1800s&action=edit class='new' title =1800s>1800s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1800s class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=18th_century&action=edit class='new' title =18th century>18th century</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=18th_century class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=1810s&action=edit class='new' title =1810s>1810s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1810s class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=1850s&action=edit class='new' title =1850s>1850s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1850s class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=1820s&action=edit class='new' title =1820s>1820s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1820s class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=Kowhai&action=edit class='new' title =Kowhai>Kowhai</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Kowhai class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=1830s&action=edit class='new' title =1830s>1830s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1830s class='internal' title =Special:Whatlinkshere>4 links</a>)\n<a href=/w/wiki.phtml?title=Taonga&action=edit class='new' title =Taonga>Taonga</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Taonga class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=1839&action=edit class='new' title =1839>1839</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1839 class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=K%C4%81inga&action=edit class='new' title =Kāinga>Kāinga</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=K%C4%81inga class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=Kauri&action=edit class='new' title =Kauri>Kauri</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Kauri class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=28_March&action=edit class='new' title =28 March>28 March</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=28_March class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=1843&action=edit class='new' title =1843>1843</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1843 class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=1790s&action=edit class='new' title =1790s>1790s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1790s class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=1845&action=edit class='new' title =1845>1845</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1845 class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=Wh%C4%81nautanga&action=edit class='new' title =Whānautanga>Whānautanga</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Wh%C4%81nautanga class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=Mea&action=edit class='new' title =Mea>Mea</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Mea class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=1850&action=edit class='new' title =1850>1850</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1850 class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=Tainui&action=edit class='new' title =Tainui>Tainui</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Tainui class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=Waka&action=edit class='new' title =Waka>Waka</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Waka class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=Maramataka&action=edit class='new' title =Maramataka>Maramataka</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Maramataka class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=Rotorua&action=edit class='new' title =Rotorua>Rotorua</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Rotorua class='internal' title =Special:Whatlinkshere>3 links</a>)\n<a href=/w/wiki.phtml?title=Wahi&action=edit class='new' title =Wahi>Wahi</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Wahi class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=2007&action=edit class='new' title =2007>2007</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=2007 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Hau&action=edit class='new' title =Hau>Hau</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Hau class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Tauranga&action=edit class='new' title =Tauranga>Tauranga</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Tauranga class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=1980s&action=edit class='new' title =1980s>1980s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1980s class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Mamaku&action=edit class='new' title =Mamaku>Mamaku</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Mamaku class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=1836&action=edit class='new' title =1836>1836</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1836 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Hoki&action=edit class='new' title =Hoki>Hoki</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Hoki class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=2008&action=edit class='new' title =2008>2008</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=2008 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Abd-ul-Mejid&action=edit class='new' title =Abd-ul-Mejid>Abd-ul-Mejid</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Abd-ul-Mejid class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Miro&action=edit class='new' title =Miro>Miro</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Miro class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=1860&action=edit class='new' title =1860>1860</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1860 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Tikanga_p%C4%81ngarau&action=edit class='new' title =Tikanga pāngarau>Tikanga pāngarau</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Tikanga_p%C4%81ngarau class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=1837&action=edit class='new' title =1837>1837</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1837 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=2009&action=edit class='new' title =2009>2009</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=2009 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Ao&action=edit class='new' title =Ao>Ao</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Ao class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Runga&action=edit class='new' title =Runga>Runga</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Runga class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Emperor_of_China&action=edit class='new' title =Emperor of China>Emperor of China</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Emperor_of_China class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Neinei&action=edit class='new' title =Neinei>Neinei</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Neinei class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Moa&action=edit class='new' title =Moa>Moa</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Moa class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Otakou&action=edit class='new' title =Otakou>Otakou</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Otakou class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=1838&action=edit class='new' title =1838>1838</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1838 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Hone_Heke&action=edit class='new' title =Hone Heke>Hone Heke</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Hone_Heke class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Noema_2004&action=edit class='new' title =Noema 2004>Noema 2004</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Noema_2004 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=2010&action=edit class='new' title =2010>2010</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=2010 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Whanau&action=edit class='new' title =Whanau>Whanau</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Whanau class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=English&action=edit class='new' title =English>English</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=English class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Iraq&action=edit class='new' title =Iraq>Iraq</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Iraq class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Pepuere_2004&action=edit class='new' title =Pepuere 2004>Pepuere 2004</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Pepuere_2004 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Totara&action=edit class='new' title =Totara>Totara</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Totara class='internal' title =Special:Whatlinkshere>2 links</a>)\n": {
        "id": 10,
        "processed": 1,
        "page_id": 578,
        "text_id": 5209
    },
    "<a href=/w/wiki.phtml?title=Whakaakoranga&action=edit class='new' title =Whakaakoranga>Whakaakoranga</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Whakaakoranga class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=1861&action=edit class='new' title =1861>1861</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1861 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=1990s&action=edit class='new' title =1990s>1990s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1990s class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Kohimarama&action=edit class='new' title =Kohimarama>Kohimarama</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Kohimarama class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Moana_nui&action=edit class='new' title =Moana nui>Moana nui</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Moana_nui class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=1862&action=edit class='new' title =1862>1862</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1862 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Hurae_2004&action=edit class='new' title =Hurae 2004>Hurae 2004</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Hurae_2004 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Maehe_2004&action=edit class='new' title =Maehe 2004>Maehe 2004</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Maehe_2004 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=2010s&action=edit class='new' title =2010s>2010s</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=2010s class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=R%C4%81&action=edit class='new' title =Rā>Rā</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=R%C4%81 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Qing_Dynasty&action=edit class='new' title =Qing Dynasty>Qing Dynasty</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Qing_Dynasty class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=1841&action=edit class='new' title =1841>1841</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1841 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=T%C4%AB_k%C5%8Duka&action=edit class='new' title =Tī kōuka>Tī kōuka</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=T%C4%AB_k%C5%8Duka class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=K%C4%81tote&action=edit class='new' title =Kātote>Kātote</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=K%C4%81tote class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Whanganui&action=edit class='new' title =Whanganui>Whanganui</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Whanganui class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=1998&action=edit class='new' title =1998>1998</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=1998 class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=Isabella_II_of_Spain&action=edit class='new' title =Isabella II of Spain>Isabella II of Spain</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=Isabella_II_of_Spain class='internal' title =Special:Whatlinkshere>2 links</a>)\n<a href=/w/wiki.phtml?title=%C4%80perira_2004&action=edit class='new' title =Āperira 2004>Āperira 2004</a> (<a href=/w/wiki.phtml?title=Special:Whatlinkshere&target=%C4%80perira_2004 class='internal' title =Special:Whatlinkshere>2 links</a>)\n</ol>\n": {
        "id": 11,
        "processed": 1,
        "page_id": 578,
        "text_id": 5209
    },
    "Tēnā koe! Nau mai, haere mai! Tuhia mai ō whakaaro, ō pātai rānei ki konei. (Please leave any questions or comments here).\nKo tēnei whārangi tō tātou puna wai, tō mātou wharekai rānei, hei wāhi whakawhitiwhiti kōrero i ngā reo e rua mō ngā āhuatanga katoa o tēnei o ō tātou Wikipedia. Ki te hiahia whakaputa whakaaro koe, tēnā, waiho mai ō whakaaro, ō pātai rānei kei raro iho nei, kia mōhio ai mātou kua tae mai koe kia kite i a mātou! Pūranga: 2004 • 2005 • 2006\n Tō Wikiperia 'pepeha'.\nHe paku whakaaro noa iho tōku mō tō Wikiperia pepeha: 'Te mātāpunenga utukore'. \nKi a au nei, kua hē tēnei whakamāoritanga i te mea ko te mea nui o te kōrero 'The Free Encyclopedia' (L'encyclopedie libre', 'Die freie Enzyklopedie', atu rānei) ehara i te utukoretanga, ko te wāteatanga kē, arā, ka taea e a wai te pā atu, ahakoa ki hea, ahakoa āhea, ahakoa whairawa kore rānei atu rānei, arā, kua wātea mō te katoa. Nō reira mēna ka whakaae ngā kaiwhakahaere o ēnei whārangi reo māori, me huri pea te pepeha hei: 'te mātāpunenga wātea'. Kia ora, Hāpara 14 Poututerangi 2009\nPānui: Robin Patterson.\n:Kia mōhio te hapori, nā Meta i whakakore ngā tūranga kaiwhakahaere o User:Robin Patterson i tēnei rā, i te 31 o ngā rā o Haratua, 2007. Kahuroa 06:24, 31 Haratua 2007 (UTC)\n:(Notice: following a vote by the community, the bureaucrat and sysop access rights of User:Robin Patterson were removed today, 31 May 2007). Kahuroa 06:24, 31 Haratua 2007 (UTC)\nPānui: Kaupapa hou: mō ngā ingoa mātāwhenua reorua.\nKa whakatūria e ahau tētahi kaupapa hou kia kōrerotia e te hapori, hei whakapūmau ki ngā tikanga o tēnei Wikipedia Māori. Ko te kaupapa: I roto i te pouaka whakamōhiotanga o tētahi tuhipānui mātāwhenua mō Aotearoa, pērā i ngā tuhipānui mō ngā tāone, ka tuhia tuatahitia te ingoa Māori, ā, i raro iho, ka puta ko te ingoa reo Pākehā, pēnei:\n:Ingoa reo Māori \n:Ingoa reo Pākehā \narā:\n:Te Whanga-nui-a-Tara \n:Wellington \nKo te take, he reo tūturu o Aotearoa te reo Pākehā; ā, kua whakaaetia e te hapori Aotearoa o te Wikipedia reo Pākehā i :en:Wikipedia:New Zealand Wikipedians' notice board kia puta pēnei ai aua ingoa i ngā tuhipānui mō ngā wāhi o Aotearoa:\n:English Name \n:Māori Name (Māori) \nHe aha ō koutou whakaaro? Tēnā, whakamahia tētahi o ēnei tauira:  (support),  (oppose),  (neutral).\n: E pai ana ahua ki tēnei kaupapa.  Kahuroa 08:24, 5 Pipiri 2007 (UTC)\n: I support. I am working on a infobox over on en. If mi wishes to adapt this box for here, feel free (my draft includes a English/Māori name field).  Heoi anō; nā Brian  (talk) 08:52, 5 Pipiri 2007 (UTC)\nKia ora Brian, he whakaaro rangatira tēnā. Kahuroa 09:36, 5 Pipiri 2007 (UTC)\n: --ThT 08:56, 5 Pipiri 2007 (UTC)\n: --Wolfgang K 03:32, 6 Pipiri 2007 (UTC)\n:E  ana ahau mena he peenei te whakatakoto:\n:Te Whanga-nui-a-Tara \n:Wellington \n:Kaahore ahau e pai kia puta nga hoto e paa ana ki te reo. Matapihi 19:19, 8 Pipiri 2007 (UTC)\nKia ora rā e hoa, āe rā, pēnā tonu te whakaaro. Kahuroa 11:29, 9 Pipiri 2007 (UTC)\n.\nKua āraia (blocked) - he karetao whakawai (sockpuppet) o Jose77 aka BrianT77 aka Jason aka Joseph aka David.\nThe following have been redirected to old versions because Jose77 edited the pages in question to hide his activities:\nSection 'Stub request' of hi:सदस्य वार्ता:Hpnadig\nKahuroa 00:23, 12 Pipiri 2007 (UTC) Kahuroa 19:34, 10 Pipiri 2007 (UTC)\n:This is not spam. The correct terminology is to be used is Canvassing. The reason why I removed my messages was because those users rejected or ignored my request; hence the proper action to take next would be to remove the content from their talk page (In other words, to Clean up the mess be removing the cross-posting after it is over). --Jose77 00:24, 12 Pipiri 2007 (UTC)\n Wikimedia Election Notice.\nIf you are able, please translate this notice to as many possible languages and post it anywhere applicable.\nThe Wikimedia Election Committee is accepting candidates for the 2007 Wikimedia Foundation Board of Trustees election.  Please see  for more information.\nThere is still time for a new candidate to be considered for election, and you may now endorse the candidate of your choice (up to 3 candidates) on the endorsements page, .  Please read the instructions carefully prior to endorsing.  If you can translate the instructions, please do.\nIf you have any questions, please contact any member of the election committee, who are listed here .\nPosted on behalf of the Election Committee, \nHe tono whakamāori tuhipānui.\nNā tētahi kaimahi nō Ūropi e hiahiatia ai, kia whakamāoritia ēnei o ngā tuhipānui o te Wikipedia reo Pākehā: :en:Prague, :en:Czech Republic. Engari kāhore anō pea he ingoa Māori o ēnei wāhi: me waiho pea kia puta ai te papakupu reo Māori hou a te Taura Whiri. Kahuroa 21:28, 6 Hōngongoi 2007 (UTC)\nPreparation of Fundraiser 2007.\nHi, this is just a first introduction message to tell you: there is more to come. I am dealing with the Project Management of the Fundraiser 2007 and therefore will search for contacts of wikimedians who can help us to do our tasks on all projects. I am actually also building the structure for the fundraiser on Meta. We will need people who help to design buttons, translate texts of buttons, documents, sitenotices etc. Should you feel you want to co-operate please let me know. You can reach me on my meta user page or by e-mail at scretella (at) wikimedia (dot) org. If you wish to notify us that you would like to co-operate on translations, it would be nice if you used e-mail and copied the e-mail to me and Aphaia (aphaia (at) gmail (dot) com). Thank you for your attention and I hope to meet you soon! Cheers :-) -- 4 September 2007 Sabine\n Please post this to your village pump.\nBetawiki: better support for your language in MediaWiki.\nDear community. I am writing to you to promote a special wiki called Betawiki. This wiki facilitates the localisation (l10n) of the MediaWiki interface. You may have changed many messages here to use your language in the interface, but if you would log in to for example the Japanese language Wiktionary, you would not be able to use the interface as well translated as here. In fact, of over 1,700 messages in the core of MediaWiki, 70 messages have been translated. Betawiki also supports the translation of messages for well over 100 extensions, with over 1,550 messages. Translators for over 70 languages contribute their work to MediaWiki this way every month.\nIf you wish to contribute to better support of your language in MediaWiki, as well as for many MediaWiki extensions, please visit Betawiki, create an account and request translator privileges. You can see the current status of localisation of your language on MediaWiki.org and do not forget to get in touch with others that may already be working on your language on Betawiki.\nIf you have any further questions, please let me know on my talk page on Betawiki. We will try and assist you as much as possible, for example by importing all messages from a local wiki for you to start with, if you so desire.\nYou can also find us on the Freenode IRC network in the channel #mediawiki-i18n where we would be happy to help you get started.\nThank you very much for your attention and I do hope to see some of you on Betawiki soon! Cheers! Siebrand@Betawiki 17:51, 13 Hakihea 2007 (UTC)\nCurrently 3.94% of the MediaWiki messages and 0.00% of the messages used by the extensions used in the WMF have been localised. Please help us help your language and localise at betawiki. This will localise Commons among other projects. GerardM 13:00, 8 Poutū-te-rangi 2008 (UTC)\n Currently 3.73% of the MediaWiki messages and 0.00% of the messages of the extensions used by the Wikimedia Foundation projects have been localised. Please help us help your language by localising at Betawiki. This is the recent localisation activity for your language. NB there is a bounty available at this time.. check Betawiki for details.. We can and will import your Wikipedia messages on request... Thanks, GerardM 08:29, 26 Āperira 2008 (UTC)\n Currently 3.68% of the MediaWiki messages and 0.00% of the messages of the extensions used by the Wikimedia Foundation projects have been localised. Please help us help your language by localising at Betawiki. This is the recent localisation activity for your language. Thanks, GerardM 08:39, 27 Mei 2008 (UTC)\n Currently 3.64% of the MediaWiki messages and 0.00% of the messages of the extensions used by the Wikimedia Foundation projects have been localised. Please help us help your language by localising at Betawiki. This is the recent localisation activity for your language. Thanks, GerardM 06:43, 7 Hūrae 2008 (UTC)\n Currently 3.76% of the MediaWiki messages and 0.15% of the messages of the extensions used by the Wikimedia Foundation projects have been localised. Please help us help your language by localising at Betawiki. This is the recent localisation activity for your language. Thanks, GerardM 14:10, 6 Ākuhata 2008 (UTC)\n Currently 3.59% of the MediaWiki messages and 0.13% of the messages of the extensions used by the Wikimedia Foundation projects have been localised. Please help us help your language by localising at Betawiki. This is the recent localisation activity for your language. Thanks, GerardM 12:47, 9 Hepetema 2008 (UTC)\n Currently 3.43% of the MediaWiki messages and 0.13% of the messages of the extensions used by the Wikimedia Foundation projects have been localised. Please help us help your language by localising at Betawiki. This is the recent localisation activity for your language. Thanks, GerardM 08:20, 14 Oketopa 2008 (UTC)\n Currently 3.44% of the MediaWiki messages and 0.10% of the messages of the extensions used by the Wikimedia Foundation projects have been localised. Please help us help your language by localising at Betawiki. This is the recent localisation activity for your language. Thanks, GerardM 12:14, 10 Noema 2008 (UTC)\n Currently 3.38% of the MediaWiki messages and 0.09% of the messages of the extensions used by the Wikimedia Foundation projects have been localised. Please help us help your language by localising and proof reading at Betawiki. This is the recent localisation activity for your language. Thanks, GerardM 10:05, 14 December 2008 (UTC)* Currently 3.36% of the MediaWiki messages and 0.09% of the messages of the extensions used by the Wikimedia Foundation projects have been localised. Please help us help your language by localising and proof reading at Betawiki. This is the recent localisation activity for your language. Thanks, GerardM 14:18, 10 Hānuere 2009 (UTC)\n:PS Please help us complete the most wanted messages..\nHi.\nHi i am a maori student and my maori is a little rusty. I would just like to ask for two things. one Is there a maori version of the wikipedia logo, and two is there a place to get articles translated, such as which was requeted to maori translation on en.wikipedia.Blacksmith 07:55, 15 Mahuru 2007 (UTC)\nKia ora Blacksmith. Yes, there is a Māori version of the Wikipedia logo. We are waiting for it to be loaded, but these things take time to happen - a long time apparently, Wikipedia is just a volunteer thing, and changing logos seems to be hard to get done. Regarding the translation of 'Scouting New Zealand', no, we don't have a translation service, all we can do is ask on this page, which you have done. I didn't know that a request had been made on en.Wikipedia for that article to be translated - I thought they had asked about getting the words Scouting New Zealand translated - again, it is no good getting just anyone to translate something like that, Scouting New Zealand needs to get an official translation done by experts (it is strange that they have never done that). The Māori Language Commission are the people to ask for such a thing if that is what you are meaning. Email for the MLC is here, use the general email address for inquiries. Kahuroa 10:37, 15 Mahuru 2007 (UTC)\nTiwho.\nKia ora, I apologize for writing in English, but I don't speak Māori...\nI am looking for any information on the maori firstname tiwho. Does tiwho mean something? What would the translation be? Can you tell me anything on the origin of this firstname?\nThank you in advance for your answers, and best regards from your antipodes!\nYours, Hervé.\n:En complément, et en m'excusant à mon tour d'utiliser d'une autre langue, une personne a posé une question sur le sens du nom « tiwho » sur cette page de Wikipedia-FR. Si quelqu'un pouvait y répondre. Merci d'avance. Olivier Hammam - Whiringa-ā-nuku 15, 2007 - 18:57\nPido tambien disculpas por hablar castellano, pero ¿puede alguien decirme que diablos significa el nombre tiwho? Muchas gracias por adelante. Hervé.\nTiwho - ce n'est pas un nom Māori. The combination of letters wh+o is impossible in Māori. That site is wrong. Regards Kahuroa 11:25, 16 Whiringa-ā-nuku 2007 (UTC)\nTēnā Koe Hervé,\nThere is only one instance that i am aware of where who (pronounced similar to four in eng) is used. The word Whoatu (hoatu to most other reo) is used by some of us of Maniapoto and also those of Hikairo (formally part of Maniapoto), other than that i don't believe who is ever used. I do know of one of my tūpuna, uncle , and also a family named Tiwha(all from Maniapoto). This could have been the proper name? There are many meanings for the word but i think in this instance it means dark and gloomy, which is almost always associated with feelings (i.e., sad, morbid). check ngata dictionary for other meanings. Mauri ora Tāwhana 23:22, 6 Whiringa-ā-rangi 2007 (UTC)\n Bot command translations.\nHi. Could anybody translate me these interwiki bot commands to Maori (they will be displayed in all interwiki bot summaries instead English)?\nThank you. :lt:User:Hugo.arg 08:50, 16 Hui-tanguru 2008 (UTC)\n Article or articles translation requests.\nKahuroa, Node ue, Tāwhana, A Whauwhau, Hjr, Maori rahi, Matapihi and Tarzipan may want to translate an article or articles if so please translate Dog, Cat and Horse, they are good articles to translate into Māori, thanks. ---96.229.184.69 20:00, 26 Hui-tanguru 2008 (UTC)\nBot policy.\nHello. There is no active bureaucrat on this wiki since several months. So as to facilitate steward granting of bot access, I'd like to suggest implementing the standard bot policy on this wiki. This involves creating a redirect to the page :Wikipedia:Karetao from :Wikipedia:Bot policy (which is already in place since long), and adding a line at :Wikipedia:Karetao noting that standard bot policy is used here. In particular, this policy allows automatic acceptance of known interlanguage linking bots, which form the vast majority of such requests. \nPlease read the text at m:Bot policy before commenting. If you object, please say so; it will be implemented in two weeks if there is no objection, since it is particularly written to streamline bot requests on wikis with little or no community interest in bot access requests, and/or no local bureaucrats handling such requests. Thanky you for listening and for you cooperation. --Purodha Blissenbach 08:05, 14 Poutū-te-rangi 2008 (UTC)\n": {
        "id": 12,
        "processed": 1,
        "page_id": 629,
        "text_id": 81865
    },
    "I object - am back from wikibreak now Kahuroa 21:22, 16 Paenga-whāwhā 2008 (UTC)\nThree translation requests.\nCopied here from my talk page. I am thinking about having a dedicated page for these Kahuroa 03:59, 21 Hūrae 2008 (UTC)\nA little help: Ecser.\nHaere mai! Hi! I'm a Hungarian Wikipedia editor, my name is Norbert Kiss. I'm very proud of my village and I would like to read about it in a lot of langauges. I translated already it into 10 languages, but I can't speak Maori. Could you help me. My village's English page is this: Ecser. Could you translate the page of Ecser into Maori? Then just link the side into the English version and I will see it, or you could write me, when it is ready. My hungarian Wikipedia side is: My profile. Or my e-mail is: eino@freemail.hu\nThank you!\nNorbert\n Help.\nHi! How are you? I need your help. Could you translate this article to Maori, please. It's about a temple on Kirikiriroa (Hamilton) . \n: If you want to translate any article onto Spanish, Aragonese, Catalonian, Aranese (Occitanian) or Gallician, tell it to me, please.\nI'll try to do more articles, but this month I'm very occupied. --Tikanga 10:50, 31 Mei 2008 (UTC)\n To translate onto Maori.\nThis is the person who translate the Bible onto Maorí, could you translate this page, please? --Tikanga 21:19, 20 Hūrae 2008 (UTC)\nManual for new and small Wikipedias.\nHello, at Meta there are pages created to help new and small Wikipedias: Manual and Wikipedia and help pages. You are welcome to have a look and comment. Kind regards--Ziko 22:51, 13 Ākuhata 2008 (UTC)\nTell us about your Wikipedia.\nPlease Tell us about your Wikipedia language edition, answering some questions, and learn about others.--Ziko 17:53, 28 Ākuhata 2008 (UTC)\n A request from Russia.\nHello,\nmy name is Dmitry, I am from Russia. I like the history of New Zealand. I created in Russian articles about several prominent Maori people, such as Meri Te Tai Mangakāhia, Kiri Te Kanawa, Wiremu Tāmihana, Timi Kara and will probably create some more. Can I ask you to create at least very short articles about :en:Russia, :en:Moscow and :en:Saint Petersburg in the Maori Wikipedia? Regards, --Dmitri Lytov 13:34, 10 Oketopa 2008 (UTC)\n:Hi, I'm Eugen from Ukraine. I've created the article about Russia (Rūhia) (and also Ukraine - Ūkareinga). There is a small amount of information, so if anybody can add something, it would be wonderful. Oh, and synopsis and orthography may be wrong too. //// Can anyone translate into maori the name Dmitry (for president of Russia) and the word federal? I've founded word republic - whenua, but Russia is federal republic.\n The most often used MediaWiki messages.\nHoi, the most often used MediaWiki messages (less than 25% of all MediaWiki messages) are the most visible messages. They help our readers and editors the most. We are aiming to get these messages localised for as many languages as possible by the end of the year. Please help us and yourself and localise these messages. Thanks, GerardM 13:50, 19 Noema 2008 (UTC)\nEcser.\nI'm a Hungarian Wiki-editor, my name is Norbert Kiss (User:Eino81). I'm very proud of my village, which is called Ecser, and we have already more than 70 translations about my village in the Wikipedias. Because of I'm a linguist and one day I would like to go to Aotearoa and live there for a while, the Maori language is very important to. I would like to see the article of my village in Maori. Could you help me? could you translate it to your mother tongue? I also can tranalte you any article, what you want. You can use the English version of that (http://en.wikipedia.org/wiki/Ecser). Request transferred here by Kahuroa 05:51, 25 Noema 2008 (UTC)\n A list of note, or a translation request.\nI just wanted to note the meta:List of articles every Wikipedia should have, or the simple:Wikipedia:List of articles all languages should have, which it is good idea to translate all of its articles eventually, Ngata Dictionary is a website to help translate words in the above lists into Maōri. --173.51.115.6 03:39, 20 Hānuere 2009 (UTC)\nPoi.\nKia ora,\nJust to let you know that the New Zealand collaboration on the English Wikipedia for May 2008 is poi. We could use good references on traditional Māori poi as most of the article is currently about the modern adaptation as a circus skill. I also hope that someone will translate the finished result, as this wikipedia doesn't have an article poi at present. Dramatic 03:30, 2 Mei 2009 (UTC)\nWikimania Scholarships.\nThe call for applications for Wikimania Scholarships to attend Wikimania 2010 in Gdansk, Poland (July 9-11) is now open. The Wikimedia Foundation offers Scholarships to pay for selected individuals' round trip travel, accommodations, and registration at the conference.\nTo apply, visit the Wikimania 2010 scholarships information page, click the secure link available there, and fill out the form to apply.\nFor additional information, please visit the Scholarships information and FAQ pages:\nYours very truly,\nCary Bass\nVolunteer Coordinator\nWikimedia Foundation\n": {
        "id": 13,
        "processed": 1,
        "page_id": 629,
        "text_id": 81865
    },
    "Ka whakarārangitia i konei ngā kaiwhakahaere o te Wikipedia Māori. He whārangi anō tēnei hei tono kia whakatūria he kaiwhakahaere hou, kia whakakorea hoki te tūranga kaiwhakahaere o tētahi tangata.\n Ko ngā kaiwhakahaere.\n O nāianei (active administrators).\nKo ēnei ngā kaiwhakahaere e mahi tonu ana ki te paetukutuku nei (These are the active administrators of this site):\n Kaiāwhina (other administrators).\n Ngā kaiwhakahaere tautauā (inactive administrators).\nKei tēnei rārangi aunoa ngā kaiwhakahaere katoa e rārangatia ana. Engari, kia tūpato. Ko ētahi, kāhore he mahi o ngā tāngata nei mō te wā roa. Kāhore kau ngā mahi a ētahi i runga i ngā tau e rua kua hipa ake nei (This list shows all the users with administrator rights. However, most have made no edits for long periods - that is, they are inactive.)\n Ngā kaiwhakahaere o mua (former administrators).\n User:Robin Patterson: nō te 31 o ngā rā o Haratua, 2007, i whakakorengia ōna tūranga hei kaiwhakahaere, hei kaiwhakahaere matua. (Robin Patterson, formerly a sysop and bureaucrat, was desysopped on May 31, 2007.)\n Ā ngā kaiwhakahaere mahi.\nMā ngā kaiwhakahaere e whakarerekē ngā whārangi o te wāhi MediaWiki arā ngā pānui pūnaha. Mā rātou e ārai ngā kaimahi e mahi nanakia ana ki te paetukutuku nei, mā rātou ngā whārangi e muku, e pare i runga i te kaupapa.\n Ngā tohu o te kaiwhakahaere.\n Ngā tono whakakore tūranga kaiwhakahaere.\nMā ngā tuari e whakakore ngā tūranga o ngā kaiwhakahaere i runga i te tautoko hapori. \n Hei mahi mā ngā kaiwhakahaere.\nTirohia Wikipedia:Whakatūpato mā ngā kaiwhakahaere. Tuhia ō tono katoa ki taua whārangi.\n Tirohia hoki.\n": {
        "id": 14,
        "processed": 1,
        "page_id": 664,
        "text_id": 82021
    },
    "af - Afrikaans.\n als - Alemannisch (Alemannic).\n an - Aragonés (Aragonese).\n ang - Englisc (Old English/Anglo-Saxon).\n ar - العربية (Arabic).\n \n arc - (Aramaic).\nSee also bya.\n ast - Asturianu (Asturian).\n be - Беларуская (Belarusian).\n bg - Български (Bulgarian).\n bn - বাংলা / Bānglā (Bengali).\n br - Brezhoneg (Breton).\n bs - Bosanski (Bosnian).\n bya - ארמית (Babylonian Talmudic Aramaic (Jewish Middle Babylonian Aramaic)).\n ca - Català (Catalan).\n chr - ᏣᎳᎩ (Cherokee)(Tsalagi).\n cs - Český (Czech).\n csb - Kaszëbsczi (Kashubian).\n cy - Cymraeg (Welsh).\n da - Dansk (Danish).\n de - Deutsch (German).\n el - Ελληνικά (Greek).\n en - English.\n eo - Esperanto.\n es - Español (Spanish).\n et - Eesti (Estonian).\n eu - Euskara (Basque).\n fa - فارسی (Persian).\n fi - Suomi (Finnish).\n fo - Føroyskt (Faroese).\n fr - Français (French).\n fy - Frysk (Frisian).\n ga - Gaeilge (Irish).\n gd - Gàidhlig (Scots Gaelic).\n gl - Galego (Galician).\n he - עברית (Hebrew).\n hi - हिन्दी (Hindi).\n hr - Hrvatski (Croatian).\n hu - Magyar (Hungarian).\n hy - Հայերեն / Hayeren (Armenian).\n ia - Interlingua.\n id - Bahasa Indonesia (Indonesian).\n ie - Interlingue.\n io - Ido.\n is - Íslenska (Icelandic).\n it - Italiano (Italian).\n iw - עברית (Hebrew).\nSee he.\n ja - 日本語 (Japanese).\n jv - Basa Jawa/Basa Jawi (Javanese).\n ka - ქართული / Kartuli (Georgian).\n kn - ಕನ್ನಡ (Kannada).\n ko - 한국어 (Korean).\n ks - कश्मीरी / كشميري (Kashmiri).\n ku - Kurdî / كوردی (Kurdish).\n kw - Kernewek (Cornish).\n la - Latina (Latin).\n lb - Lëtzebuergesch (Luxembourgish).\n li - Lèmburgs (Limburgish).\n lt - Lietuvių (Lithuanian).\n lv - Latviešu (Latvian).\n mi - Māori.\n mk - Македонски (Macedonian).\n ml - മലയാളം (Malayalam).\n mr - मराठी (Marathi).\n ms - Bahasa Melayu (Malay).\n nds - Plattdüütsch.\n nl - Nederlands (Dutch).\n nn - Nynorsk.\n no - Norsk (Norwegian).\n oc - Langue d'Oc (Occitan).\n os - Ирон æвзаг (Ossetian).\n pa - ਪੰਜਾਬੀ (Punjabi).\n pl - Polski (Polish).\n pt - Português (Portuguese).\n qu - Runa Simi (Quechua).\n ro - Română (Romanian).\n ru - Русский (Russian).\n sa - संस्कृतम् (Sanskrit).\n scn - Sicilianu (Sicilian).\n se - Sámegiella (Northern Sami).\n sk - Slovenčina (Slovak).\n sl - Slovenščina (Slovene).\n sq - Shqip (Albanian).\n sr - Српски (Serbian).\n su - Basa Sunda (Sundanese).\n sv - Svenska (Swedish).\n ta - தமிழ் (Tamil).\n te - తెలుగు (Telugu).\n th - ไทย (Thai).\n tl - Tagalog.\n tlh - tlhIngan Hol (Klingon).\n tokipona - toki pona (Tokipona).\n tr - Türkçe (Turkish).\n tt - Tatarça (Tatar).\n uk - Українська (Ukrainian).\n ur - اردو (Urdu).\n vi - Tiếng Việt (Vietnamese).\n wa - Walon (Walloon).\n yi -  (Yiddish).\n zh - 中文 (Chinese).\n zh-min-nan - Bân-lâm-gú (Min Nan).\n": {
        "id": 15,
        "processed": 1,
        "page_id": 1645,
        "text_id": 82147
    },
    "Wikipedia:Kōrero, Pūranga 2004\nMacrons.\nWhat will the Maori Wikipedia's policy on spelling Maori words be? Particularly, how will we represent the long vowel sounds? The title of this page currently uses ö for the long o, which is fairly common on the internet. The Maori Language Commission, by contrast, prefers a macron, giving ō. That's the preferred method in print, it seems. Another possibility (more common in educational circles) is simply to write the vowel twice. \n:that leads to complications with compound words Robin Patterson 02:47, 18 Apr 2004 (UTC)\nAs such, this page could be Körero, Kōrero, or Koorero. I've used the macron, myself, but the umlaut option seems to being used too. We should probably establish which convention we'll be following now, when there are only a few articles - it'll be easier than going back and changing everything later. \nAny thoughts? -- Vardion 07:03, 12 Mar 2004 (UTC)\n:Parliament has occasionally used a double vowel but is now moving towards macrons, though not with 100% consistency. :Robin Patterson 22:50, 31 Mar 2004 (UTC)\n:The reason why the diaeresis (eg: ö)  is more used than the macron (eg: ō) on computers is due to historic reasons: several years ago computers didn't support unicode, and the 8bits encoding commonly used in English operating systems (be it iso-8859-1 or windows-1252) doesn't have any macron letter; the use of the diaeresis was simply the less bad choice possible.\n:However, if the correct usage (in print, when handwriting; what is defined by the language authorities) is to use the a macron, then macrons should be used here (things changed a lot, and while it wasn't possible to use a macron some years ago for most people, nowadays the majority of operating systems fully support unicode (at least for the letters involved here), wikipedia uses unicode encoding internally too, so it isn't a problem either, I think everybody should be able to see them on screen without problem; if the problem is typing, then the list of involved letters could be printed on the samll text displayed near the edit box of a page, so people can just copy and paste them if they haven't figured out how to type them directly on keyboard (Spanish wikipedia for example does that) Srtxg 14 Mar 2004\nMacrons are now the policy.\nAnyone is welcome to change diaeresis/umlauts to macrons, but some Maori websites still use and/or display diaeresis/umlauts (or nothing --see Ngai Tahu's main page, for example) and, despite the optimism noted above, not all displays render macrons properly (eg on mine at home, I can see them in the edit box but in the articles and sidebars every macronned character is just a rectangle), so I see no hurry to change. Use of macrons in all new material is pretty easy now that I have followed up on the Srtxg suggestion. Robin Patterson 23:03, 10 Aug 2004 (UTC)\nPage names with macrons.\nTo minimise irritation caused by edits that contain macronless links intended to target pages with names that have macrons, and vice versa, it is desirable to create the page name with NO MACRONS first, then MOVE it to the fully-macronned version. That leaves the plain version as an automatic Redirect (and a handy target for interwiki links), while the real article will be named in the officially-approved manner. We had a few of these moves in previous months. (If one creates the macronned page first, it's possible but much more fiddly to create a plain one as a Redirect.) \nThe above, now that I have fully worked it out and explained the reasons, will explain some of my recent flurry of creations and moves! (I'll add a bit of this to the Style page.)  Robin Patterson 06:09, 17 Aug 2004 (UTC)\nPurpose of this page.\nI thought that Körero would be like current events.  I used the same word to mean discuss this page.  Please correct me if I have incorrect usage.\nPerl 13:26, 12 Mar 2004 (UTC)\n:I've now (as reported recently) added this page in Maori to the Discuss this page link, so no confusion; Körero seems fine for the name of this page unless we want to keep with the tavern theme! Robin Patterson 02:27, 27 Apr 2004 (UTC)\n Editing.\nTo edit the current events link on the sidebar, edit MediaWiki:Currentevents; and to edit the translation of discuss this page, edit MediaWiki:Talkpage. (For other sidebar items there are MediaWiki:Movethispage , MediaWiki:Randompage, MediaWiki:Whatlinkshere and MediaWiki:Editthispage). Please look over those pages and make sure I have translated them correctly. I have made you [Vardion] an administrator on this wikipedia so that you may edit the protected messages. \nBest wishes, Perl 13:26, 12 Mar 2004 (UTC)\nPakeha promotion of this site.\nTēnā koutou.\nMy Māori consists of a few phrases (which I expect to increase every day I watch Whakaata Māori (Māori Television) and recognition of not much more than 100 words (including most of those used in the Resource Management Act 1991).\nI'm happy to browse here and tinker editorially/structurally where it might help.\n:Robin Patterson 06:46, 31 Mar 2004 (UTC)\nNow distinctly more proficient after 4 months of Maori Television and reading grammar books on the train! Robin Patterson 23:03, 10 Aug 2004 (UTC)\n<strike>Do we have a Māori equivalent of:\n that says something meaningful?</strike>\n:Robin Patterson 06:46, 31 Mar 2004 (UTC)\n - We do now; I worked THAT one out all by myself Robin Patterson 12:33, 20 Apr 2004 (UTC)\n and, of course, you no longer need the msg: part; so just stub inside those curly brackets will produce the Māori and English message with lines above and below. Robin Patterson 20:13, 29 Jun 2004 (UTC)\n----\nNoticing the dearth of contributors, I wonder whether any registered contributors would see anything wrong with the idea of contacting iwi and other groups through their websites, telling them about the Māori Wikipedia, and encouraging them to suggest to their members and associates that contributing would be a good way of promoting te reo Māori. :Robin Patterson 00:36, 7 Apr 2004 (UTC)\n:I think that would be a great idea. I was vaguely considering something along those lines, but I wouldn't have any idea how to do it. Even if we just get a brief mention in a newsletter or something, it may attract a few more contributors. (My own understanding of Māori is highly limited, although I hope to improve it over time). Anyway, welcome aboard. -- Vardion 01:35, 7 Apr 2004 (UTC)\n Tena koutou.\n I'm one of your pakeha fans since enjoying 3 hours on your opening day and an average of an hour a day since.\n I've profiled a couple of your pages in suitable categories on the Web directory  www.zeal.com , where I have some influence. One of the recent additions is probably visible here: http://www.zeal.com/category/preview.jhtml?cid=10144994\n There is also mention on www.wikipedia.com - eg here: http://en.wikipedia.org/wiki/List_of_New_Zealand_television_channels - but little or none on the Maori Wikipedia: maybe some of your people could help promote te reo by contributing there: http://mi.wikipedia.org/wiki/Te_reo_maori\n If your web experts decide to change any URLs, a note to me would ensure that the Zeal and Wikipedia references are updated rather than being lost or deleted.\n E noho ra.\n Robin Patterson\n:Robin Patterson 23:00, 12 Apr 2004 (UTC)\nI've now told the Maori Language Commission about us, got an entry on the Community Panui, and asked Pipers to add the WP to their list of New Zealand language and education websites. Robin Patterson 20:13, 29 Jun 2004 (UTC)\nMachinery and software issues.\n:http://mi.wikipedia.org/wiki/Special:Statistics\n:Robin Patterson 01:35, 16 Apr 2004 (UTC)</strike>\nPage views are no longer recorded for performance reasons. A sysop will need to edit MediaWiki:Sitestatstext to remove the reference to page views. You may want to translate the English version which no longer mentions this. Angela 19:39, 16 Apr 2004 (UTC)\n: Thanks, Angela - Robin  (I fixed it just after Anzac Day)\n:  http://meta.wikipedia.org/wiki/How_to_start_a_new_wikipedia\n:http://en.wikipedia.org/wiki/Wikipedia:Naming_conventions\n----\nI've asked someone how we get a line of tohutō (macronned characters) below the edit box in the same way as other languages do (as our Belgian friend Srtxg suggested above); no reply in last 24 hours; it must be possible, even if it needs a developer to be dragged in for a few minutes. -  Robin Patterson 10:02, 26 Apr 2004 (UTC)\n:To add macronned characters below the edit box, edit MediaWiki:Copyrightwarning. See :de:MediaWiki:Copyrightwarning for an example. Angela 20:42, 26 Apr 2004 (UTC)\nAngela, you are worth your weight in gold. I've attended to that, thank you. I added the stub message code to the box of characters, to save even more time - someone may now tell me what Māori wording would be best in the actual stub message!  Robin Patterson 02:27, 27 Apr 2004 (UTC)\nIMAGES - how do we copy images from other Wikipedias into this one? (I really have tried to find out, by studying at least a dozen pages about images!) Robin Patterson 02:27, 27 Apr 2004 (UTC)\n:A frequently asked question (it should be added to a FAQ somewhere really). It is not currently possible to move images between Wikipedias. You have to download the image to your own computer (often right clicking on it will give you this option), and then re-upload that to the Wikipedia you want the image to be copied to. It's best to copy images that have some sort of source mentioned, or that state that are released under the GFDL, or are public domain. Add interlanguage links between the two so that if one is found to be a copyright violation, the other one can be deleted as well. There are plans for the future for all images to be on one site to save having to upload them separately to each Wikipedia. Angela 02:14, 28 Apr 2004 (UTC)\n Thank you, Angela. I've copied that to a reasonably suitable place here for wider dissemination. - Robin\nProgress.\nKia ora koutou! Progress and thoughts following Anzac Day 2004 (and please feel free to add indented comments (ie starting with a colon) to any of these paragraphs!):\nYou'll have noticed that I haven't lost interest in this project. Annoyed with myself for not finishing that Administrators list - I seem to have been distracted then deleted that window after carelessly leaving it with quite a lot more composed and previewed. <strike>If I don't finish it soon, maybe someone else will - it needs only three more sysops to be named and should have Brion listed among the others.</strike>\nPlanning to create numerous lists (rārangi) pages, including a list of lists (!) and things like colours - (rārangi kano) - and months - (rārangi marama) (I hope those are right - see below) so as to make the contribution of one or two words at a time easy for those of us who speak hardly any Māori and can read only a little more. Some of them will be tables, with Māori words listed in alpha order and English equivalents opposite.\nI think we need a separate page for agreed styles (preferably with a proper Māori name - any offers?). Maybe it could start with a link to the English style page and say we follow that except for the following specific points, either of difference or where the English one has no equivalent (eg macrons).\nAnother small machinery matter is how we deal with having variants of words, eg Maori and Māori and maori. Obviously [?] our article would be under the preferred heading, with redirects from the other[s] so that the less skilled writers can link their variant even if they don't pick the preferred one - but those of you with experience in other Wikipedias may be able to steer me in a better direction there! The problem would arise whenever we got an expert opinion saying one of our page titles wasn't good Māori; but I guess moving or renaming is the way to do that; I hope we get some expert speakers soon, so as not to have to change too much.\nIt would be neat if anyone reading this page could add a Hello or Kia ora line at the bottom just to give us some idea whether anyone's reading it all!\nThat's all I can think of for now. If replying to any of these paras, please feel free to move them up or down to old or new headings as appropriate, for easier following of the sense and thread. Kind regards -  Robin Patterson 10:02, 26 Apr 2004 (UTC)\n Milestone - more than 50 articles, so when you click on Long pages you no longer see the shortest page! (Now can someone else add a few dozen names of NZ Governors to Rārangi Kāwana?) - Robin Patterson 22:30, 25 May 2004 (UTC)\nRelevant articles in the English Wikipedia.\nJust thought I should include a link to User:A Pakeha's contribution Wikipedia:Wikipedia English Language articles about Maori subjects so's we don't forget what a valuable resource it is.  - Robin, 27 April.\nUsage of English.\nWhy is it we use English so much here? Not in Korero, where it is understandable (for the moment), but in individual pages? If somebody speaks Maori, they'll be able to read and understand a request for them to help with mi:, otherwise they're probably at the wrong place and can click on English in the list of other languages. No MediaWiki messages should have any English, nor should the main page. The only places where English should be permitted is userpages, talkpages, and (possibly) text explaining external links. :en:List of Animals, if it exists (I'm not sure it does), doesn't give Maori translations. The fact that the Maori equivalent gives English translations for each word implies to me that the author of the page is of the POV that the English names for these animals are somehow relevant, which they aren't.\nIn addition, what's all this about being PURPOSEFULLY Aotearoa-centric? (I'm referring to the stuff about primarily about... in articles explaining Wikipedia) It's understandable to have a concentration of articles about New Zealand and especially about Maori-related topics (that's the case with most Wikipedias), but we should strive to be international and nothing-centric (except perhaps Earth-centric). en: obviously has a concentration of articles about American and Commonwealth-related topics, as does fr: with articles about France and Francophonie in general, but both strive to lower that concentration by increasing their repertoire of articles about other cultures and nations. To condone and even support such a concentration is against the spirit of Wikipedia. As is the case with all Wikipedias, it is the hope of all Wikipedians that all the articles in any given Wikipedia that only occur in that Wikipedia be translated so they can be included in all other Wikipedias. If that were to happen for all such articles right now, most Wikipedias would be fairly nothing-centric, though of course there would be slight bias towards first English, then German, French, Japanese.\n--24.251.242.236 04:11, 10 Aug 2004 (UTC)\n:Kia ora, e manuhiri. I look forward to seeing your first 70 articles (preferably in fluent or even passable Maori, so as to be better than my first 70), and I'm happy to see you cover the whole world. I recommend that you start by attacking most of the red links on Hau Kāinga. Then you and your friends can work on your idea (which I agree with) that it is the hope of all Wikipedians that all the articles in any given Wikipedia that only occur in that Wikipedia be translated so they can be included in all other Wikipedias - translating 300,000 articles from en into mi. Kia kaha, e hoa! Robin Patterson 06:25, 10 Aug 2004 (UTC)\n": {
        "id": 16,
        "processed": 1,
        "page_id": 3821,
        "text_id": 21570
    },
    "Your condescention is noted and ignored. If you agree with that idea, which is actually central to Wikipedia policy and goals, then why does Wikipedia:Community Portal say that mi: is intended to have a concentration of local topics?\nIt says that because I'm trying to encourage Maori speakers to realise that they are most welcome to write about something familiar. I'll remove it when it's done that. Robin Patterson 20:37, 10 Aug 2004 (UTC)\nThe point of Wikipedia is generally accepted to be quality rather than quantity, though in some cases people get carried away (take for example all the US placenames with only rudimentary census information which was added by bot). Thus, rather than working towards 70 articles which you yourself claim to be in poor Maori (and stubs, at that), \nperhaps you could find a Maori friend and have them help you translate or write one whole quality article from scratch?\nI don't have Maori friends who are interested yet; I have approached Maori Television and the Maori Language Commission and a community newsletter and a couple of tribal websites, with more of that planned; one day it may inspire someone to become active. Robin Patterson 20:37, 10 Aug 2004 (UTC)\nThis is generally how successful new Wikipedias start, and if people don't do it that way, when fluent speakers do come they're often discouraged by the mess that's already been created by non-fluent speakers.\nIf you want to practice Maori, maybe you can do that on Korero, but generally Wikipedia policy frowns on editing just to practice your language skills rather than to actually contribute coherent content (though en:, de:, and fr: are now generally accepting of crappy English/German/French because of the wealth of native speakers who will fix it on sight). \nNon-fluents have started Wikipedias and made Main Pages, but to get very far beyond that with any degree of success has thus far required a native speaker. (for example a non-fluent started sc:, and recruited the first native speaker for fo:; obviously they tried their best for the mainpage at sc: and did extremely minimal interface translation; Merovingian did the same for mg: and I believe quite a few other Wikipedias have been started that way)\nIn addition, you didn't respond to many of my questions. Also, since you're the sysop, why don't you fix all the interface messages which use diereses (or is it dieresises?) instead of macrons?\nI don't have much spare time; some of your questions were interesting but I didn't have a good answer; I have at present better things to do than fix any diaeresis[?!} - they work AND are still used on many full Maori websites Robin Patterson 20:37, 10 Aug 2004 (UTC)\nI also noticed that at the category page you mention that categories aren't nessecarily needed. This was already discussed before the recent implementation of categories, and most agreed that while they were not absolutely nessecary, they were definitely a useful feature. If you meant that they aren't the first priority in getting mi: up and running, then I definitely agree with you there.\nAlso, I noticed that you advertise for your own webpage in one of the system messages (the one about categories). It's generally accepted as policy that while one may add relevant links to normal articles and talk pages, and come very close to advertising (ie only semi-relevant links to sites of ones own) on talk pages, and resort to blatant commercialism on one's own userpage, linking in such a way in the Wikipedia: or MediaWiki: namespace is generally frowned upon.\nIf you sincerely believe that this should be a bilingual Wikipedia until more native speakers come, that's fine with me, but I continue to disagree. As I said before, using English and other non-Maori languages in talkpages and for things you don't know how to translate yourself is fine, but when you resort to having bilingual system messages and a partially or completely bilingual mainpage (in addition to, say, your list of animals), that generally discourages native speakers from editing because it seems less like an effort to build a true Maori Wikipedia at first glance.\nOver 99% of Maori speakers understand English perfectly well, often better than they understand Maori. The bilingual instructions will help them all to navigate and work out how to contribute. Robin Patterson 20:37, 10 Aug 2004 (UTC)\nAs I said before, people who wish to edit here but have limited Maori can visit Community Portal or Korero, and if they are simply interested in the Wikipedia project itself, they can click the link on te Hau Kāinga to the Wikipedia in their language of choice (including Te Reo Tiamana, Te Reo Wiwi, *and*  Te Reo Ingarihi).\nYou may not appreciate my criticisms, and normally I would not expect you to take this sort of criticism, but you are currently the sole sysop on mi: (well, the sole sysop that knows anything better than kia ora) and as such it's YOUR job to fix problems and deal with people's complaints until you can recruit more sysops.\nIt is a bit of a burden. I didn't ask to be a sysop. The good folk who started this off (including those whose Maori is almost certainly better than mine) have virtually left it alone. But, as indicated in a couple of replies above, I'm happy to address perceived problems. I think I have responded as positively as possible to every newcomer who has contributed anything. Robin Patterson 20:37, 10 Aug 2004 (UTC)\n:Re: it's YOUR job to... - it's no one's job to do anything on a volunteer project. I suggest you stop criticising the work of other people if you have nothing constructive to contribute yourself. Also, if you want to have a conversation with Robin, I think his talk page would be a better place to do that rather than the Körero. Angela\nAs to me editing articles in Maori: I do not wish to mess up mi: with my poor Maori. I do have a friend who may be willing to edit, though I think he'd be a lot more likely if mi: wasn't transparently bilingual.\nI have been thinking of removing more of the English from Hau Kāinga now that I've created the Community Portal for people who have little or no Maori. Maybe I'll do that in a week or two if nobody comes and disagrees. Thanks. Robin Patterson 20:37, 10 Aug 2004 (UTC)\nPLEASE ASK YOUR FRIEND to have a go!!!  He or she may like to start with a look at this  Wikipedia:Wikipedia English Language articles about Maori subjects Robin Patterson 20:37, 10 Aug 2004 (UTC)\nI did. He said that it looked like it was only partially in Maori, and that he'd think about contributing later when it looked better. I asked him what he meant by better, and he said he meant when it looked more Maori. My friend *is* familiar with Wikipedia (though I don't think he's done more than a small bit of editing on en:); what you said about Maori bilingualism is true (in fact, I was under the impression that well over 99% of Maori speakers were bilingual), however the enthusiasm of a new user who's thinking of contributing is probably much dampened by the over-abundance of English on even the Main Page, but many system messages as well.\nAlso, while diereses do work, it's been decided *on this page* that we are to use macrons instead. If for some reason I'm wrong about that, you could at least change the system messages that currently use macrons so that they use diereses instead so that it's at least consistent.\nAs to the folks who started this Wikipedia - I'm not sure if you're aware, but the start of mi: is shrouded in scandal, many assert that Perl only started it because he wanted to be a sysop at as many projects as possible. The only Maori he knew he got from an online dictionary, which is where the original interface translations came from. I personally would've started it myself had it not already been started (though I would've used macrons from the beginning, and I'd not've done so much of the user interface without the opinion of at least somebody who has studied a little Maori instead of using a dictionary alone; I also wouldn'tve requested sysophood like he did), as the other couple of Wikipedias I've started testify to.\nAs to advertising, I have noted at least one instance of a link to your zonk site in the Wikipedia: or MediaWiki: namespace. It's fine in talk pages, and even on pages on the article namespace where it's a relevant link, but for an article in the Wikipedia: namespace it's generally unacceptable. Whether or not it's commercial is not relevant; it is obviously a website that you are affiliated with.\nMoved the offending material to MediaWiki talk:Category (and explained its value) - incidentally, I'm more affiliated with Wikipedia than with Zeal in terms of time spent in the last 6 months. Robin Patterson 23:03, 10 Aug 2004 (UTC)\nAnd thanks for replying so soon. Please ask your friend to have another go, translating anything he or she wants to on article pages and Hau Kāinga, so as to reduce the proportion of English. Robin Patterson 23:03, 10 Aug 2004 (UTC)\nWell, nearly 4 weeks later, the anonymous contributor hasn't responded to my request that he or she tell me what else specifically needs fixing. I did fix some of the links that used diaereses instead of macrons, so now there's a bit more that I can't read on my home computer - and other users may have the same problem. Apart from that, I've just gone on occasionally adding a few articles per week, almost exclusively in Māori, and removing some of the English here and there. Noted with pleasure that many of our pages come up on general web searches for specific page names. By way of personal interest, I'm creating a page listing articles that have received significant input from people who know more Māori than I do. I hope most of those contributors come back and continue the improvements. If I've omitted a contribution one of them thinks should be listed, he or she can add it. Robin Patterson 03:57, 6 Sep 2004 (UTC)\nHaere mai.\n": {
        "id": 17,
        "processed": 1,
        "page_id": 3821,
        "text_id": 21570
    },
    "Wikipedia:Kōrero Pūranga 2005\n(Readers interested in Current Events are welcome to see and expand the articles for recent years, eg 2005)\nThis is our watercooler or village pump or coffeebar page, where contributions in English or Maori, about general matters affecting more than one page, are welcome.\nIt would be neat if anyone reading this page could add a Hello or Kia ora line at the bottom just to give us some idea whether anyone's reading it all!\nMacron use.\nPurpose of this page.\nI thought that Körero would be like current events.  I used the same word to mean discuss this page.  Please correct me if I have incorrect usage.\nPerl 13:26, 12 Mar 2004 (UTC)\n:I've now (as reported recently) added this page in Maori to the Discuss this page link, so no confusion; Körero seems fine for the name of this page unless we want to keep with the tavern theme! Robin Patterson 02:27, 27 Apr 2004 (UTC)\n Editing.\nTo edit the current events link on the sidebar, edit MediaWiki:Currentevents; and to edit the translation of discuss this page, edit MediaWiki:Talkpage. (For other sidebar items there are MediaWiki:Movethispage , MediaWiki:Randompage, MediaWiki:Whatlinkshere and MediaWiki:Editthispage). Please look over those pages and make sure I have translated them correctly. I have made you [Vardion] an administrator on this wikipedia so that you may edit the protected messages. \nBest wishes, Perl 13:26, 12 Mar 2004 (UTC)\nPakeha promotion of this site.\nTēnā koutou.\nMy Māori consists of a few phrases (which I expect to increase every day I watch Whakaata Māori (Māori Television) and recognition of not much more than 100 words (including most of those used in the Resource Management Act 1991).\nI'm happy to browse here and tinker editorially/structurally where it might help.\n:Robin Patterson 06:46, 31 Mar 2004 (UTC)\nNow distinctly more proficient after 4 months of Maori Television and reading grammar books on the train! Robin Patterson 23:03, 10 Aug 2004 (UTC)\n----\nNoticing the dearth of contributors, I wonder whether any registered contributors would see anything wrong with the idea of contacting iwi and other groups through their websites, telling them about the Māori Wikipedia, and encouraging them to suggest to their members and associates that contributing would be a good way of promoting te reo Māori. :Robin Patterson 00:36, 7 Apr 2004 (UTC)\n:I think that would be a great idea. I was vaguely considering something along those lines, but I wouldn't have any idea how to do it. Even if we just get a brief mention in a newsletter or something, it may attract a few more contributors. (My own understanding of Māori is highly limited, although I hope to improve it over time). Anyway, welcome aboard. -- Vardion 01:35, 7 Apr 2004 (UTC)\n Tena koutou.\n I'm one of your pakeha fans since enjoying 3 hours on your opening day and an average of an hour a day since.\n I've profiled a couple of your pages in suitable categories on the Web directory  www.zeal.com , where I have some influence. One of the recent additions is probably visible here: http://www.zeal.com/category/preview.jhtml?cid=10144994\n There is also mention on www.wikipedia.com - eg here: http://en.wikipedia.org/wiki/List_of_New_Zealand_television_channels - but little or none on the Maori Wikipedia: maybe some of your people could help promote te reo by contributing there: http://mi.wikipedia.org/wiki/Te_reo_maori\n If your web experts decide to change any URLs, a note to me would ensure that the Zeal and Wikipedia references are updated rather than being lost or deleted.\n E noho ra.\n Robin Patterson\n:Robin Patterson 23:00, 12 Apr 2004 (UTC)\nI've now told the Maori Language Commission about us, got an entry on the Community Panui, and asked Pipers to add the WP to their list of New Zealand language and education websites. Robin Patterson 20:13, 29 Jun 2004 (UTC)\nMachinery and software issues.\nPage views.\n:http://mi.wikipedia.org/wiki/Special:Statistics\n:Robin Patterson 01:35, 16 Apr 2004 (UTC)</strike>\nPage views are no longer recorded for performance reasons. A sysop will need to edit MediaWiki:Sitestatstext to remove the reference to page views. You may want to translate the English version which no longer mentions this. Angela 19:39, 16 Apr 2004 (UTC)\n: Thanks, Angela - Robin  (I fixed it just after Anzac Day)\nMacrons (tohutō).\nI've asked someone how we get a line of tohutō (macronned characters) below the edit box in the same way as other languages do (as our Belgian friend Srtxg suggested above); no reply in last 24 hours; it must be possible, even if it needs a developer to be dragged in for a few minutes. -  Robin Patterson 10:02, 26 Apr 2004 (UTC)\n:To add macronned characters below the edit box, edit MediaWiki:Copyrightwarning. See :de:MediaWiki:Copyrightwarning for an example. Angela 20:42, 26 Apr 2004 (UTC)\nAngela, you are worth your weight in gold. I've attended to that, thank you. I added the stub message code to the box of characters, to save even more time - someone may now tell me what Māori wording would be best in the actual stub message!  Robin Patterson 02:27, 27 Apr 2004 (UTC)\nProgress - clickable macrons from metawikipedia.\nNgā tohutō just by clicking. Hooray! (I had to edit MediaWiki:Copyrightwarning, of course).  Robin Patterson 00:31, 12 Jan 2005 (UTC)\nImages.\nHow do we copy images from other Wikipedias into this one? (I really have tried to find out, by studying at least a dozen pages about images!) Robin Patterson 02:27, 27 Apr 2004 (UTC)\n:A frequently asked question (it should be added to a FAQ somewhere really). It is not currently possible to move images between Wikipedias. You have to download the image to your own computer (often right clicking on it will give you this option), and then re-upload that to the Wikipedia you want the image to be copied to. It's best to copy images that have some sort of source mentioned, or that state that are released under the GFDL, or are public domain. Add interlanguage links between the two so that if one is found to be a copyright violation, the other one can be deleted as well. There are plans for the future for all images to be on one site to save having to upload them separately to each Wikipedia. Angela 02:14, 28 Apr 2004 (UTC)\n Thank you, Angela. I've copied that to a reasonably suitable place here for wider dissemination. - Robin\nImages progress since Sep 2004.\nSee COMMONS - Robin Patterson 00:31, 12 Jan 2005 (UTC)\nTemplates.\nStub message.\n<strike>Do we have a Māori equivalent of:\n that says something meaningful?</strike>\n:Robin Patterson 06:46, 31 Mar 2004 (UTC)\n - We do now; I worked THAT one out all by myself Robin Patterson 12:33, 20 Apr 2004 (UTC)\n and, of course, you no longer need the msg: part; so just stub inside those curly brackets will produce the Māori and English message with lines above and below. Robin Patterson 20:13, 29 Jun 2004 (UTC)\nWelcome templates.\nHaving finally plucked up courage to create a personal message template on another wiki and seen how easy it is, I'm going to create one here. Anyone (I expect) will be able to use it (just enclosing welc1 in double curly brackets, same as for the stub message) and any user may create a close equivalent or totally separate one. Beware! - if you ever revise a template (or someone else does), it will appear in its new form on all previously-applied pages where it still resides, and the new wording may not fit with what was on them, eg if you started off without a concluding Enjoy and added that word manually, the word will appear twice for those recipients if you then add the word into your template; so keep an eye on such a template if you do create one. See Help:Templates.  Robin Patterson 01:25, 26 May 2005 (UTC)\nGeneral.\nFor ways of benefiting from templates, see Help:Templates and related pages. Robin Patterson 00:56, 12 August 2005 (UTC)\nPostscript - to get an unvarying version of a template, prefix subst: after the opening brackets. This produces a copy of the current template but doesn't thereafter update it. And it makes less work for Wikipedia servers. Robin Patterson 02:14, 18 December 2005 (UTC)\nMiscellaneous.\n:  http://meta.wikipedia.org/wiki/How_to_start_a_new_wikipedia\n:http://en.wikipedia.org/wiki/Wikipedia:Naming_conventions\nProgress.\nKia ora koutou! Progress and thoughts following Anzac Day 2004 (and please feel free to add indented comments (ie starting with a colon) to any of these paragraphs!):\nYou'll have noticed that I haven't lost interest in this project. Annoyed with myself for not finishing that Administrators list - I seem to have been distracted then deleted that window after carelessly leaving it with quite a lot more composed and previewed. <strike>If I don't finish it soon, maybe someone else will - it needs only three more sysops to be named and should have Brion listed among the others.</strike>\nPlanning to create numerous lists (rārangi) pages, including a list of lists (!) and things like colours - (rārangi kano) - and months - (rārangi marama) (I hope those are right - see below) so as to make the contribution of one or two words at a time easy for those of us who speak hardly any Māori and can read only a little more. Some of them will be tables, with Māori words listed in alpha order and English equivalents opposite.\nI think we need a separate page for agreed styles (preferably with a proper Māori name - any offers?). Maybe it could start with a link to the English style page and say we follow that except for the following specific points, either of difference or where the English one has no equivalent (eg macrons).\nAnother small machinery matter is how we deal with having variants of words, eg Maori and Māori and maori. Obviously [?] our article would be under the preferred heading, with redirects from the other[s] so that the less skilled writers can link their variant even if they don't pick the preferred one - but those of you with experience in other Wikipedias may be able to steer me in a better direction there! The problem would arise whenever we got an expert opinion saying one of our page titles wasn't good Māori; but I guess moving or renaming is the way to do that; I hope we get some expert speakers soon, so as not to have to change too much.\nIt would be neat if anyone reading this page could add a Hello or Kia ora line at the bottom just to give us some idea whether anyone's reading it all!\nThat's all I can think of for now. If replying to any of these paras, please feel free to move them up or down to old or new headings as appropriate, for easier following of the sense and thread. Kind regards -  Robin Patterson 10:02, 26 Apr 2004 (UTC)\n Milestone - more than 50 articles, so when you click on Long pages you no longer see the shortest page! (Now can someone else add a few dozen names of NZ Governors to Rārangi Kāwana?) - Robin Patterson 22:30, 25 May 2004 (UTC)\nRelevant articles in the English Wikipedia.\nJust thought I should include a link to User:A Pakeha's contribution Wikipedia:Wikipedia English Language articles about Maori subjects so's we don't forget what a valuable resource it is.  - Robin, 27 April.\nUsage of English.\nNew template (Eng) (just type it inside double curly brackets) intended to reinforce the invitation to translate as much as possible into te reo Maori - in haste, Robin Patterson 06:43, 7 Jun 2005 (UTC)\nWikipedia:Usage of English - separate page for much discussion of this big issue; I have moved the discussion that was here (from about August 2004) to the corresponding Talk page. Not moving the History of those edits; maybe someone can do that manually.\n \nHaere mai.\nWikimedia collaboration.\nA new attempt to get the Wikimedia community to collaborate on multi-lingual tasks is the Wikimedia Collaboration of the Week. Please see the page on meta for details. It would be great if you could translate the following to encourage other Mauri speakers to help improve the help pages in this language. The text below is from :en:Template:Wm-cotw and will be updated every week. Thanks. Angela 19:29, 3 Apr 2005 (UTC)\n Audio template.\nHi, I am making audio recordings of the pronunciation of words. Example; Media:Nl-be guy verhofstadt.ogg To include this in a good way in your wiki I need to know what your audio template is and how it works. When I know it i, and many others, can put it directly inside articles on your wikipedia.\nCan some one please put your audio template on this page;\n:(I replied on 7 May, using IP 210.246.21.143, and said I doubted if we had one. Robin Patterson 01:07, 7 May 2005 (UTC))\nTranslation volunteers.\nHi there, I'm Zanimum from the English Wikipedia. I'm running an international-entry exhibit of small artwork. I've found volunteers to translate the site into Arabic, Catalan, Italian, Norwegian and Spanish, and I was wanting a translator to write something in this language. The text to translate is around 300 words. Does anyone want to do a quick translation for us? Thanks! -- :en:user:zanimum (Interested? Contact nicholasmoreau@gmail.com)\n Stewards election.\nHello,\nThe stewards election has started on m:Stewards/elections 2005. Anyone can vote provided that he has a valid account on meta with a link to at least one user page, on a project where the editor is a participant, with at least 3 months participation to the project. Stewards can give sysop right on projects where there are no local bureaucrate. Please vote ! Yann 21:47, 18 May 2005 (UTC)\nPS: Please translate this. Thanks. Yann 21:47, 18 May 2005 (UTC)\n:I would like to be able to translate that (and the one from Zanimum). Somebody may volunteer to. But 99% of the people who read it are comfortable reading English. Anyway, I looked at the m:Stewards/elections 2005 page and put in a couple of votes (for people fluent in other languages).  Robin Patterson 01:25, 26 May 2005 (UTC)\nMention on New Zealand's main community website.\nThe managers of Community Net Aotearoa - http://www.community.net.nz - have kindly updated the year-old notice about Wikipedia Maori and are adding it to one or two of their Links categories. Ka pai! They now have a weekly newsletter in addition to the long-established monthly panui. And an RSS feed for people who know what that means. Robin Patterson 01:25, 26 May 2005 (UTC)  \nMore promotion.\nhttp://www.panui.co.nz/joblink.php?action=display&id=9 is the result of my being invited to place a free advertisement for WP Maori. It's an adaptation of what I wrote for community.net.nz . Maybe we are on the upturn, publicity-wise? Anyway, out of gratitude I profled panui.co.nz on Zeal and I plan to mention it elsewhere too. Anyone like to offer some thoughts about improving the wording further? Robin Patterson 01:30, 24 Jun 2005 (UTC)\n Localized date formats need to be verified.\nDear Wikipedians,\nI need your help to look at date formats for your language. I created a large list of formats here. Please take a look and fix any mistakes or add any new formats.  This will help interwiki bot to match :en:April 1, :fr:1 avril, :ru:1 апреля, :zh:4月1日, and all other sites together.\n": {
        "id": 18,
        "processed": 1,
        "page_id": 4079,
        "text_id": 21571
    },
    "What's needed: Look here at every format for your language, fix any mistakes, note any exceptions (some languages have 1st, 2nd, 3rd, etc naming schemas, or year 1 is written as '1 (year)' unlike all other years).\nAlso, I would like to receive a bot status on your site for my bot User:YurikBot. It will be mostly involved in interwikies.\nThank you!!!\nYou can contact me at en:Yurik (--70.192.56.68 22:17, 24 September 2005 (UTC))\n:I looked at his tables and confirmed or varied what I could; but we haven't finalised all those standards yet. See Wikipedia:Tikanga Wikipedia#Dates. Robin Patterson 02:14, 18 December 2005 (UTC)\nPakeha promotion of this site.\nI think that, there needs to be a better message of this wikipeida, on the en wikipedia, I only found this site, after looking around en wikipeida forawhile, maybe we could have a Maori Wikipeida template, with a link, on the New Zealand article, I think that most people, (exp New Zealanders) look at the NZ article, other that the portal, which has a mi wikipedia link. Heoi anō; nā, Brian New Zealand 06:19, 18 November 2005 (UTC) \nErihapeti II o Ingarangi.\nI uploaded a photo of H.M. The Queen to use with Erihapeti II o Ingarangi, can someone translate the summary. I also had to upload some templates, they also need to be translated. Brian New Zealand 10:31, 18 November 2005 (UTC)\nWikicities.\nThere is now a wikicity set up for New Zealand, check it out Brian | (Talk) 22:57, 10 December 2005 (UTC)\nLogo for this site.\nPlease join the discusion at Wikipedia:Waitohu. Robin Patterson 02:14, 18 December 2005 (UTC)\n Interwiki Bot Status.\nHi. I would like to get my interwiki bot YurikBot marked as a bot in your language. The bot is already operating in almost 50 languages, and it would lower the server load and improve the quality of articles if all interwikies are updated at the same time. You can read more or ask questions here. I always run the latest version of the Pywikipediabot (i am also one of the developers of this project). The request for the bot status is here.  Please support. Thank you. --Yurik (en) 03:12, 24 December 2005 (UTC)\ncheck user.\nPlease join the discusion at Wikipedia:Checkuser Heoi anō; nā Brian  (talk) 08:26, 29 December 2005 (UTC)\n": {
        "id": 19,
        "processed": 1,
        "page_id": 4079,
        "text_id": 21571
    },
    "Wikipedia:Kōrero, pūranga 2006\nKi ngā kaipānui e kaha ana ki te whai i ngā āhuatanga o te wā, e wātea ana koe kia kite, ki te whakaroa hoki i ngā tuhi pānui e pā ana ki ngā tau, pēnā ki a 2005\nPuranga.\nWelcome templates.\nHaving finally plucked up courage to create a personal message template on another wiki and seen how easy it is, I'm going to create one here. Anyone (I expect) will be able to use it (just enclosing welc1 in double curly brackets, same as for the stub message) and any user may create a close equivalent or totally separate one. Beware! - if you ever revise a template (or someone else does), it will appear in its new form on all previously-applied pages where it still resides, and the new wording may not fit with what was on them, eg if you started off without a concluding Enjoy and added that word manually, the word will appear twice for those recipients if you then add the word into your template; so keep an eye on such a template if you do create one. See Help:Templates.  Robin Patterson 01:25, 26 May 2005 (UTC)\nGeneral.\nFor ways of benefiting from templates, see Help:Templates and related pages. Robin Patterson 00:56, 12 August 2005 (UTC)\nPostscript - to get an unvarying version of a template, prefix subst: after the opening brackets. This produces a copy of the current template but doesn't thereafter update it. And it makes less work for Wikipedia servers. Robin Patterson 02:14, 18 December 2005 (UTC)\nMiscellaneous.\n:  http://meta.wikipedia.org/wiki/How_to_start_a_new_wikipedia\n:http://en.wikipedia.org/wiki/Wikipedia:Naming_conventions\nUsage of English.\nNew template (Eng) (just type it inside double curly brackets) intended to reinforce the invitation to translate as much as possible into te reo Māori - in haste, Robin Patterson 06:43, 7 Jun 2005 (UTC)\nWikipedia:Usage of English - separate page for much discussion of this big issue; I have moved the discussion that was here (from about August 2004) to the corresponding Talk page. Not moving the History of those edits; maybe someone can do that manually.\n \nWikimedia collaboration.\nA new attempt to get the Wikimedia community to collaborate on multi-lingual tasks is the Wikimedia Collaboration of the Week. Please see the page on meta for details. It would be great if you could translate the following to encourage other Mauri speakers to help improve the help pages in this language. The text below is from :en:Template:Wm-cotw and will be updated every week. Thanks. Angela 19:29, 3 Apr 2005 (UTC)\n Audio template.\nHi, I am making audio recordings of the pronunciation of words. Example; Media:Nl-be guy verhofstadt.ogg To include this in a good way in your wiki I need to know what your audio template is and how it works. When I know it i, and many others, can put it directly inside articles on your wikipedia.\nCan some one please put your audio template on this page;\n:(I replied on 7 May, using IP 210.246.21.143, and said I doubted if we had one. Robin Patterson 01:07, 7 May 2005 (UTC))\nTranslation volunteers.\nHi there, I'm Zanimum from the English Wikipedia. I'm running an international-entry exhibit of small artwork. I've found volunteers to translate the site into Arabic, Catalan, Italian, Norwegian and Spanish, and I was wanting a translator to write something in this language. The text to translate is around 300 words. Does anyone want to do a quick translation for us? Thanks! -- :en:user:zanimum (Interested? Contact nicholasmoreau@gmail.com)\n Stewards election.\nHello,\nThe stewards election has started on m:Stewards/elections 2005. Anyone can vote provided that he has a valid account on meta with a link to at least one user page, on a project where the editor is a participant, with at least 3 months participation to the project. Stewards can give sysop right on projects where there are no local bureaucrate. Please vote ! Yann 21:47, 18 May 2005 (UTC)\nPS: Please translate this. Thanks. Yann 21:47, 18 May 2005 (UTC)\n:I would like to be able to translate that (and the one from Zanimum). Somebody may volunteer to. But 99% of the people who read it are comfortable reading English. Anyway, I looked at the m:Stewards/elections 2005 page and put in a couple of votes (for people fluent in other languages).  Robin Patterson 01:25, 26 May 2005 (UTC)\nMention on New Zealand's main community website.\nThe managers of Community Net Aotearoa - http://www.community.net.nz - have kindly updated the year-old notice about Wikipedia Māori and are adding it to one or two of their Links categories. Ka pai! They now have a weekly newsletter in addition to the long-established monthly panui. And an RSS feed for people who know what that means. Robin Patterson 01:25, 26 May 2005 (UTC)  \nMore promotion.\nhttp://www.panui.co.nz/joblink.php?action=display&id=9 is the result of my being invited to place a free advertisement for WP Māori. It's an adaptation of what I wrote for community.net.nz . Maybe we are on the upturn, publicity-wise? Anyway, out of gratitude I profled panui.co.nz on Zeal and I plan to mention it elsewhere too. Anyone like to offer some thoughts about improving the wording further? Robin Patterson 01:30, 24 Jun 2005 (UTC)\n Localized date formats need to be verified.\nDear Wikipedians,\nI need your help to look at date formats for your language. I created a large list of formats here. Please take a look and fix any mistakes or add any new formats.  This will help interwiki bot to match :en:April 1, :fr:1 avril, :ru:1 апреля, :zh:4月1日, and all other sites together.\nWhat's needed: Look here at every format for your language, fix any mistakes, note any exceptions (some languages have 1st, 2nd, 3rd, etc naming schemas, or year 1 is written as '1 (year)' unlike all other years).\nAlso, I would like to receive a bot status on your site for my bot User:YurikBot. It will be mostly involved in interwikies.\nThank you!!!\nYou can contact me at en:Yurik (--70.192.56.68 22:17, 24 September 2005 (UTC))\n:I looked at his tables and confirmed or varied what I could; but we haven't finalised all those standards yet. See Wikipedia:Tikanga Wikipedia#Dates. Robin Patterson 02:14, 18 December 2005 (UTC)\nPākehā promotion of this site.\nI think that, there needs to be a better message of this wikipeida, on the en wikipedia, I only found this site, after looking around en wikipeida forawhile, maybe we could have a Māori Wikipeida template, with a link, on the New Zealand article, I think that most people, (exp New Zealanders) look at the NZ article, other that the portal, which has a mi wikipedia link. Heoi anō; nā, Brian New Zealand 06:19, 18 November 2005 (UTC) \nErihapeti II o Ingarangi.\nI uploaded a photo of H.M. The Queen to use with Erihapeti II o Ingarangi, can someone translate the summary. I also had to upload some templates, they also need to be translated. Brian New Zealand 10:31, 18 November 2005 (UTC)\nWikicities.\nThere is now a wikicity set up for New Zealand, check it out Brian | (Talk) 22:57, 10 December 2005 (UTC)\nLogo for this site.\nPlease join the discusion at Wikipedia:Waitohu. Robin Patterson 02:14, 18 December 2005 (UTC)\n Interwiki Bot Status.\nHi. I would like to get my interwiki bot YurikBot marked as a bot in your language. The bot is already operating in almost 50 languages, and it would lower the server load and improve the quality of articles if all interwikies are updated at the same time. You can read more or ask questions here. I always run the latest version of the Pywikipediabot (i am also one of the developers of this project). The request for the bot status is here.  Please support. Thank you. --Yurik (en) 03:12, 24 December 2005 (UTC)\ncheck user.\nPlease join the discusion at Wikipedia:Checkuser Heoi anō; nā Brian  (talk) 08:26, 29 December 2005 (UTC)\nUI translation.\nKia ora.  I've been bold and added translations of the months along with smaller changes.  I'll be visiting family later this month who are involved with a strong Kōhanga Reo up North, so I better warn them I'll be bringing a Māori wiki on a laptop and recruiting editors for here!  --Zigger 22:34, 8 Kohi-tātea 2006 (UTC)\n He whakaaro anō mō ētahi kupu hei whakatikatika.\nI'm breaking with my policy of only using Te Reo on this Wiki, so as to make some points...\n:Thanks for using a language I'm good at! Robin Patterson 00:42, 12 Kohi-tātea 2006 (UTC)\n 1. for the (Move) page link near the top of every page, we have Whakakori  - this is wrong, why? Because although whakakori does mean move it is not the kind of moving that is intended here. Whakakori has to do with the movements or  wrigglings of a person or animal.  Whakakori does not mean 'move' in the sense of relocate or shift (a page). Rather it means move in the sense move/wriggle/exercise your body. I'd suggest Nekehia which means move in the sense  of relocate. It is a passive so you don't need any other words with it to give the right sense.\n:Ka pai. Robin Patterson 00:42, 12 Kohi-tātea 2006 (UTC)\n 2. The Macron picklist at bottom of page has the text Ētahi pū-NĀNA I KAPE (copy or click as required). This makes no sense because in Te Reo it means Certain letters - HE COPIED IT. I'd suggest changing it to the more elegant He tohu whakahua kupu: māu e kape, e pāwhiri rānei  which means Accented letters - for you copy or click on. Literally marks for the pronunciation of words - you may copy (them), or you may click (on them).\n:Only one quibble - the full list is more than accented letters, eg it has useful things such as N-dash and double-bracket pairs. Robin Patterson 00:42, 12 Kohi-tātea 2006 (UTC)\n 3. For (Watch) this page we have Puri turanga which is wrong because puri  rarely appears without duplication, it should be Pupuri tūranga  - this is a compound meaning something like keep your position; but I would suggest Tiakina which means keep a watch - another possibility is Kia hiwa - be watchful. But I like Tiakina with its overtones of keeping a protective eye on something.\n:Tiakina? - but then I read Z's comment. Robin Patterson 00:42, 12 Kohi-tātea 2006 (UTC)\n 4. (Talk)/discuss this page - we have Kōrero tēnei hau. This is bad grammar because kōrero requires the particle i to come between it and tēnei. (Unlike the phrase in point 3, this is not a compound because it includes tēnei and so must have a particle). Failing i, you can use mō after kōrero to give the meaning speak about. You must have something between it and a noun - if you know any languages with cases like Latin or German, i is one of the particles that mark the accusative case, and leaving it out is like having a noun in the nominative instead of the accusative after a verb. \n Another point is that kōrero means talk in the sense more of say/tell.  So Kōrero tēnei hau means Say this hau although because the particle is missing it looks like a defective Ka kōrero tēnei hau  - This hau speaks. The correct word for talk about/discuss is Kōrerorero which implies a group activity of discussion, and I'd suggest the passive form Kōrerorerotia which gives the sense without requiring any particles or nouns to follow it. Also, hau is a bit vague.  Kōrerorerotia is all you need. Kahuroa 09:57, 10 Kohi-tātea 2006 (UTC)\n:Ka pai. Robin Patterson 19:17, 26 Kohi-tātea 2006 (UTC)\n:I had been banging my head between various references trying to work out similar candidates for the short messages, and why an unadorned kōrero was used in so many places.  I edited the local system messages for 1 & 2 according to your suggestions.\n:I agree with your reasoning about Watch, but tiakina seems to be associated with saving a file (according to the Microsoft Community Glossary), perhaps as in safe-guarding.  Watch is an abbreviated multilayered compromise describing the software feature.  Other possible concepts include remembering, noting, listing, adopting, and guarding (but not protecting).\n:Would Kōrerorerotia be a better title for this page, being primarily group discussion?  And would kōreromō be better for talk about (this page) / talk to (this user)?\n:- Zigger 20:13, 11 Kohi-tātea 2006 (UTC)\n:Apology for the bad grammar. I put the extra two words in a long time ago to distinguish from the Kōrero page (which has had several names). Now that we are about to get a better name for it, that distinction (even with proper grammar) may be unnecessary. I think Zigger and Kahuroa can continue the dialogue without me, and tomorrow morning the process will probably be even easier. Robin Patterson 00:42, 12 Kohi-tātea 2006 (UTC)\nSomeone's an early riser! More good-looking ideas appearing at various times of day. I shouldn't have had an evening off.\nMaybe it's time for separate pages to discuss some of these except where they clearly relate?\nKōrero mai is a nice idea for user-talk but I have a feeling we can't have a different one for other types of talk pages. So Kōrero mō te whārangi for all, maybe?\nFor this page - have a look at the top paragraphs.\nRobin Patterson 19:20, 12 Kohi-tātea 2006 (UTC)\n Link tabs on the top of articles, Kōrero page.\nI decided to wipe some of my previous comments on these, because I have had a rethink and it would have been too confusing to leave the other stuff here - confusing for me at least anyway! Kahuroa\n:Ah, that may explain what look like unsigned paragraphs above; anyway, good idea collecting remainder here. Robin Patterson 21:33, 26 Kohi-tātea 2006 (UTC)\n Yeah, that'll be me Kahuroa 07:23, 27 Kohi-tātea 2006 (UTC)\nWikipedia english: discussion - miWiki presently kōrero tēnei hau.\n(problem: ungrammatical)\n:Kōrerorero - Robin Patterson 21:33, 26 Kohi-tātea 2006 (UTC)\n Yeah, Kōrerorero is appropriate. I think this one needs to be sorted as its no good having bad grammar around the place.Kahuroa 07:16, 27 Kohi-tātea 2006 (UTC)\nWikipedia english: watch: miWiki presently puri tūranga .\n(problem: unusual word use (puri))\n- would like to see this one sorted as it is also bad grammar. Kahuroa 07:17, 27 Kohi-tātea 2006 (UTC)\nmiWiki Kōrero page.\nThis is ok as it is. My other suggestion would be: \n:I have toyed with the idea of suggesting Hui hapori, but that's just a phrase I concocted. Robin Patterson 21:33, 26 Kohi-tātea 2006 (UTC)\ndiacritics, accented letters, other symbols to click or copy.\nRe the diacritics and Robin's point that there are more than just accented letters. How about just adding a bit to cover that:\nHe pū, he tohu whakahua kupu: māu e kape, e pāwhiri rānei  . Kahuroa 04:52, 17 Kohi-tātea 2006 (UTC)\n:Maybe unnecessarily long? - omit whakahua kupu, perhaps? - with or without accents, all are pū and/or tohu; and whatever they are is displayed immediately after. Robin Patterson 21:33, 26 Kohi-tātea 2006 (UTC)\n I agree it is long, but 'tohu whakahua kupu' is one of the rare examples on the site of phrases with a nice idiomatic feel to them. 'Tohu' on its own has a very wide semantic field - can mean a lot of things, including omen etc, so if we could retain it that would be good. Maybe 'he pū' is somewhat more dispensible since methinks that pū as meaning 'letter' is more of a dictionary term rather than one speakers of the language would understand at sight. Kahuroa 07:22, 27 Kohi-tātea 2006 (UTC)\n": {
        "id": 20,
        "processed": 1,
        "page_id": 4080,
        "text_id": 21572
    },
    " Any further discussion.\nOn these points discussed above? Kahuroa 10:48, 26 Kohi-tātea 2006 (UTC)\nMain Page redesign.\nI have on my user page a mockup of my proposed new version of the main page. Since I translated some of the text into Māori the page has looked particularly ugly, so I had a go at a redesign. I thought we needed some more colour on the page as well, and to reduce how much space is taken up by the long lists. I have included all the info and links on the current page, plus put some English fairly prominently to acknowledge the input of English speakers so far. Kahuroa 09:36, 15 Hui-tanguru 2006 (UTC)\nAlphabetical order and some points about numerical separators.\nOur energetic German friend Gangleri has asked me this, but I think it needs several of us or maybe just the mi-3+ people:\n Halló Robin! I would like to have your feedback concerning WiktionaryZ T: Collation by a certain locale and new magic words.\n(There's a bit more on my talk page)\nDo we want our 10 macron characters to follow Z or z in lists or do we want them close to the vowels they resemble?\nRobin Patterson 21:25, 8 Poutū-te-rangi 2006 (UTC)\n(The alphabetical questions deserve a separate page; maybe Kahuroa can suggest a name for it but this will do meantime: project:whakarārangi-ā-pū)\n:(removed most of the subsequent discussion there, 13th)\nNumerical separators.\nThanks a lot! Updated both template:wikivar#miscelaneous and wikt:. I assume that numbers are '. Could you please specify also the numerical separators (thousand separator and decimal point separator)? Please compare the usage of , and . at special:Statistics versus :de:special:Statistics. Best regards Gangleri | T | m: Th | T 12:28, 10 Poutū-te-rangi 2006 (UTC)\n:I'm confident that both of NZ's written languages follow the English rather than the German and other Continental. Reed Pocket Dictionary has 1,000, 000 for miriona, with the space probably being a typo, and it offers ira tekau for decimal point (ira being defined as a dot, among other things, not a comma). Whakaata Māori uses decimal points. Robin Patterson 05:38, 13 Poutū-te-rangi 2006 (UTC)\nAranga.\nI'll be at home for Easter but my PC isn't working, so don't expect anything from me till Rātū. Robin Patterson 07:18, 13 Paenga-whāwhā 2006 (UTC)\n:Have a Happy Easter! Heoi anō; nā Brian  (talk) 20:32, 13 Paenga-whāwhā 2006 (UTC)\n Proposed New Zealand Wikimedia chapter.\nHead over to the Wikimedia New Zealand page on Meta if you're interested in helping out with forming a New Zealand chapter of Wikimedia Heoi anō; nā Brian  (talk) 05:27, 22 Paenga-whāwhā 2006 (UTC)\nPurpose.\nhttp://meta.wikimedia.org/wiki/Local_chapter_FAQ#What_is_the_point_of_having_chapters.3F\n Auckland meetup.\nJust to let you know that a meetup is planned in Auckland for the 25th of June (see en:Wikipedia:Meetup/Auckland for more details), and that you are all cordially invited. Heoi anō; nā Brian  (talk) 23:35, 22 Paenga-whāwhā 2006 (UTC)\nHello!.\nhello\n--70.50.211.35 01:43, 27 Paenga-whāwhā 2006 (UTC)paul stevenson\n Mediawiki-i18n Internationalisation news.\n Halló! If you can help generating the ' - ' files LanguageMi.php and MessagesMi.php to run the Māori projects please log in at , go to Betawiki:LanguageMi.php and MessagesMi.php at section contacts and list your name. We can start with the messages translated already and continue step by step. Thanks in advance! Best regards Gangleri · T · m: Th · T 22:42, 7 Haratua 2006 (UTC)\n: We have some documentation available now. I imported the messages from :mi:. Please contact me on [irc://irc.freenode.net/mediawiki #mediawiki. Thanks User:Gangleri|Gangleri · User_talk:Gangleri|T · m:user:Gangleri|m: Th · m:user talk:Gangleri|T]] 02:08, 27 Haratua 2006 (UTC)\nOK Kahuroa 08:03, 28 Haratua 2006 (UTC)\nKia Ora.\nHe kaikōrero Māori anō e noho ana i Tāmaki-makau-rau? (2006-05-19 17:27:19 User:Māori rahi)\n": {
        "id": 21,
        "processed": 1,
        "page_id": 4080,
        "text_id": 21572
    },
    "He rārangi i ngā tuhipānui e mātua hiahiatia ana\n Haurongo.\n Kaitito.\n Kaihōpara.\n He Kaihanga, he kaimātai pūtaiao.\n He Kaipāngarau.\n He Kaituhi, he kairapu whakaaro.\n He Tohunga Toi.\n He kaitōrangapū, he kaiarahi o mua.\n He kaitōrangapū, he kaiarahi o nāianei.\n He Wāhine rongonui.\n He tohunga rorohiko, he tohunga ipurangi.\n He kaiwhakamataku.\n Tikanga ā Motu.\n Te Ahuwhenua.\n He inu.\n Mātai matawhenua.\n Continents.\n Tāone matua, nunui.\n Moni.\n Mātai matawhenua - kaupapa kē atu.\n Kaupapa matawhenua.\n Moana.\n Poles.\n Mata o te whenua, kare o te tai.\n Hītori.\n Tōrangapū.\n Kaupapa tangata.\n Kaupapa o tāwāhi.\n Whakapono.\nWhakapono-kore:\n Tikanga.\n Pūtaiao.\n Mātau kōkōrangi.\n Biology.\n Biological materials.\n Mammalian anatomy.\n Biological processes.\n Organisms.\n Chemistry.\n Ecology.\n Geology.\n Medicine.\n Meteorology.\n Physics.\n Human sciences.\n Resources.\n SI units and others.\n Calendars and timekeeping.\n Language.\n Architecture.\nalso civil engeering\n Mathematics.\n Military.\n Sport.\n Industry.\n Technology.\n Computers.\n Common technology.\n Communication.\n Electricity.\n Electronics.\n Materials.\n Transportation.\n Weapons.\n Disasters.\n Philosophy.\n Economics.\n": {
        "id": 22,
        "processed": 1,
        "page_id": 4593,
        "text_id": 38891
    },
    " en: Requests for the bot flag should be made on this page. This wiki uses the standard bot policy, and allows global bots and automatic approval of certain types of bots. Other bots should apply below.\nNgā tono tohu karetao (Requests for bot status).\nTēnā koutou, e ngā karetao āwhina i te whakapai i te Wikipedia. Nau mai, haere mai ki te Wikipedia Māori.\nPlease add any requests for bot status in a new section below. \n    * Operator (link to User page, may be on another wiki):\n    * Name of bot (link to Bot User page):\n    * List of botflags on other wikipedias:\n    * Purpose of the bot:\n    * Technical details:\nVoters may wish to indicate their views by using the templates  (support),  (oppose) or  (neutral).\nIf there is consensus, status will be granted by a local bureaucrat (generally User:Kahuroa). \n Bot flag request for User:TXiKiBoT.\nHello, I'm :eu:TXiKi, from the basque wikipedia, and I would like to ask you for a bot flag here to add and correcting interwiki links from and to Maori Wikipedia. I'm an admin user in the basque wikipedia (eu) and I have the bot flag in more than 80 wikipedias. I work with the pywikipedia framework correcting the most linked pages as years, decades, domains, municipalities, etc. This is the full list of the wikipedias where I have a flagged bot: am, an, ar, ast, az, bat-smg, be, bn, bpy, br, bs, ca, co, cs, csb, cv, cy, da, en, eo, es, et, eu, fo, fr, frp, fur, fy, ga, gd, gl, gu, he, hi, ht, hy, is, it, jv, kn, ksh, ku, lb, lij, lmo, ln, mk, mr, na, nah, nap, nds-nl, nl, no, nrm, oc, os, pl, pt, ru, ru-sib, scn, sco, simple, sk, sl, sq, sr, su, sv, ta, te, tet, tg, tr, ur, vec, vi, vls, vo, zh-classical and zh-yue. I can speak basque, spanish, catalan and english. Thank you. TXiKiBoT 14:02, 12 Paenga-whāwhā 2007 (UTC)\nKia ora, Hello TXiKiBoT. I see you have contacted Robin Patterson for approval - unfortunately the community here asked Robin Patterson in November to cease his involvement with this Wiki, which he has basically respected until now. Have you approached any of the other bureaucrats? I have approached :en:User:Vardion. Kahuroa 21:05, 13 Paenga-whāwhā 2007 (UTC)\n:I can flag TXiKiBoT as a bot, assuming that it is the consensus of active users here. It would also be a good idea, I suppose, if someone who was active here became a bureaucrat, too - I'm not around here very often (my only real involvement here was in the early stages in an attempt to get things started, and even then, my knowledge of the language was too low for me to contribute much). In the meantime, though, I'll do what's asked - is there consensus that TXiKiBoT should be flagged as a bot? -- Vardion 01:44, 14 Paenga-whāwhā 2007 (UTC)\n::It was me who asked Robin to flag this as a bot. I am not active much here now days, as we have got to a stage where Kahuroa has improved this wiki to a better stage of Māori language. \n::Kahuroa, I asked as I was not aware of that, and only asked him because he is a bureaucrat, and the only one I knew to have been active here. I check the RC most days for spam, and vandalism, and I feel a bot flag for this active bot will make life easier. Heoi anō; nā Brian  (talk) 04:26, 14 Paenga-whāwhā 2007 (UTC)\n:::Well I have wanted to flag the bots for some time too, and I have no objection to it being done, as long as the bot has been granted that status, and maintained it, on other wikis. I am the most (only) active user, there are one or two others who edit occasionally but their appearance is a bit erratic. As Vardion says, it would make sense if an active user was a bureaucrat too. Then the Māori wikipedia could be said to be standing on its own feet for the first time in its history. Kahuroa 00:21, 15 Paenga-whāwhā 2007 (UTC)\n::::Since there don't seem to be any objections, I've flagged TXiKiBoT as a bot. If there's anything else requiring a bureaucrat, feel free to contact me, although I guess it would be good if there was a local bureaucrat around to do it. -- Vardion 23:35, 16 Paenga-whāwhā 2007 (UTC)\nThanks Vardion. Much appreciated Kahuroa 05:27, 17 Paenga-whāwhā 2007 (UTC)\n Bot flag request for VolkovBot.\nI'd like to request a flag for this bot --VolkovBot 07:08, 27 Paenga-whāwhā 2007 (UTC)\n List of botflags on other wikipedias: ar, be-x-old, ca, cs, da, de, en, eo, es, et, fi, fr, gu, he, id, is, it, ka, lt, pl, pt, ro, ru, sl, sr, tg, tr, uk, vec, zh-yue\nKo te potitanga mō VolkovBot.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a VolkovBot: \n Kahuroa 20:06, 27 Paenga-whāwhā 2007 (UTC)\n Brian  (talk) 23:37, 27 Paenga-whāwhā 2007 (UTC)\n:Kua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 02:54, 28 Paenga-whāwhā 2007 (UTC)\n Bot flag request for Escarbot.\nThank you in advance.\nVargenau 13:50, 28 Paenga-whāwhā 2007 (UTC)\nKo te potitanga mō Escarbot.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a Escarbot: \n Kahuroa 22:10, 28 Paenga-whāwhā 2007 (UTC)\n Brian  (talk) 19:16, 30 Paenga-whāwhā 2007 (UTC)\n:Kua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 00:17, 1 Haratua 2007 (UTC)\nThank you. Vargenau 14:50, 1 Haratua 2007 (UTC)\nBot flag Robbot.\n- Andre Engels 22:33, 3 Haratua 2007 (UTC)\nKo te potitanga mō Robbot.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a Robbot: \n Kahuroa 10:23, 4 Haratua 2007 (UTC)\n Brian  (talk) 00:30, 6 Haratua 2007 (UTC)\n:Kua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 09:48, 6 Haratua 2007 (UTC)\n Le Pied-bot.\nHi ! I request bot flag for my bot account Le Pied-bot.\nCordialy, EDUCA33E 22:27, 19 Haratua 2007 (UTC)\nKo te potitanga mō Le-Pied-bot.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a Le-Pied-bot: \n Brian  (talk) 01:01, 20 Haratua 2007 (UTC)\n Kahuroa 07:24, 20 Haratua 2007 (UTC)\n:Kua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 07:29, 20 Haratua 2007 (UTC)\nThanks ! Cordialy, EDUCA33E 11:04, 20 Haratua 2007 (UTC)\n Bot flag request.\nHello! My name is Thijs! and I would like to request a bot flag for Thijs!bot.\n List of botflags on other wikipedias: af, als, an, ar, ast, az, be, bg, bn, bs, ca, cs, da, de, el, en, eo, es, et, eu, fa, fi, fr, fur, gl, he, hi, hr, hu, hy, ia, id, ie, io, is, it, ka, ko, la, lb, li, lt, lv, mk, nap, nds, nds-nl, nn, no, oc, os, pl, pt, ro, ru, scn, sh, simple, sk, sl, sq, sr, sv, tg, th, tr, vec, vi, vls, zh, zh-yue.\nKo te potitanga mō Thijsbot.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a Thijsbot: \n Kahuroa 00:09, 21 Haratua 2007 (UTC)\n Brian  05:39, 22 Haratua 2007 (UTC)\nKua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 06:51, 22 Haratua 2007 (UTC)\n Byrialbot.\nHello! Sorry for not speaking your language. I ask for permission to run my interwiki bot Byrialbot here at the Māori Wikipedia, and to get a bot flag for it.\n List of botflags on other wikipedias: als:, am:, an:, ar:, arc:, bat-smg:, be:, be-x-old:, bg:, bm:, bn:, bs:, bpy:, ca:, cdo:, ceb:, co:, cs:, cv:, da:, de:, el:, en:, eo:, es:, et:, ff:, fi:, fo:, fr:, frp:, fur:, fy:, ga:, gl:, he:, hr:, hsb:, hu:, hy:, id:, io:, is:, it:, ja:, ka:, ksh:, ku:, kw:, la:, lb:, li:, lt:, lv:, mk:, ml:, mr:, ms:, nap:, nds:, nds-nl:, nl:, nn:, no:, nov:, nrm:, os:, pms:, pt:, qu:, ro:, ru:, scn:, sco:, sh:, simple:, sk:, sl:, sq:, sr:, su:, sv:, sw:, ta:, te:, th:, tl:, uk:, vec:, vls:,  vo:, wo:, zh-min-nan:, zh-yue:\n Technical details: Interwiki using Pywikipediabot (constantly updated  with CVS) starting from da:, nn:, no: and sv:. It mostly runs manually assisted and I try to solve found interwiki conflicts when I can.\nIt has already done a few test edits. Thank you! Byrial 15:16, 9 Hōngongoi 2007 (UTC)\nKo te potitanga mō Byrialbot.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a Byrialbot: \n Kahuroa 19:13, 9 Hōngongoi 2007 (UTC)\n Brian 21:22, 9 Hōngongoi 2007 (UTC)\nKua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 05:20, 10 Hōngongoi 2007 (UTC)\n: Thank you. Byrial 09:35, 10 Hōngongoi 2007 (UTC)\nFalcobot.\nFalcoBot is a bot being tested by User:Kahuroa to do routine tasks. It has been granted a bot flag in the meantime to avoid cluttering up the recent changes list. FalcoBot 10:06, 17 Here-turi-kōkā 2007 (UTC). Kahuroa 00:15, 20 Here-turi-kōkā 2007 (UTC)\n  Brian 03:32, 20 Here-turi-kōkā 2007 (UTC)\n PipepBot.\nHello! I ask for permission to run my interwiki bot PipepBot here, and to get a bot flag for it.\n Has bot flag at: als, am, an, ar, az, bat-smg, be, be-x-old, bn, bs, ca, ce, ceb, cs, cv, da, de, en, eo, et, fo, fr, fur, fy, ga, gd, hr, ht, id, ie, ilo, io, is, ka, ksh, la, lb, li, lij, ln, lv, mk, ml, ms, nap, nds, nds-nl, nn, no, pms, rm, roa-tara, ru-sib, scn, sh, simple, sl, sr, su, sv, th, tl, udm, uk, vec, zea, zh-yue\nThank you!\n--:it:User:Pipep 17:11, 17 Here-turi-kōkā 2007 (UTC)\nKo te potitanga mō PipepBot.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a PipepBot: \n Kahuroa 00:15, 20 Here-turi-kōkā 2007 (UTC)\n Brian 03:31, 20 Here-turi-kōkā 2007 (UTC)\n:Thank you! Pipep 13:35, 20 Here-turi-kōkā 2007 (UTC)\n Bot flag for JAnDbot.\nPlease for getting bot-flag for User:JAnDbot. It's pywikipedia interwiki bot, usually starting from cs: and sometimes running with manual control for problematic interwiki.\nJAnDbot 13:50, 2 Mahuru 2007 (UTC)\nKo te potitanga mō JAnDbot.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a JAnDbot: \n Kahuroa 19:06, 2 Mahuru 2007 (UTC)\n Brian 19:12, 2 Mahuru 2007 (UTC)\nKua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 00:09, 3 Mahuru 2007 (UTC)\n BotMultichill.\nHi, i request a bot bit for BotMultichill.\n Technical details : BotMultichill is an interwiki bot starting at the Dutch wikipedia. The bot uses the pywikipedia framework and runs day and night in autonomous mode. Sometimes the bot will run in manual assisted mode to solve interwiki conflicts. Multichill 14:43, 6 Mahuru 2007 (UTC)\nKo te potitanga mō BotMultichill.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a BotMultichill : \n Kahuroa 18:53, 6 Mahuru 2007 (UTC)\n Brian 19:46, 6 Mahuru 2007 (UTC)\nKua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 00:24, 7 Mahuru 2007 (UTC)\n:Thank you! Multichill 09:06, 7 Mahuru 2007 (UTC)\n SieBot.\nHi, i request a bot bit for SieBot. SieBot is active on *all* Wikipedias updating interwiki links. Siebrand 20:26, 16 Mahuru 2007 (UTC)\nKo te potitanga mō SieBot.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a SieBot : \n Kahuroa 00:06, 17 Mahuru 2007 (UTC)\n Brian 03:24, 18 Mahuru 2007 (UTC)\nKua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 06:24, 18 Mahuru 2007 (UTC)\n AlleborgoBot.\nAlready has a bot flag in: ar, az, bg, br, bpy, bs, ca, ceb, cs, da, de, en, eo, es, eu, fa, fi, fr, gl, he, hr, hu, hy, id, it, ja, jv, ka, ksh, lb, li, lmo, ln, lt, ms, nds, nl, nn, no, pl, pt, ro, ru, sk, simple, sl, sq, su, sv, th, tr, uk, vec, vi, zh, zh-yue. On it.wiki has done more than 45000 edit.\nThanks  --AlleborgoBot 12:15, 1 Whiringa-ā-nuku 2007 (UTC)\nKo te potitanga mō AlleborgoBot.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a AlleborgoBot : \n Kahuroa 18:35, 2 Whiringa-ā-nuku 2007 (UTC)\n Brian 20:40, 2 Whiringa-ā-nuku 2007 (UTC)\nKua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 23:33, 2 Whiringa-ā-nuku 2007 (UTC)\n Idioma-bot.\nHello! I ask for permission to run my interwiki bot Idioma-bot here, and to get a bot flag for it.\nThank you!\n--:lt:User:Hugo.arg 11:45, 30 Whiringa-ā-rangi 2007 (UTC)\nKo te potitanga mō Idioma-bot.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a Idioma-bot: \n:The flag has been set. --Dungodung 12:33, 1 Hui-tanguru 2008 (UTC)\n Purbo T.\nHi, I'd like to request a bot flag for Purbo T (contributions)\n Generally, there is cumulated data on the bot (sorry, due to recent technical problems at the toolserver, data may still be incomplete, or partially not up to date)\nThank you! --Purodha Blissenbach 09:31, 21 Hui-tanguru 2008 (UTC)\nKo te potitanga mō Purbo T.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a Purbo T: \n:The bot flag has been set. --Dungodung 09:36, 15 Poutū-te-rangi 2008 (UTC)\nFiriBot.\nOperator: Firilacroco (talk)\nAutomatic or Manually Assisted: I usually run it in the -autonomous mode, but sometimes I manually assist it.\nProgramming Language(s): Python (using pywikipedia framework via SVN)\nFunction Summary: I'll use it for interwiki links\nEdit period(s) : Daily\nAlready has a bot flag (Y/N): Yes, on: la, simple, uk, nn, sr, ru, bn; and I have requests pending on ia, dv, ro, ko, rmy, bg, bs, nl, eo, sv, vec, sq, fr, es\nFunction Details: It adds/modifies/deletes interwiki links, and it corrects double redirect pages.\nKo te potitanga mō FiriBot.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a FiriBot : \n Kahuroa 18:35, 2 Whiringa-ā-nuku 2007 (UTC)\nKua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 18:51, 4 Mei 2008 (UTC)\n SpBot.\nAlready has bot flag on: bn, da, nap, oc, ca, cs, be-x-old, ru, de: (since 2006, with >60.000 edits), look at details (or alternative site)\n:Thank you! --SpBot 15:04, 11 Mei 2008 (UTC)\nKo te potitanga mō SpBot.\nKo te kaupapa: kia whakawhiwhia he tohu karetao ki a SpBot : \n Kahuroa 08:35, 16 Mei 2008 (UTC)\n MelancholieBot.\n Kua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 08:45, 16 Mei 2008 (UTC)\nAlexbot.\nI request the bot flag for Alexbot:\n:Programming Language:Pywikipedia SVN\n:Functions:Interwiki(+autonomous), double redirect fix.\nThank you--Alexsh 18:45, 27 Mei 2008 (UTC)\n Kua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 04:40, 28 Mei 2008 (UTC)\nBot flag for StigBot.\nI hereby request botflag on this wiki for my bot StigBot.\nOther: Runs manually initiated automatic supervised and sometimes entirely manual. Already has bot flag on: als, ar, be-x-old, bpy, ca, cu, de, en, eo, fr, fur, hu, it, mk, nl, nn, la, oc, os, pl, pt, ro, ru, sco, simple, sv, udm and vo\nBest regards, Stigmj 08:25, 18 Hune 2008 (UTC)\n Kua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 09:20, 18 Hune 2008 (UTC)\n WikiDreamer Bot.\nThanks! --WikiDreamer 12:33, 9 Hūrae 2008 (UTC)\n Kua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 01:32, 10 Hūrae 2008 (UTC)\n HerculeBot.\nThanks --Hercule 08:36, 1 Hepetema 2008 (UTC)\n Kua whakawhiwhia te tohu karetao ki tēnei kaimahi.Kahuroa 19:13, 4 Hepetema 2008 (UTC)\n Synthebot.\nDear all, this is to request a bot flag for Synthebot. Its technical information is summarized below.\nFurther technical information is available on its main page. Thank you in advance. Regards, --Julian 16:14, 22 Hepetema 2008 (UTC)\n Kua whakawhiwhia te tohu karetao ki tēnei kaimahi.Kahuroa 10:19, 23 Hepetema 2008 (UTC)\n Ptbotgourou.\nDear all, this is to request a bot flag for Ptbotgourou. \nRegards --Gdgourou 21:15, 27 Hepetema 2008 (UTC)\n: Kua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 02:28, 28 Hepetema 2008 (UTC)\n Luckas-bot.\nDear all, this is to request a bot flag for Luckas-bot. \nRegards. Luckas Blade 21:58, 14 Noema 2008 (UTC)\n: Kua whakawhiwhia te tohu karetao ki tēnei kaimahi. Kahuroa 05:25, 17 Noema 2008 (UTC)\n CarsracBot.\nDear all, this is to request a bot flag for CarsracBot. \nRegards. Carsrac 9:58, 12-4-2008 (UTC)\n": {
        "id": 23,
        "processed": 1,
        "page_id": 12098,
        "text_id": 74210
    },
    " Almabot.\nHello, I would like to request the flag for my bot:\nThanks in advance. Nakor 18:19, 27 Hune 2009 (UTC)\nBot policy.\nHello. To facilitate steward granting of bot access, I suggest implementing the standard bot policy on this wiki. In particular, this policy allows stewards to automatically flag known interlanguage linking bots (if this page says that is acceptable), which form the vast majority of such requests. The policy also enables global bots on this wiki (if this page says that is acceptable), which are trusted bots that will be given bot access on every wiki that allows global bots.\nThis policy makes bot access requesting much easier for local users, operators, and stewards. To implement it we only need to create a redirect to this page from Project:Bot policy, and add a line at the top noting that it is used here. Please read the text at m:Bot policy before commenting. If you object, please say so; I hope to implement in one week if there is no objection, since it is particularly written to streamline bot requests on wikis with little or no community interested in bot access requests. Rubin16 07:36, 7 Hūrae 2009 (UTC)\n:I have no objection. I believe I am the only active admin currently on this wikipedia, and there are no active bureacrats.-gadfium 06:30, 8 Hūrae 2009 (UTC)\n Ok. Let's wait till the end of the week Rubin16 07:02, 8 Hūrae 2009 (UTC)\n": {
        "id": 24,
        "processed": 1,
        "page_id": 12098,
        "text_id": 74210
    },
    " /** Tooltips and access keys ***************************************************\n  *\n  *  Description: Adds tooltips and access keys to links part of the MediaWiki\n  *               interface.\n  */\n \n ta = new Object();\n ta[n-mainpage]            = new Array(z,Visit the main page); \n ta[n-Main-page]           = new Array(z,Visit the main page); \n ta[n-Featured-content]    = new Array(,Featured content - the best of Wikipedia); \n ta[n-help]                = new Array(,The place to find out about Wikipedia); \n ta[n-contact]             = new Array(,How to contact Wikipedia);\n ta[n-sitesupport]         = new Array(,Help keep Wikipedia running); \n ta[t-print]               = new Array(,Printable version of this page);\n ta[t-permalink]           = new Array(,Permanent link to this version of the page);\n ta[t-cite]                = new Array(,Cite this Wikipedia article);\n ta[ca-nstab-project]      = new Array(c,View the project page);\n ta[n-Contents]            = new Array(,Guides to browsing Wikipedia); \n /** Import module *************************************************************\n  *\n  *  Description: Includes a raw wiki page as javascript or CSS, \n  *               used for including user made modules.\n  */\n importedScripts = {}; // object keeping track of included scripts, so a script ain't included twice\n function importScript( page ) {\n     if( importedScripts[page] ) {\n         return;\n     }\n     importedScripts[page] = true;\n     var url = wgScriptPath\n             + '/index.php?title='\n             + encodeURIComponent( page.replace( ' ', '_' ) )\n             + '&action=raw&ctype=text/javascript&dontcountme=s';\n     var scriptElem = document.createElement( 'script' );\n     scriptElem.setAttribute( 'src' , url );\n     scriptElem.setAttribute( 'type' , 'text/javascript' );\n     document.getElementsByTagName( 'head' )[0].appendChild( scriptElem );\n }\n \n function importStylesheet( page ) {\n     var sheet = '@import '\n               + wgScriptPath\n               + '/index.php?title='\n               + encodeURIComponent( page.replace( ' ', '_' ) )\n               + '&action=raw&ctype=text/css;'\n     var styleElem = document.createElement( 'style' );\n     styleElem.setAttribute( 'type' , 'text/css' );\n     styleElem.appendChild( document.createTextNode( sheet ) );\n     document.getElementsByTagName( 'head' )[0].appendChild( styleElem );\n }\n /* Test if an element has a certain class **************************************\n  *\n  * Description: Uses regular expressions and caching for better performance.\n  */\n \n var hasClass = (function () {\n     var reCache = {};\n     return function (element, className) {\n         return (reCache[className] ? reCache[className] : (reCache[className] = new RegExp((?:\\\\s|^) + className + (?:\\\\s|$)))).test(element.className);\n     };\n })();\n /** Internet Explorer bug fix **************************************************\n  *\n  *  Description: UNDOCUMENTED\n  *  Maintainers: User:Tom-?\n  */\n \n if (window.showModalDialog && document.compatMode && document.compatMode  CSS1Compat)\n {\n   var oldWidth;\n   var docEl = document.documentElement;\n \n   function fixIEScroll()\n   {\n     if (!oldWidth || docEl.clientWidth > oldWidth)\n       doFixIEScroll();\n     else\n       setTimeout(doFixIEScroll, 1);\n   \n     oldWidth = docEl.clientWidth;\n   }\n \n   function doFixIEScroll() {\n     docEl.style.overflowX = (docEl.scrollWidth - docEl.clientWidth < 4) ? hidden : ;\n   }\n \n   document.attachEvent(onreadystatechange, fixIEScroll);\n   attachEvent(onresize, fixIEScroll);\n }\n /** Interwiki links to featured articles ***************************************\n  *\n  *  Description: Highlights interwiki links to featured articles (or\n  *               equivalents) by changing the bullet before the interwiki link\n  *               into a star.\n  */\n \n function LinkFA() \n {\n     if ( document.getElementById( p-lang ) ) {\n         var InterwikiLinks = document.getElementById( p-lang ).getElementsByTagName( li );\n \n         for ( var i = 0; i < InterwikiLinks.length; i++ ) {\n             if ( document.getElementById( InterwikiLinks[i].className + -fa ) ) {\n                 InterwikiLinks[i].className +=  FA\n                 InterwikiLinks[i].title = This is a featured article in another language.;\n             }\n         }\n     }\n }\n \n addOnloadHook( LinkFA );\n /** Collapsible tables *********************************************************\n  *\n  *  Description: Allows tables to be collapsed, showing only the header. See\n  *               Wikipedia:NavFrame.\n  */\n \n var autoCollapse = 2;\n var collapseCaption = hide;\n var expandCaption = show;\n \n function collapseTable( tableIndex )\n {\n     var Button = document.getElementById( collapseButton + tableIndex );\n     var Table = document.getElementById( collapsibleTable + tableIndex );\n \n     if ( !Table || !Button ) {\n         return false;\n     }\n \n     var Rows = Table.getElementsByTagName( tr ); \n \n     if ( Button.firstChild.data  collapseCaption ) {\n         for ( var i = 1; i < Rows.length; i++ ) {\n             Rows[i].style.display = none;\n         }\n         Button.firstChild.data = expandCaption;\n     } else {\n         for ( var i = 1; i < Rows.length; i++ ) {\n             Rows[i].style.display = Rows[0].style.display;\n         }\n         Button.firstChild.data = collapseCaption;\n     }\n }\n \n function createCollapseButtons()\n {\n     var tableIndex = 0;\n     var NavigationBoxes = new Object();\n     var Tables = document.getElementsByTagName( table );\n \n     for ( var i = 0; i < Tables.length; i++ ) {\n         if ( hasClass( Tables[i], collapsible ) ) {\n             NavigationBoxes[ tableIndex ] = Tables[i];\n             Tables[i].setAttribute( id, collapsibleTable + tableIndex );\n \n             var Button     = document.createElement( span );\n             var ButtonLink = document.createElement( a );\n             var ButtonText = document.createTextNode( collapseCaption );\n \n             Button.style.styleFloat = right;\n             Button.style.cssFloat = right;\n             Button.style.fontWeight = normal;\n             Button.style.textAlign = right;\n             Button.style.width = 6em;\n \n             ButtonLink.setAttribute( id, collapseButton + tableIndex );\n             ButtonLink.setAttribute( href, javascript:collapseTable( + tableIndex + ); );\n             ButtonLink.appendChild( ButtonText );\n \n             Button.appendChild( document.createTextNode( [ ) );\n             Button.appendChild( ButtonLink );\n             Button.appendChild( document.createTextNode( ] ) );\n \n             var Header = Tables[i].getElementsByTagName( tr )[0].getElementsByTagName( th )[0];\n             /* only add button and increment count if there is a header row to work with */\n             if (Header) {\n                 Header.insertBefore( Button, Header.childNodes[0] );\n                 tableIndex++;\n             }\n         }\n     }\n \n     for ( var i = 0;  i < tableIndex; i++ ) {\n         if ( hasClass( NavigationBoxes[i], collapsed ) || ( tableIndex >= autoCollapse && hasClass( NavigationBoxes[i], autocollapse ) ) ) {\n             collapseTable( i );\n         }\n     }\n }\n \n addOnloadHook( createCollapseButtons );\n /** Dynamic Navigation Bars (experimental) *************************************\n  *\n  *  Description: See Wikipedia:NavFrame.\n  *  Maintainers: UNMAINTAINED\n  */\n \n  // set up the words in your language\n  var NavigationBarHide = '[' + collapseCaption + ']';\n  var NavigationBarShow = '[' + expandCaption + ']';\n  \n  // set up max count of Navigation Bars on page,\n  // if there are more, all will be hidden\n  // NavigationBarShowDefault = 0; // all bars will be hidden\n  // NavigationBarShowDefault = 1; // on pages with more than 1 bar all bars will be hidden\n  var NavigationBarShowDefault = autoCollapse;\n  \n  \n  // shows and hides content and picture (if available) of navigation bars\n  // Parameters:\n  //     indexNavigationBar: the index of navigation bar to be toggled\n  function toggleNavigationBar(indexNavigationBar)\n  {\n     var NavToggle = document.getElementById(NavToggle + indexNavigationBar);\n     var NavFrame = document.getElementById(NavFrame + indexNavigationBar);\n  \n     if (!NavFrame || !NavToggle) {\n         return false;\n     }\n  \n     // if shown now\n     if (NavToggle.firstChild.data  NavigationBarHide) {\n         for (\n                 var NavChild = NavFrame.firstChild;\n                 NavChild != null;\n                 NavChild = NavChild.nextSibling\n             ) {\n             if ( hasClass( NavChild, 'NavPic' ) ) {\n                 NavChild.style.display = 'none';\n             }\n             if ( hasClass( NavChild, 'NavContent') ) {\n                 NavChild.style.display = 'none';\n             }\n         }\n     NavToggle.firstChild.data = NavigationBarShow;\n  \n     // if hidden now\n     } else if (NavToggle.firstChild.data  NavigationBarShow) {\n         for (\n                 var NavChild = NavFrame.firstChild;\n                 NavChild != null;\n                 NavChild = NavChild.nextSibling\n             ) {\n             if (hasClass(NavChild, 'NavPic')) {\n                 NavChild.style.display = 'block';\n             }\n             if (hasClass(NavChild, 'NavContent')) {\n                 NavChild.style.display = 'block';\n             }\n         }\n     NavToggle.firstChild.data = NavigationBarHide;\n     }\n  }\n  \n  // adds show/hide-button to navigation bars\n  function createNavigationBarToggleButton()\n  {\n     var indexNavigationBar = 0;\n     // iterate over all < div >-elements \n     var divs = document.getElementsByTagName(div);\n     for(\n             var i=0; \n             NavFrame = divs[i]; \n             i++\n         ) {\n         // if found a navigation bar\n         if (hasClass(NavFrame, NavFrame)) {\n  \n             indexNavigationBar++;\n             var NavToggle = document.createElement(a);\n             NavToggle.className = 'NavToggle';\n             NavToggle.setAttribute('id', 'NavToggle' + indexNavigationBar);\n             NavToggle.setAttribute('href', 'javascript:toggleNavigationBar(' + indexNavigationBar + ');');\n             \n             var NavToggleText = document.createTextNode(NavigationBarHide);\n             NavToggle.appendChild(NavToggleText);\n             // Find the NavHead and attach the toggle link (Must be this complicated because Moz's firstChild handling is borked)\n             for(\n               var j=0; \n               j < NavFrame.childNodes.length; \n               j++\n             ) {\n               if (hasClass(NavFrame.childNodes[j], NavHead)) {\n                 NavFrame.childNodes[j].appendChild(NavToggle);\n               }\n             }\n             NavFrame.setAttribute('id', 'NavFrame' + indexNavigationBar);\n         }\n     }\n     // if more Navigation Bars found than Default: hide all\n     if (NavigationBarShowDefault < indexNavigationBar) {\n         for(\n                 var i=1; \n                 i<=indexNavigationBar; \n                 i++\n         ) {\n             toggleNavigationBar(i);\n         }\n     }\n   \n  }\n  \n  addOnloadHook( createNavigationBarToggleButton );\n /** Main Page layout fixes *********************************************************\n  *\n  *  Description:        Various layout fixes for the main page, including an\n  *                      additional link to the complete list of languages available\n  *                      and the renaming of the 'Article' to to 'Main Page'.\n  */\n \n function mainPageRenameNamespaceTab() {\n     try {\n         var Node = document.getElementById( 'ca-nstab-main' ).firstChild;\n         if ( Node.textContent ) {      // Per DOM Level 3\n             Node.textContent = 'Main Page';\n         } else if ( Node.innerText ) { // IE doesn't handle .textContent\n             Node.innerText = 'Main Page';\n         } else {                       // Fallback\n             Node.replaceChild( Node.firstChild, document.createTextNode( 'Main Page' ) ); \n         }\n     } catch(e) {\n         // bailing out!\n     }\n }\n \n function mainPageAppendCompleteListLink() {\n     try {\n         var node = document.getElementById( p-lang )\n                            .getElementsByTagName('div')[0]\n                            .getElementsByTagName('ul')[0];\n \n         var aNode = document.createElement( 'a' );\n         var liNode = document.createElement( 'li' );\n \n         aNode.appendChild( document.createTextNode( 'Complete list' ) );\n         aNode.setAttribute( 'href' , 'http://meta.wikimedia.org/wiki/List_of_Wikipedias' );\n         liNode.appendChild( aNode );\n         liNode.className = 'interwiki-completelist';\n         node.appendChild( liNode );\n      } catch(e) {\n        // lets just ignore what's happened\n        return;\n     }\n }\n \n if ( wgTitle  'Main Page' && ( wgNamespaceNumber  0 || wgNamespaceNumber  1 ) ) {\n        addOnloadHook( mainPageRenameNamespaceTab );\n }\n \n if ( wgTitle  'Main Page' && wgNamespaceNumber  0 ) {\n        addOnloadHook( mainPageAppendCompleteListLink );\n }\n /** Extra toolbar options ****************************************************** */\n /** pageview counter ***********************************************************\n  *\n  *  Description: Please talk to de:User:LeonWeber before changing anything or \n  *               if there are any issues with that.\n  *  Maintainers: :de:User:LeonWeber?\n  */\n  \n  // this should be adjusted to a good value.\n  // BE CAREFUL, you will break zedler if it's too low!\n  // And then DaB. will kill Leon :-(\n  var disable_counter = 0;\n  var counter_factor = 6000;\n  \n  function pgcounter_setup()\n  {\n  \tif(disable_counter  0)\n  \t{\n  \t\tvar url = window.location.href;\n  \t\tif(Math.floor(Math.random()*counter_factor)42)  // the probability thing\n   \t\t{\n   \t\t\tif(wgIsArticletrue || wgArticleId0) // do not count history pages etc.\n  \t\t\t{\n  \t\t\t\tvar pgcountNs = wgCanonicalNamespace;\n  \t\t\t\tif(wgCanonicalNamespace)\n  \t\t\t\t{\n  \t\t\t\t\tpgcountNs = 0;\n  \t\t\t\t}\n   \t\t\t\tvar cnt_url = http://pgcount.wikimedia.de/index.png?ns= + pgcountNs + &title= + encodeURI(wgTitle) + &factor= + counter_factor +&wiki=enwiki;\n  \t\t\t\tvar img = new Image(); \n  \t\t\t\timg.src = cnt_url;\n  \t\t\t}\n  \t\t}\n  \t}\n  }\n  // Do not use aOnloadFunctions[aOnloadFunctions.length] = pgcounter_setup;, some browsers don't like that.\n  pgcounter_setup();\n /** Technical restrictions title fix *****************************************\n  *\n  *  Description:\n  */\n \n // For pages that have something like Template:Lowercase, replace the title, but only if it is cut-and-pasteable as a valid wikilink.\n //\t(for instance iPod's title is updated.  \n //\n // The function looks for a banner like this: An element with id=DisableRealTitle disables the function.\n var disableRealTitle = 0;\t\t// users can disable this by making this true from their monobook.js\n if (wgIsArticle) {\t\t\t// don't display the RealTitle when editing, since it is apparently inconsistent (doesn't show when editing sections, doesn't show when not previewing)\n     addOnloadHook(function() {\n \ttry {\n \t\tvar realTitleBanner = document.getElementById(RealTitleBanner);\n": {
        "id": 25,
        "processed": 1,
        "page_id": 5550,
        "text_id": 26353
    },
    " \t\tif (realTitleBanner && !document.getElementById(DisableRealTitle) && !disableRealTitle) {\n \t\t\tvar realTitle = document.getElementById(RealTitle);\n \t\t\tif (realTitle) {\n \t\t\t\tvar realTitleHTML = realTitle.innerHTML;\n \t\t\t\trealTitleText = pickUpText(realTitle);\n \n \t\t\t\tvar isPasteable = 0;\n \t\t\t\t//var containsHTML = /</.test(realTitleHTML);\t// contains ANY HTML\n \t\t\t\tvar containsTooMuchHTML = /</.test( realTitleHTML.replace(/<\\/?(sub|sup|small|big)>/gi, ) ); // contains HTML that will be ignored when cut-n-pasted as a wikilink\n \t\t\t\t// calculate whether the title is pasteable\n \t\t\t\tvar verifyTitle = realTitleText.replace(/^ +/, );\t\t// trim left spaces\n \t\t\t\tverifyTitle = verifyTitle.charAt(0).toUpperCase() + verifyTitle.substring(1, verifyTitle.length);\t// uppercase first character\n \n \t\t\t\t// if the namespace prefix is there, remove it on our verification copy.  If it isn't there, add it to the original realValue copy.\n \t\t\t\tif (wgNamespaceNumber != 0) {\n \t\t\t\t\tif (wgCanonicalNamespace  verifyTitle.substr(0, wgCanonicalNamespace.length).replace(/ /g, _) && verifyTitle.charAt(wgCanonicalNamespace.length)  :) {\n \t\t\t\t\t\tverifyTitle = verifyTitle.substr(wgCanonicalNamespace.length + 1);\n \t\t\t\t\t} else {\n \t\t\t\t\t\trealTitleText = wgCanonicalNamespace.replace(/_/g,  ) + : + realTitleText;\n \t\t\t\t\t\trealTitleHTML = wgCanonicalNamespace.replace(/_/g,  ) + : + realTitleHTML;\n \t\t\t\t\t}\n \t\t\t\t}\n \n \t\t\t\t// verify whether wgTitle matches\n \t\t\t\tverifyTitle = verifyTitle.replace(/^ +/, ).replace(/ +$/, );\t\t// trim left and right spaces\n \t\t\t\tverifyTitle = verifyTitle.replace(/_/g,  );\t\t// underscores to spaces\n \t\t\t\tverifyTitle = verifyTitle.charAt(0).toUpperCase() + verifyTitle.substring(1, verifyTitle.length);\t// uppercase first character\n \t\t\t\tisPasteable = (verifyTitle  wgTitle);\n \n \t\t\t\tvar h1 = document.getElementsByTagName(h1)[0];\n \t\t\t\tif (h1 && isPasteable) {\n \t\t\t\t\th1.innerHTML = containsTooMuchHTML ? realTitleText : realTitleHTML;\n \t\t\t\t\tif (!containsTooMuchHTML)\n \t\t\t\t\t\trealTitleBanner.style.display = none;\n \t\t\t\t}\n \t\t\t\tdocument.title = realTitleText +  - Wikipedia, the free encyclopedia;\n \t\t\t}\n \t\t}\n \t} catch (e) {\n \t\t/* Something went wrong. */\n \t}\n     });\n }\n \n \n // similar to innerHTML, but only returns the text portions of the insides, excludes HTML\n function pickUpText(aParentElement) {\n   var str = ;\n \n   function pickUpTextInternal(aElement) {\n     var child = aElement.firstChild;\n     while (child) {\n       if (child.nodeType  1)\t\t// ELEMENT_NODE \n         pickUpTextInternal(child);\n       else if (child.nodeType  3)\t// TEXT_NODE\n         str += child.nodeValue;\n \n       child = child.nextSibling;\n     }\n   }\n \n   pickUpTextInternal(aParentElement);\n \n   return str;\n }\n //fix edit summary prompt for undo\n //this code fixes the fact that the undo function combined with the no edit summary prompter causes problems if leaving the\n //edit summary unchanged\n addOnloadHook(function () {\n   if (document.location.search.indexOf(undo=) != -1\n   && document.getElementsByName('wpAutoSummary')[0]) {\n     document.getElementsByName('wpAutoSummary')[0].value=;\n   }\n })\n /** Add dismiss button to watchlist-message *************************************\n  *\n  *  Description:\n  */\n \n function addDismissButton() {\n    var watchlistMessage = document.getElementById(watchlist-message);\n    if ( watchlistMessage  null ) return;\n \n    if ( document.cookie.indexOf( hidewatchlistmessage=yes; ) != -1 ) {\n        watchlistMessage.style.display = none;\n    }\n \n    var Button     = document.createElement( span );\n    var ButtonLink = document.createElement( a );\n    var ButtonText = document.createTextNode( dismiss );\n \n    ButtonLink.setAttribute( id, dismissButton );\n    ButtonLink.setAttribute( href, javascript:dismissWatchlistMessage(); );\n    ButtonLink.appendChild( ButtonText );\n \n    Button.appendChild( document.createTextNode( [ ) );\n    Button.appendChild( ButtonLink );\n    Button.appendChild( document.createTextNode( ] ) );\n \n    watchlistMessage.appendChild( Button );\n }\n \n function dismissWatchlistMessage() {\n     document.cookie = hidewatchlistmessage=yes; + document.cookie;\n     var watchlistMessage = document.getElementById(watchlist-message);\n     watchlistMessage.style.display = none;\n }\n \n addOnloadHook( addDismissButton );\n": {
        "id": 26,
        "processed": 1,
        "page_id": 5550,
        "text_id": 26353
    }
}