{
    "Ko te reo Māori te reo o te tangata whenua o Aotearoa. Nā te ture anō i whakamana te reo Māori hei reo a te motu o Aotearoa. 160,000 ngā kaikōrero reo Māori i Aotearoa, e ai ki te tatauranga tangata o te motu i te tau 1996. Ko ngā takiwā kaha ki te mau i te reo hei reo hapori ko Te Tai-tokerau, ko Te Urewera, ko Te Tai-rāwhiti.\nHe reo o Porinīhia.\nKo te reo Māori nō te reo whānau o ngā iwi o Porinīhia ki te rāwhiti, arā he reo ka ahu mai nō te Moana-nui-a-Kiwa, me te aha, e ōrite ana te reo Māori ki te reo o Rarotonga, o Manihiki-Rakahanga, o Tahiti, ā, o ngā moutere Tuamotu anō hoki. He whanaunga āhua tawhiti anō ki te reo o Hawaii, o Nuku Hiva, o Rapa Nui me ētahi atu moutere o te Moana-nui-o-Kiwa. Ahakoa he nui atu i te kotahi mano tau i wehe mai i ērā o aua reo whanaunga, he tata tonu. I te taenga mai o Kāpene Kuki ki Aotearoa i te 1769, he rangatira nō Tahiti, ko Tupaea te ingoa, i runga i tana kaipuke. Ko te mahi a Tupaea, he kōrero tahi ki ngā Māori, i mārama rātou ki tana reo, kore rawa he raruraru; arā he kaiwhakamāori ia kia mōhio ai a Kuki ki ngā whakaaro o te Māori o taua wā. Mā te ripanga i raro iho nei e whakamārama ngā hononga i waenganui i ngā reo o Porinīhia:\nHe reo tapu, he reo whai mana.\nKi tō te Māori whakaaro, ko te reo Māori he reo tapu, he reo tuku iho nā ngā atua ki ngā tūpuna. He mana tō te reo, he ihi tō te reo, he tapu tō te reo. He wairua tō te reo, he mauri anō tō te reo. Mā te wairua ka rangona te reo, mā te mauri ka mana ai te reo. I kī mai ngā tūpuna, ko te reo rauriki te reo tapu o Ranginui rātou ko ngā atua; ko te reo reiuru e kōrerotia ake nei ko te reo tapu o Papatūānuku. Nā, ko te reo rauriki te reo hei kawe i te manawa tapu o ngā karakia, ā, ka whakauru atu ki roto i te tangata, kia pērā anō te mana o tana kupu i tō ngā atua ki tā rātou i whakahau mai ai i te rangi. Ko te reo reiuru, ko tōna kōrero ko te reo e taea ai e te tangata te kōrero, te mātau rānei ki ngā momo reo kē o Papatūānuku, arā te reo o ngā manu, o ngā ika, o ngā kararehe, o ngā rākau, o ngā uri katoa o Papatūānuku. Kia nei te reo wāhine hei whakaoho ake i te hunga wairua i runga anō i te tangi karanga ka whakapāoho ki runga i ngā marae. E kore e taea e te tangata te mau ki ēnei reo, mena kāhore noa e tapu pono ki ngā atua, ko te mea nui ko te reo tapu me ngā karakia tapu. Mā te reo ka manaakitia te tangata, ko taua reo anō ka kanga i te tangata; mā te reo ka piki te tangata ki ngā taumata whakahirahira, ko taua reo anō ka heke te tangata ki te pito kukume tonu o Whirotetupua. Nō reira, ko te reo tapu he tohu mana nō te tangata, he mana tūturu nō te atua, e kore e whakapōreareatia e te tangata kē (Barlow 1991:112).\n Reo-ā-iwi.\nHe rerekē te tangi me te mita o te reo o ia iwi, o ia iwi, o ia iwi; hei tauira, he rerekē te tangi mai o te reo o Waikato ki tērā o Te Wai-pounamu. Nā Te Manihera (R. Maunsell), te ātirīkona o Tāmaki Makaurau, i kōrerohia ngā reo-ā-iwi i roto i te tuawhā o ngā putanga o tana pukapuka Grammar of the New Zealand Language i te 1894. E ai ki Te Manihera, e whitu ngā reo-ā-iwi nō roto tonu i Te Ika-a-Māui. Nāna hoki te kōrero, he rerekētanga anō i roto tonu o aua reo e whitu. Mai i taua wā, nā ētahi atu tohunga wetereo e whakarerekēngia ai aua whakaaro; engari mā te ripanga nei e whakaatu ētahi o aua rerekētanga: \nWaimemehatanga.\nNō ngā tau whakatuwhera o te Rautau 19, ka tīmata te noho tahi a te Pākehā ki te Māori i Aotearoa nei. Nō te tau 1815, ka puta te pukapuka tuatahi i tāia ki te reo, He Korao o Niu Tireni nā Tāmati Kānara. Ko te whakamārama o te taitara o taua pukapuka, 'He kōrero o Aotearoa'. Nō muri ake, ka tāia e Koroneho, e Wiremu he pukapuka i roto i te reo. Ko tētahi pukapuka whaimana i tāia i taua wā ko te Paipera Tapu. He kaha hoki te Māori ki te tuhituhi kōrero i te reo. Ka taea hoki te kī, i taua wā, he pai ake ngā Māori i ngā Pākēhā ki te tuhituhi.\n \nKo te mea whakahinapōuri kē ki te ngākau Māori, ka tahuri ngā Pākehā ki te hāpai i te mana o tō rātou ake reo. Nō te tau 1867, i kī te ture mō ngā kura Māori, kia akongia ki te reo Ingarihi i ngā kura, kia kaua ngā tamariki e kōrero i te Reo i roto i ngā kura. Ka tīmata i konei te waimemehatanga o te reo rangatira, nā te mea ki te kōrero Māori ngā tamariki i roto i ngā kura ka patua e ngā kaiako Pākehā. He raruraru nui tērā. Koia rā i mataku ai rātou ki te kōrero i te reo, ka tahuri kē ki te reo Pākehā. Ka mōhio mai tātou, ki te kore e kōrero i te reo i roto i ngā tū āhua mahi katoa a te iwi, ia rā, ia rā, ka hohoro te ngaro, ka mate hoki te reo. Ko te mea tika me kōrero tonu te reo i ngā wā katoa, i roto i ngā karakia, i ngā wāhi mahi, i ngā toa hokohoko, i ngā wheketere, i ngā wāhi tākaro, i ngā kura; nō reira, mā ēnei whakaritenga ka tupu kaha te reo - kia kaua e ngaro. Nā reira, itiiti noa iho ngā wāhi kōrero i te reo Māori; ki ngā marae, me ētahi kura, hāhi, me ngā kohanga reo... Ahakoa, e kaha ana te Māori ki te whakamana i te reo hei reo tūturu mō ngā tāngata o tō tātou motu. E kore pea e taea kia noho ia hei reo mō ētahi taikanga motuhake i roto i te iwi, pēnei i te reo mihi i runga i ngā marae, hei reo kōrero hoki mō ētahi o ngā whānau. Ko te tumanako kia hāpaitia tonutia te reo kia kore e ngaro, engari kia pūāwai i runga i ngā tikanga o te Tiriti o Waitangi, kia whakapuare huarahi kia noho pūmau tonu te reo hei taonga whakahirahira mō ake tonu atu (Barlow 1991:113).\nI whakatūhia Te Rōpū Whakamana i Te Tiriti o Waitangi i te marama o Whiringa-a-nuku, 1975. I puta te rangahau mō te āhuatanga o te reo Māori 1973-78 a te Kaunihera Rangahau Mātauranga o Aotearoa (NZCER) e kī ana 18-20 ōrau anake o te iwi Māori e matatau ana ki te kōrero i te reo Māori, ā, i kī anō hoki kei te noho tino mōrearea te reo Māori. I te tau 1986 i rongohia e te Rōpū Whakamana i Te Tiriti o Waitangi te kereme mō Te Reo Māori. Nā tēnei i tū ai Te Taura Whiri i te Reo Māori i te tau 1987. Nā te mahi rangahau a te motu 1995, e pā ana ki te āhua o te reo, i whakapūmau ngā kitenga a tērā o ngā rangahau ki mua, me te tohu mai ahakoa e kōrerotia ana te reo Māori e te 59 ōrau o ngā pakeke Māori, e kitea ana ko te tokomaha (83 ōrau) o rātou he paku noa iho te matau mō te kōrero, ko ētahi kāre i paku kōrero i te reo Māori. E 8 ōrau anake o ngā pakeke Māori e tino matatau ana ki te reo Māori, ā, 33 ōrau o rātou, 60 tau te pakeke - neke atu rānei.\nTe Taura Whiri i te Reo Māori.\nI te tau 1986, i mauria atu he kerēme ki te Rōpū Whakamana i Te Tiriti o Waitangi, ko te kerēme mō te reo Māori. Kātahi te ture mo te Reo Māori ka pahure hei Reo atoato i Aotearoa. I taua wā tonu, ka tū Te Taura Whiri i te Reo Māori hei Tari Kawana hei whanaketanga hei tautoko hoki i te Reo, i runga i te whakaaro i tukuna kētia te kerēme mo Te Reo Māori ki te Rōpū Whakamana. Ka whakamanahia-ā-ture te Ture Reo Māori i te Here-turi-kōkā o 1987. E toru ōna kaupapa:\nKei ngā kōti, kei ngā Kōmihana uiui me ngā Taraipiunara, e whakatau ake ana tēnei ture i te whakaae kia kōrero Māori i te kōti ahakoa mema kōti rānei, ko wai ake rānei o te kōti, kaituku kōrero, kaiāwhina rānei.\nKa tū rā hoki i a ia Te Taura Whiri i te Reo Māori. Ko tā Te Taura Whiri he whakatairanga i te reo Māori me ngā kaupapa reo; he hikihiki taumata mō te tuhituhi me te kōrero i te reo, arā mā te ara rūmaki, mā te whakamātautau reo, mā te niureta ia toru marama e kīa nei He Muka, ā, me ngā kōrero tautoko mai anō hoki a te hunga mahi kāwanatanga; he whakamana-ā-ture i ngā whakamātautau o te hunga e whai nei i te mahi whakamāori-ā-tuhi, ā-waha rānei; he rangahau huarahi e whakatairangatia ai, e hāpai tonutia ai te ahu whakamua o te reo; te hanga papa kupu. Kia ono anō ngā hui o Te Taura Whiri i ia tau. He tumuākī tō te hunga mahi, ka mutu ko ngā mahi he rangahau, he ārahi ture, he whakahoki tirohanga i ngā mahi whakamāori, he whakatairanga, me ērā atu mahi e homai e ngā Kaiwhiri. Whakapā mai i konei ka whiti rānei ki te wāhi whakahoki kōrero hei tuku kōrero mai rā.\nTe Wiki o te Reo Māori.\nKo Te Wiki o te Reo Māori he kaupapa o Te Taura Whiri i te Reo Māori kia whakatairangatia te whakamahia o te reo MāoriI tīmata te Wiki o te Reo Māori i te tau 1975. I te tīmatanga i whakatūhia he rā hei whakanui i te reo Māori. Ko te 14 o Mahuru 1972 te rā i whakatakotohia ki mua o te aroaro o te Pāremata te petihana mō te Reo Māori e mau ana i ngā waitohu 30,000. Nō te tau 1973 ka huri te rā hei wiki whakanui i te reo. I muri mai i tēnei ka nekehia e te Tāhuhu Mātauranga ki te marama o Hōngongoi kia hāngai ki te wāhanga kura o taua tau, ā, kei te mau tonu ki taua marama. \nKīwaha.\nKo ngā kīwaha he momo kōrero e whakaahua ana i ngā āhuatanga o ia rā, o ia rā, ā, me uaua ka kitea te tikanga tūturu i te papakupu, i te pukapuka wetereo rānei. Ki te whāia he tikanga ake o tēnā, o tēnā kupu, kāore tonu e kitea he māramatanga, i te mea kei tua kē te aronga o te kōrero. Nā Te Taura Whiri i Te Reo ēnei whakamārama:\nAutaia (tonu) - whakamahia ai tēnei kupu hei whakaatu i te pai (autaia), i te āhua pai rānei (autaia tonu) o tētahi mea. Tērā pea e hāngai ana ki te tangata (autaia koe), ki te mahi rānei a te tangata, ki tētahi atu āhuatanga rānei.\nEngari tonu - he momo whakamihi tēnei i te tangata, i tāna mahi, i tētahi kaupapa rānei, ā, e āhua whakaatu ana anō hoki i te mīharo o te kaikōrero ki tētahi tūāhua. Arā te kīwaha e āhau rite ana ki tēnei, ko te 'koia kei a koe'. Engari he wā anō tōna e whakahē ana i te kōrero a tētahi atu mēnā he rerenga whakakāhore taua kōrero, he wā anō e whakaū ana, e whakaae ana ki te kōrero a tētahi atu mēnā ehara i te rerenga whakakāhore. I ōna wā anō e tohu ana tēnei kīwaha i mōhio tonu te kaikōrero ka puta tētahi āhuatanga.\nHe aha hoki!  - whakamahia ai tēnei kīwaha hei whakautu i tētahi atu kōrero, ā, he momo whakakāhore i taua kōrero rā i runga i te wairua whakaiti, whakatakē, whakangahau rānei. Tērā pea e hāngai ana ki te tangata nāna tonu te kōrero, tērā rānei e hāngai ana ki tētahi atu.\nHe aha te aha  - ka noho mai tēnei kīwaha ki te wāhanga whakamutunga o tētahi rerenga. E tohu ana i te kore whaihua, i te moumou taima noa iho rānei o tētahi āhuatanga e whakaahuatia ana i te wāhanga tuatahi o te kōrero.\nHei aha (noa iho) - ko tētahi tikanga o tēnei kīwaha, ko te 'kāore he take o te māharahara', pērā tonu i te 'aua atu'. Ko tētahi atu tikanga o te 'hei aha noa iho' e whakaatu ana i te whakapono o te kaikōrero kāore he take o te whai i tētahi mahi, i tētahi āhuatanga rānei.\nKei runga noa atu koe - he momo whakanui tēnei i te tangata, mōna i mahi i tētahi mahi pai. Me uaua ka rangona e whakamahia ana e te tangata mōna anō, engari arā pea ētahi wā ruarua ka taea. He wā anō ka taea te whakamahi hei whakaahua i te pai o tētahi atu mea, pērā i tētahi kaupapa.\nKoia kei (a koe) - ko tā tēnei kīwaha, he whakaatu tahi i te tautoko me te āhua mīharo o te kaikōrero ki te whakaaro, ki te mahi rānei a tētahi atu. Engari i tōna wā anō, ko tā tēnei kīwaha he whakahē i te kōrero, i te mahi rānei a tētahi tangata, me te tohu anō hoki he wā ka taka, ka kai taua tangata i ana hamuti, arā, ka hoki mai ngā hua kino o tāna mahi ki runga ki a ia. \n(Ka/he/te) tau kē (hoki)! - he whakamihi anō tēnei i te pai o te tangata, o tētahi mahi, o tētahi atu āhuatanga rānei. Mehemea ko te 'tau' te kupu tuatahi, me mātua noho mai te kupu 'kē' hei hoa mōna. I ētahi atu whakamahinga, kei a koe te tikanga ina raua atu te 'kē', kāore rānei.\nPiki, heke - ko tētahi tikanga o tēnei kīwaha, ko te 'kāore he take o te māharahara'; ko tā te tangata mahi mai rā anō, he kimi huarahi māna e tutuki ana tino kaupapa arā noa iho ngā āhuatanga o te wā. \nTe mutunga (kē) mai (nei) o te ... - whakamahia ai tēnei kōrero hei whakakaha ake i tētahi whakaaro, tae atu ki ngā whakaaro whakamihi i te tangata, i tētahi atu āhuatanga rānei, pērā i 'te mutunga mai o te pai'.\nTirohia hoki.\nHoto ki waho  .\nTohutoro.\n": {
        "id": 1,
        "processed": 1,
        "page_id": 585,
        "text_id": 74562
    },
    "He whenua, he kāhui moutere a Aotearoa i Te Moana-nui-a-Kiwa. Ko ngā moutere matua ko Te Ika-a-Māui ki te raki, ko Te Wai-pounamu, arā Te Waka-a-Māui ki waenganui, me Rakiura ki te tonga. Ko ngā whenua o roto o te Kīngitanga o Aotearoa ko ngā whenua moutere nei ko ngā Kuki Airani, ko Niue; he kāwanatanga ake o aua whenua, engari ka mau tonu he pānga wātea ki Aotearoa; ko Tokelau, me ngā wāhi kerēmetia rā o Antarctica ki ngā tahatai o te Moana o Ross. Ko Aotearoa he rōpū moutere e tū mokemoke ana, e roa rawa te tawhiti ki whenua kē.  E 2000 kiromita te tawhiti ki Ahitireiria, ko Te Tai-o-Rehua te moana wehe i aua whenua e rua.  Ko ngā whenua e tū tata ana ki te raki ko Niu Karatonia, ko Whiti, ko Te Moutere Nōpoke, ko Tonga. Nō te tau kotahi mano iwa rau mā whitu (1907), ka whakatūria a Aotearoa hei whenua āhua tū wehe. \n Ngā Ingoa.\nKo Aotearoa te ingoa Māori o nāianei mō te motu. Engari i tērā atu rautau, ko 'Aotearoa' tētahi o ngā ingoa mo Te Ika-a-Māui anakē. Koiarā i kī ai ngā tūpuna, 'ki a tātou ngā iwi o Aotearoa me te Wai-pounamu'. Nō ngā tau whakatūwhera o tērā rautau, arā nō te wā i mua i te Pakanga Tuatahi o te Ao, ka hurihia hei ingoa mō te motu katoa. Ko tētahi ingoa kāhore i te tino whakamahia i tēnei wā, ko Niu Tīreni, arā te whakamāoritanga o New Zealand. Ki ētahi, ko Nū Tīrani kē. Ko Aotearoa te ingoa e rangona whānuitia ana i tēnei wā.\n Ngā Reo.\nE toru ngā reo a te motu o Aotearoa: ko te reo Māori, ko te reo Pākehā, ko te NZSL.  Engari he nunui ngā reo e kōrerotia ana e ngā tāngata maha o Aotearoa nei. Hei tauira, ko te reo Hāmoa me te reo Rarotonga.\n Tirohia hoki.\n Hoto ki waho.\n": {
        "id": 2,
        "processed": 1,
        "page_id": 665,
        "text_id": 81648
    },
    "Ko Ūropi tētahi o ngā whenua rahi tuku iho e whetu o te Ao. Pērā i ngā whenua rahi katoa, he rerekē tōna rohe mēnā ka kōrerotia ā-tikangatia, ā-torangapūtia, ā-aha rānei. Heoti, e ai ki te nuinga ka toha a Ūropi mai te Moana Tiri ki te raki, ki te Moana Ranatiki ki te hauāuru, ki te Moana Rōwhenua ki te tonga, ki te tonga rāwhiti ki ngā Maunga Kaukas me te Moana Mangu, ā, ka wehuriatia i a Āhia e ngā Maunga Ural, e te Awa Ural me te Moana Kaspia ki te rāwhiti.\nAtu i tēnei whakamāramatanga auau, ki ētahi atu he wāhanga a Ūropi o Eurāhia (koi hauāuru), o Eurawherāhia rānei. E tapaina hokia ana i ētahi wā ko te 'whenua rahi tawhito' (te 'ao tawhito' rānei), hei aronga kē mō te 'Ao Hou', arā, ngā Amerika. \nE ai ki tōna rahinga whenua ko Ūropi te whenua rahi iti rawa tuarua o te Ao, me ōna km² 10,180,000, arā, 2% o te mata o te Ao. Engari, koia te mea nui rawa ruatoru e ai ki tōna taupori (whai muri mai i a Āhia me Āwherika), me ōna kainoho e 710,000,000, 11% rānei o ngā tāngata o te Ao. Ko Ruhia tōna whenua nui rawa ā-rahinga, ā-taupori hoki, ā, ko te Tāone Vatikano te mea iti rawa. \nKo Ūropi te wāhi whānau o te tikanga Hauāuru. He tūnga whakaawe ō ngā whenua o Ūropi mai te rautau 16; tae noa atu ki ngā rautau 17, 18 hoki i raro iho te nuinga o Āwherika, ngā Amerika me Āhia i te maru o ngā whenua o Ūropi. I timu haere tō Ūropi mana maru o runga o ngā take aohuri a muri i ngā Pakanga o te Ao e rua, kia riro ai i ngā Wehe Whakakotahi me te Kotahitanga Soviet. Nā te Pakanga Mātao i waenganui i ēnei whenua e rua a Ūropi e weheruatia ki ia taha o te Ārai Rino. Ka puta te Kaunihera o Ūropi me te Kotahitanga Ūropi i te kōmitimiti ki te hauāuru, ahakoa kei te whakawhānui whakaterāwhiti nō te hinganga o te Kotahitanga Sovet i te tau 1991. \n Mātai Whenua Torangapū.\n \n \n Hoto ki waho.\n": {
        "id": 3,
        "processed": 1,
        "page_id": 1570,
        "text_id": 82087
    },
    "Ko Hāmoa he whenua i te Moana-nui-a-Kiwa. He Porinīhia nga tangata. Ko te reo Hāmoa (reo Hamoa gagana Samoa) te reo o nga tangata whenua. I te tau 2009, e 179,000 nga tangata e noho i roto o te whenua katoa. He tekau nga motu, ko Savai'i me Upolu nga motu nui. Ko Apia te tāone nui, e tu i Upolu, anō, te papa rererangi nui ko Fale'olo International Airport.\nI te tau 1962, na tutahi ai Hāmoa mai Aotearoa.\nHe tino nui nga tangata Hāmoa e noho i nāianei ki waho o ratou motu. I te tau 2001, he 115,000 i roto o Aotearoa,  me he nui hoki ngā Hāmoa ki Hononga-o-Amerika, Hawai'i me Ahitereiria.\nKo Silisili te maunga teitei rawa o Hāmoa, e tu ki te motu o Savai'i. E 1,858 mita te teitei.\n Ngā wā ō mua.\nKāore e tino mōhiotia te wā i tae atu ai ngā tāngata Porinīhia ki Hāmoa. Engari, ki nga whakatewhatewha o nga kaipūtaiao Pakeha i Hāmoa, he whakapono ratou, na tatūngia nga tangata i nga motu, mai ano 3,000 tau. Ko Te Rangi Hīroa tētahi kaituhi na haere i Hāmoa mo tona mahi me ka tuhituhi e ia te pukapuka Samoa Material Culture.\nAnō, ko Robert Louis Stevenson tētahi kaituhi na noho i Hāmoa ma tōna whānau ki te kāinga o Vailima. Ko te wā o tana matenga ki Hāmoa ko te tau 1894 me he nehua ia ki te maunga o Vaea ki Upolu. \n Ngā motu.\nHe 10 ngā motu o Hāmoa, ngā ahi tipua katoa. E whā ngā motu e tu ai nga kāinga, ko Upolu, Savai'i, Manono me Apolima. Kāore e tu ngā kāinga ki motu iti'iti, ko Nu'utele, Nu'ulua, Namua, Fanuatapu, Nu'ulopa me Nu'usafe'e.\n \nKo Savai'i te motu nui rawa atu i te whenua katoa. E ai ki te whakataukī o reira, ko Savai'i 'te wairua o Hāmoa'. 43,103 (2006) ngā tāngata e noho ana i reira. Ehara i te tino nui ngā tāone i Savai'i; he kāinga rīriki noa iho te nuinga. Kei Upolu, he motu anō, ngā tāone nunui. E rua herenga kaipuke i Savai'i, ko Salelologa te tāone nui o te motu me Asau tētehi.\nI Savai'i hoki ngētehi wāhi nō nehe noa atu: koia hoki te puke o Pulemele'i, ngā pehu wai tai o Taga (ko Alofa'aga tētahi ingoa), me te Tapuae o Moso. E rua tekau maero atu a Falealupo i te Rārangi Huringa Wā o te Ao, ā, koia te kāinga hauāuru rawa atu i Hāmoa. Kei roto i ngā pukapuka o Pākehā, i ngā tau tīmata o tērā atu rautau, i ngētehi wā i karangahia rā te motu ko Pola. Ko Matavanu he maunga ahi tipua anō hoki i runga i a Savai'i, i hū i nga tau 1905 - 1911, ā, ka puta mai te rangitoto, ka rere iho i te tihi o te maunga.\nE tu ngā wāpu ki Mulifanua i Upolu me Salelologa ki Savai'i mo ngā waka tere ki waenganui o Savai'i me Upolu. \n Takiwā tōrangapū.\nHe 11 nga takiwā tōrangapū o Hāmoa; he 6 ki Savai'i me 5 ki Upolu me nga motu iti ētahi atu.\nNga takiwā tōrangapū e 6 kei te raki o Savai'i ko Fa'asaleleaga, Gaga'emauga, Gaga'ifomauga, Palauli, Satupa'itea me Vaisigano.\nNga takiwā tōrangapū e 5 kei te raki o Upolu ko A'ana, Aiga i le Tai, Atua, Tuamasaga me Va'a o Fonoti. Te takiwā o Aiga i le Tai tae ana nga motu o Manono, Apolima me Nu'ulopa. \nE rua nga papakainga no Savai'i e tu i Upolu, ko Samalae'ulu me Le'ava'a. Nga papakainga e rua ēnei kua whakamōtī i te hūnga o te ahi tipua, te maunga Matavanu ki Savai'i.\n Reo Hāmoa.\nKo te reo Hāmoa nō te reo whānau o ngā iwi o Porinīhia, arā he reo ka ahu mai nō te Moana-nui-a-Kiwa, me te aha, e ōrite ana te reo Hāmoa ki te reo o Māori, o Tonga, ā, o ngā moutere Porinīhia anō hoki. Ko te mihinare George Pratt (1817-1894) ka tuhituhi te tikinare mataati o Hāmoa i te tau 1862.\nE 40 tau i noho ai Pratt ki Savai'i.\n \n Whakaahua.\n \n Tohutoro.\n": {
        "id": 4,
        "processed": 1,
        "page_id": 3645,
        "text_id": 82156
    },
    "Ko te Hāhi Tika o Ihu (Reo Pākehā: True Jesus Church) he hāhi tū wehe i whakatūria i Peihinga, Haina i te 1917. Ināianei, kua tae ki te 1.5 miriona ngā mema i ngā whenua whā tekau. I puta mai te hāhi hei rerenga hainamana o ngā hāhi e kīa nei he hāhi petekoha. Ka puta mai aua tūmomo hāhi i ngā tau whakatuwhera o tērā rautau. Ka whakahē te hāhi ki te tikanga o te tokotoru tapu; ka piri kē ki te whakaakoranga o te Ingoa o Ihu. Nō te 1990, ka poua te hāhi i Aotearoa e ngā tāngata manene i tau mai i Taiwana, he whenua i Āhia ki te rāwhiti. Kāhore e whakanuia e ngā mema o te hāhi ngā rā o te kirihimete, o te aranga rānei, i tō rātou whakaaro he rā mohoao ērā.\nNga Whakapono o te Hāhi:\n Ko te iriiritanga ki te wai te hākarameta hei muru i ngā hara, hei whakaora anō i te tangata. Ka iriiria te tangata i roto i te wai ora, wai tūturu pēnei i te awa, te moana, te puna rānei. Ka whakahaeretia te iriiritanga e tētahi Kaiiriiri kua iriiri kētia ki te wai, kua whiwhi kē i te Wairua Tapu, i runga anō i te ingoa o te Ariki Ihu Karaiti. Me rumaki katoa te kaiwhiwhi iriiritanga ki te wai, me te tupou, te anga whakararo hoki, o tōna māhunga.\n Mā te hakarameta o te horoi wae ka whai wāhi ai te tangata ki a Ihu Te Ariki. Hei whakamaumahara tonu rā ia me whiwhi e te tangata te aroha, te tapu, te whakaiti, te murunga hara, me te tūmautanga. Ko ia ka iriiritia ki te wai, kia horoia ōna wae ki te ingoa o Ihu Karaiti. Me whai ngā tikanga o te wā me te wāhi te horoia o ngā wae o tētahi e tōna hoa, me ō tōna hoa e ia. \n Ko te Kai Hapa he hakarameta hei whakanui i te matenga o Te Ariki Ihu Karaiti. Mā reira tātou ka kai ai i te kikokiko me te toto o tō tātou Ariki, ka noho pātata ai ki a Ia kia whai oranga mutungakore ai tātou, kia ara ake ai tātou i te Rā Whakamutunga. Me tū taua hakarameta nei I ngā wā ka taea. Kia kotahi te parāoa rēwena-kore, me te inu kerepi. \n Ko te Hāpati, te rā tuawhitu o te wiki (Rāhoroi) he Rā Tapu, nā Te Atua i whakatapu, nāna i whakapai. He mea whai i raro i te tohu aroha o Te Ariki, hei whakamaumaharatanga i te orokohanganga me te whakaoratanga a Te Atua, ā, ki te tūmanako hoki o te whakangā mutungakore o te ao kei te haere mai.\n Ko te kupu ko Ihu Karaiti nāna i whakakikokiko a tinana, nāna tonu i mate rīpeka kia murua ai ngā hara o te hunga mau a hara, nō te rā tuatoru, nāna hoki i whakaora ai, i whakairia ki te rangi tūhāhā. Koia anake te ōranga o te ira tangata, te kaihanga o te rangi me te whenua, te atua tupono o ngā atua katoa.\n Ko Te Paipera Tapu, arā Te Kawenata Tawhito me Te Kawenata Hōu, he ranga wairua nā Te Atua. Ko ia anake te pono ā-karaipiture, kei a ia anake ngā ritenga mō te ao Karaitiana.\n Ma te whakapono ki a Te Atua, ka tukuna mai e ia te aroha me te whakaoranga. Me whirinaki atu nga tangata whakapono ki te wairua tapu ki te whai i te tapuranga, ki te whakahonore i a Te Atua, me te aroha ki te tangata.\n Ko Te Rā Whakamutunga, ko te Hokinga Tuaruatanga o Te Atua ina heke mai ia i te rangi ki te wharite, whakawā i ngā iwi katoa; ka whakawhiwhia te hunga tika ki te oranga tonutanga, ka peia te hunga kino mō ake, ake, ake.\n Hoto ki waho.\n": {
        "id": 7,
        "processed": 1,
        "page_id": 5751,
        "text_id": 81807
    },
    "Ko Porinīhia Wīwī he whakaminenga o nga kahui moutere e rima kei te putahi o te Moananui a Kiwa kei nga pae 7° ki 27° S me nga pae 134° me 155° W.\n1,544 sq maero (4,000 sq km) te takiwa, 258,000 nga tangata noho, 130 nga motu a kua 5 nga kahui moutere ara ko te kahui o Tahiti (Society), ko te kahui o Tuamotu, ko te kahui o Mangareva (Gambier), Ko te kahui o Enana (Marquesas), ko te kahui o Tubuai.\nKo Tahitinui te motu nunui o te whakaminemnga nei a kei reira hoki te taone matua a Papaete. \n Nga Kahui Moutere.\n130 nga motu, kua 5 nga kahui moutere i whakamaua e Wīwī a kua tapiana ko Poronihia Wīwī.\n \n Ko te Kāhui o Tuamotu mai i Tahiti ka rere ki te rawhiti ka tae ki Tuamotu e 80 nga moutere nei 280 maero te takiwa. Ko Rangiroa te motu nui o tenei kahui 29 maero tona rahi. Kei te kahui o Tuamotu nga motu a Mururoa me  Fangataufa, nga mea i tukinotia e te pahu karihi o Wīwī. \n Ko te Kāhui o Tubuai (Australs) e 450 maero ki te tonga o Tahiti kua takoto nei a Tubuai 57 maero te takiwa e 4 nga motu noho tangata ko Rapa te mea noho mamao, a ko Marotiri me Maria nga motu kore tangata\n Nga Tangata.\nHe Tangata maori katoa nga tangata o nga Kahui moutere nei engari kia mohio pai ki a ratou me o ratou ake korero me titiro kia te hononga mo ia Kahui Moutere\n Korero Tupuna (Hitori).\nKei ia kahui moutere to ratou ake whakapapa me to ratou ake korero Tupuna. \nNa reira kua tuhia ki raro nei nga hitori mai i te taenga mai o Pakeha tae noa ki naianei\nI te rautau 1500 tokomaha ake nga tangata o nga moutere nei.  He kahui ariki nga mea tu ana ki  Tahiti, ki Bora-Bora, me Raiatea. Ko Teriaroa, ki te raki o Tahiti, te nohoanga ariki, a ko Taputapuatea, ki Raiatea, te marae tapu rawa o te Moananui a Kiwa. \nI te tau 1521 i kitea e Ferdinand Magellan i a Pukapuka i Tuamotu. I 1595 i kitea s Enua Enata, i kite ai a Makatea, Bora-Bora me Maupiti e Jacob Roggeveen ite tau 1722 a na Captain Samuel Wallis i kite i a Tahiti, Moorea, me Maiao Iti i 1767. \nI 1769 i haramai a Captain James Cook kia matataki i te rere o Kopu ki te rangi a i tapina te Kahui motu nei ko The Society Islands hei mihi ki the Royal Society nga mea i tautoko ai i tona tira. I kite ai a Tubuai e Cook i 1777. \nI te tau 1834 i haere mai nga mihinare no Wīwī ki Mangareva, a kua riro ki Wīwī i 1881. I haramai nga mihinare mai i Tahiti ki Tubuai. Engari i te tau i tono a Rimatara me Rurutu ki nga Ingarihi kia tu hei hoa mana engari i riro ano ki Wīwī i te tau 1900. \nKo Tuamotu he mea kei raro i te mana ariki o Pomare ariki o Tahiti, i riro ake enei me Tahiti i te tau 1847.\nKei te Kahui o Enua Enana (Marquesas), ko Nuku Hiva he mea riro tuatahi ki Amerika i te tau 1813 engari ka u mai tetehi manuao no Wīwī na te karanga o te ariki o Tahuata. Engari ka tautohe ratou me nga Wīwī, ka riri. Kua riro ki Wīwī ano te moutere ra i te tau 1842\n Te Whenua Wīwī.\nKua whakahaere nga kahui moutere nei hei taiwhenua o Wīwī.\nI 1885 kua tu he kawana no Wīwī me tethi kaunihere mo nga moutere. Engari kua riro ano te mana o tenei kaunihere i te tau 1899, a i 1903 kua korengia te mana o taua roopu.\nI 1940 tokomaha nga tangata maohi i uru ki te pakanga nui i Uropi ara WWII.\nI te tau 1946 i tapina ko Poronihia Wīwī he taiwhenua tawahi o Wīwī, ara kua tu he paremata taiwhenua a ka taea e ratou te tuku i tetehi tangata noa hei mangai mo ratou ki te Paremata nui ki Wīwī. I 1957 i whanuitia te mana o te paremata taiwhenua. \n Tahiti mo Tahiti.\nHei ahakoa te maunga o Wīwī i nga Kahui moutere nei ka whawhai tonu nga tangata maohi ra kia tu rangatira ano ratou.\nI te tau 1947 i tu rangatira ano ko Pouvanaa Tetuaapua Oopa me nga tangata karawhiu i te whakapehi o Wīwī. Kua aukatihia tetehi kaipuke no Wīwī. Kua mauheretia e te pirihimana engari i te tau 1949 i tautokohia te tangata hei mema o te paremata taiwhenua, a, i te tau 1951 ko tona roopu te mea nui o taua paremata taiwhenua a ko Pouvanaa Oopa te tumuaki tuarua. \nKo te kaupapa nui o Pouvanaa me ona hoa tautoko ko Tahiti mo Tahiti ara Tahiti for the Tahitians ... Vote NO so that the enslaving yoke will be quickly removed from around our necks'\nI mauheretia ano Pouvanaa Tetuaapua Oopa nei a kua tapaina tona roopu tautoko he mea ture-kore e te paremata nui ki Wīwī. E waru tau tona noho ki te whareherehere katahi ka panaia e te Wīwī kia noho kiritai\nI 1963 i timata ke nga Wīwī ki te whakapahu karihi ki  Mururoa. I 1975 i nekehia te whakapahupahu nei ki Fangataufa. Ka tu nga tangata maohi me etehi o nga tangata o te ao kia aukati te mahi tukino nei.\nI te tau 1975 i tu rangatira ano a Oscar Temaru me tona roopu torangapu a Tavini Huiraatira, e toru noa o ratou karanga ki tu rangatira te whenua o Tahiti ra, kia aukati te pahu o te pahu karihi o Wīwī, me te tohatoha pai i nga hua o te whenua. \n Te Raru o te Paremata.\nI te tau 2004 ka tu tautohe ano nga tangata na te nui o nga utu mo nga hua o te whenua me nga take pera. I te 15 o Pipiri 2004 i potihia a Oscar Temaru hei Tumuaki o Poronihia Wīwī, kua hinga ke te Tumuaki o mua ko Gaston Flosse. \nEngari ka kore e whakaae e te paremata (poti 27-28), a na Gaston Flosse i tono ki te Paremata matua ki Wīwī kia whakahaere tetehi poti hou mona.\nI tautokohia ano a Oscar Temaru i te tau 2006 kia tu hei pirihitane. Engari i te 13 o Hakihea 2006 kua whakakorengia ano e te paremata taiwhenua a kua pana.\nKua tu a Gaston Tong Sang hei Pirihitane i te 26 Hakihea 2006, engari i pana ano e te Paremata i te 31 o Hereturikoka 2007. Ka poti ano nga tangata o Poronihia Wīwī a te 10 Mahuru 2007\n": {
        "id": 8,
        "processed": 1,
        "page_id": 10980,
        "text_id": 80990
    },
    "Ko Taputapuatea te marae tino tapu rawa o te Moananui-a-kiwa e tu ana ki te papa whenua o Opoa ki te paerangi o Rangiātea (Ra'iatea).\nKo te marae tuatahi o konei ko Vai-otaha, no te 1200 pea ka whakawhanauihia, ka hanga te marae nui nei a Taputapuatea. E ai ki etehi na Kainuku Ariki me ona taina a Mahuta me Paea i kawekawe mai i nga papakohatu mai i Aitutaki me era o nga moutere kia hanga ai te tuahu o tenei marae nui e tu ana i te tahatai e ahu ana ki Avamo'a me te Moananui a Kiwa. \n Marae ātea.\nHe maha nga tahua paekiri, nga tuahu me era atu mea hanga kohatu ki Taputapuatea nei. Ko Taputapuatea me tona ahu te mea nuinui engari kei te taha e tu ana ko Havini. te marae o Tamatoa arii, me era atu o nga piringa marae. \nHei ahakoa ka whakaahua i raro nei te ahua o te Marae nui o Taputapuatea hei tauira.\nKo te ahua o te marae nui nei he tahua paekiri kua horangia ki te papakohatu. Kei tetehi pito e tu ana te tuahu me te ofai ti'a (he kohatu tapua rawa). 140 putu pea te roanga o te paepae i mua i te ahu, kua 10 putu pea te teitei o nga papakohatu kua titia kia tu hei paepae mo nga atua me nga ariki. Kua piri ano ki te paepae etehi papa whakairo e kia nei he unu\n Te Korero o te Marae nei.\nKo wai ka mohio inahea i hanga tuatahi mai te Marae Taputapuatea, i whakatapua ano. \nKua tawhito rawa te marae nei i nga rautau 1200, koina ko tenei wahi tetehi o nga kohanga o tatou nga uri o Hawaiki huri noa.\nKo te tikanga ko Taputapuatea te wahi i whakaminemine ai ngā tohunga me ngā whakatere waka kia whakatau i te wānanga kia whakatakato ano i nga ara moana mai i konei ki nga topito e wha o te Moanaui a Kiwa me ona motu. E ai ki nga tangata o Opoa ka noho tonu te tahu'a (Tohunga) o Taputapuatea ki reira engari ka taea e ia te tohu kei hea nga motu katoa o te Moananui a Kiwa, me te ara tika kia tae pai ki reira.\nKi ta etehi korero i nehera kua whakatapua a Taputapuatea ki te atua Tangaaroa, nawai ra ka tu ko Oro, atua o te riri hei atua matua ki Taputapuatea nei. Ko Oro te mea i mohiotia inaianei.\nMai i konei ka toro atu nga pononga o Oro ki era atu o nga moutere ara ki Moorea, ki Tahiti, ki Rarotonga tae atu ki Hawaii. Na ratou e kawe atu tetehi kohatu mai i Taputapuatea hei mauri kia hanga mai he marae ano ki era atu moutere.\n Fa'atau Aroha.\nNa ni'a Te-ao-uri, \nna raro te-ao-tea \nE to roa te manu e.\nKo te Hui Fa'atau Aroha (ara Whakatau Aroha) te hononga o nga iwi me nga moutere i runga o Taputapuatea nei. \nE ai ki etehi na Hironui (ara ko Whironui) te tangata nana i karangahia tenei huihuinga, ara nana e whakatere atu i tona waka ki nga moutere\nE rua nga minenga i whakatau mai nei ki tenei Hui Faatau Aroha ara te Te Aouri me te Te Aotea.\nKo nga motu Aouri era ki te tairawhiti i Raiatea ara ko Tahiti, tae atu ki Tuamotu, ki Rapa.\nKo nga motu Aotea era ki te taiuru i Raiatea ara ko Taha'a ko Porapora peka atu ki Rarotonga me era atu tae noa atu ki Aotearoa me Rotuma\nE ai ki Tu'au o Raiatea (Teuira Henry (1928, 119-128)) i timata ai te Fa'atau Aroha nei na te tamau o Poiriri, rangatira no Rotuma me Te'ura, wahine no Porapora. I tamaua ke ratou ki Opoa a ka hui mai nga ariki o nga moutere kia whakatau te aroha o ratou kia ratou.\n Te Hara i Awarua.\nTenei ano nga whakatauki o mua-\nToia e Rongorongo Aotea,\nka tere ki te moana.\nKo te hara ki Awarua i whiti mai ai i Hawaiki\nKo wai ka mohio te roanga o te Fa'atau Aroha ki Taputaopuatea nei. Ka penei tonu te whakaminemine mai o nga ariki, tohunga me nga matatoa kia tu te pure me nga tokotoko. Ko nga moutere o te Aouri me nga moutere o te Aotea nga mea i hui penei, e rua hoki nga amorangi e kia nei ko te Paoa-tea me te Paoa-uri.\nNawai ra ka puta te riri o tetehi o Paoa-uri a ka patua rawatia a Paoa-tea (tangata no Rarotonga) kia mate, ka patua hoki a Paoa-uri. Katahi ra ka rere atu Aotea. Kihai rawa ratou i puta ma Avamo'a, engari ma Avarua ka puta a na tenei ka aukati te ara i Avamo'a, ka aukati ano i te Fa'atau Aroha.\n Te Tangihanga o te Manu Mo'a.\nI te tau 1823 i kohikohi ano ia Teuira Henry tetehi korero mai i etehi tohunga e rua no Bora-Bora nei ko Auna-iti, ko Vai-aui te ingoa, kua tuhia ke ki tona pukapuka 'Ancient Tahiti'  \nE ai ki te tokorua ra\nI Opoa, i te whakaminenga o te 'Hau-pahu-nui'  i miharo tonu te minenga i te takanga mai o tetehi aitua. I te mutunga o nga ritenga o te pa'i-atua ka puta mai he hau awhiowhio (whirlwind) a ka katohia te kauru o tetehi rakau tamanu ko Paruru-mata'i-i-a'ana kia tu kau noa te tumu (trunk). He mea miharo tonu, he rakau taikaha te tamanu nei d.\nMiharo tonu te iwi, nawai ra ka tu mai a Vaita tah'u no Opoa me te ki E homa, eaha ta outou e feruri nei? (feruri = wherori) \nKo te whakautu Te feruri nei matou i te tapa'o o teie ra'au i motu nei, a'ita te ra'au nei i motu mai te po au'iu'i mai (tapa'o = tapako; teia = tenei;  au'iu'i = tau ukiuki), \nkatahi ra ka whakamaoritia e Vaita tona i kite ai  \nTe ite nei au, tei mua i au nei te aura'a o teie nei peu maere rahi! Tena mai te fanau'a 'una'una na te Tumu, e haere mai e hi'o i teie uru ra'au i Taputapuatea nei. E tino 'e to ratou e tino 'e to tatou, ho'e ana'e ra huru, no te Tumu mai, e e riro teie nei fenua ia ratou. \nE mou teie ha'apaoraa tahito nei, e e tae te manu mo'a o te moana, e te fenua nei, e haere mai e ta'ihaa i ta teie ra'au i motu e ha'api'i nei. \nKa aue tonu nga tohunga ki tenei kupu ui atu  ratou kia Vaita no whea tonu te fanau'a 'una'una na te Tumu\nKi ta Vaita Te haere mai nei na ni'a i te ho'e paha ama 'ore (Haramai ratou ma runga waka ama-kore), \n \nTautohe noa nga tohunga o te Hau-pahu-nui i a Vaita, e ai ki te tah'u o Huahine a Tereroa kua porangi ke a Vaita ko nga tahu'a a Opoa a Hua-tere me Fa'aarahia ka tautohe kia huri ona whakaaro nawai ra ka tauwehe nga tangata ra.\nEngari kua tae te rongo ki a Tamatoa ariki, a nana i tono kia Vaita ki haramai ki tona taha whakamaoritia ai; kei reira tonu te iwi e whakarongo ana. \n \nKa riri tonu nga tohunga nei engari ko Fa'aarahia me Tamatoa ariki ka rongo raua ki a Vaita.\nKa wehe takariri nga tohunga me te whakaaro kia taka te utu ki runga i Vaita ki kore e puta tona e korero.\nEngari ia kihai i taro ka puta mai tetehi waka ama-kore ara te waka o te pakeha me te haerenga mai o te Pakeha ki Matavai.\nKi etehi ko te kupu o Vaita he mea mo te haerenga mai o te Paipera tapu. Ana ko te Tumu ko te Atua, ko te (whanaunga)fanau'a 'una'una na te Tumu, te Mihinare me tona reo kunanu kua riro ia ratou te whenua a kua mutu te paopao o nga kawa tahito.  \nKua aukati nga kawa tahito o Taputapuatea tu kau ana nga papa kohatu ko nga manu mo'a o te moana nga mea e tangi ana i runga\n Te Hokinga Mai o Nga Waka.\nMohio katoatia tatou kua mutu katoa nga whakawhithwiti mai o nga waka hourua o te Moananui a Kiwa, e hia noa nga tau penei tae noa ki nga rautai 1800.\nMuri iho i te taenga mai o Pakeha ka timata ano nga tangata o te Moananui a Kiwa ki te whakawhiti atu ki whenua ke, pera kia Paora Tuhaere me ona haerenga ki Rarotonga me era atu.\nEhara maku te korero mo te Whakapehitanga o te Ao Pakeha, me nga huringa o nga tangata ki nga mea hou, a kua wareware ano tatou i nga ahuatanga o nga tupuna, pakaru haere te marae tapu nei a Taputapuatea.  \nI te tau 1929 i haramai a Te Rangihiroa ki Taputapuatea nei, a ka tuhia e ia nga kupu penei\nI had made my pilgrimage to Taputapu-atea, but the dead could not speak to me. It was sad to the verge of tears. I felt a profound regret, a regret for-I knew not what. Was it for the beating of the temple drums or the shouting of the populace as the king was raised on high? Was it for the human sacrifices of olden times? It was for none of these individually but for something at the back of them all, some living spirit and divine courage that existed in ancient times of which Taputapu-atea was a mute symbol. It was something that we Polynesians have lost and cannot find, something that we yearn for and cannot recreate. The background in which that spirit was engendered has changed beyond recovery. The bleak wind of oblivion had swept over Opoa. Foreign weeds grew over the untended courtyard, and stones had fallen from the sacred altar of Taputapu-atea. The gods had long ago departed. (Buck 1938, 81-82)\nKa roa ka penei te ahua ka tangi noa nga manu i runga o Taputapuatea.\nHei ahakoa i te tau 1976 i hoki ano mai a Hokulea o Hawaii ki Raiatea a ka tau atu ratou ki Taputapuatea. Ka whakatau ano ratou ki te marae ra engari ka tu tetehi tangata ko Parau Rahi te ingoa kohetehete noa i a ratou, notemea i uru mai a Hokulea ma Avarua ehara ma Avamoa, te awa tapu    \nKatahi ra ka puta te whakaaro ki te ngakau o etehi kia hoki ano mai nga waka kia hiki te tapu i Avamoa. Ko Pierre Sham Koua o Raiatea tetehi tangata kaha rawa kia tutuki pai i tenei kaupapa\nI te tau 1995 i rau mai nga kahui waka hourua mai i Hawaii, i Aotearoa, i Rarotonga me Tahiti ki Avamoa mo te Faatau aroha i Taputapuatea.\nKo tenei rau waka te whakahokinga mai o nga whakatere waka o te Moananui a Kiwa ki tenei marae tapu, he timatanga ano mo te wahi nei ki tu hei Marae Tapu no te Ao.\nKo Te Aurere o Aoteroa te waka tuatahi kia tomo ano mai ki Avamoa. Ka karakia haeremai te waka nei kia hiki te tapu kua takotoria i te Hara i Awarua, a ma penei ka tu ano te ara tapu i Taputapuatea kia tu ano te Fa'atau Aroha.\n Te Marae Tapu no te Ao.\nKua whakahoutia ano te marae Taputapuatea nei e ona uri ki Opoa. A Kua whakaturia tetehi roopu ko Na Papa e Vau hei kaitiaki mona. Ko tetehi tikanga nui ma ratou kia tohua te Marae Taputapuatea nei hei World Heritage Site i raro i te kawenata o Unesco.\nKoia ra i te 12 Hepetema 2007 i hui ano nga ariki o te Moananui a Kiwa ki Taputapuatea kia korerohia o ratou ake take. I hui mai nga kahui ariki o Tahiti Nui, o Tonga, o Hamoa, o Hawaii, o Rarotonga. Ko Tuheitia te kingi maori, me Te Heuheu ariki o Ngati Tuwharetoa nga mea i ahu mai i Aotearoa nei.\nI te 24 o Mahuru 2007 i hainatia tetehi tatau pounamu (he Natira'a ki to te reo o Tahiti Nui) i waenganui i te Marae Taputapuatea me nga piringa marae o Ngati Tuwharetoa. Ko te hainatanga tuatahi penei kia whakahonore te kaupapa kia tautapa Marae Taputapuatea hei Marae tapu no te Ao katoa.\n": {
        "id": 9,
        "processed": 1,
        "page_id": 12145,
        "text_id": 51383
    },
    "Tēnā koe! Nau mai, haere mai! Tuhia mai ō whakaaro, ō pātai rānei ki konei. (Please leave any questions or comments here).\nKo tēnei whārangi tō tātou puna wai, tō mātou wharekai rānei, hei wāhi whakawhitiwhiti kōrero i ngā reo e rua mō ngā āhuatanga katoa o tēnei o ō tātou Wikipedia. Ki te hiahia whakaputa whakaaro koe, tēnā, waiho mai ō whakaaro, ō pātai rānei kei raro iho nei, kia mōhio ai mātou kua tae mai koe kia kite i a mātou! Pūranga: 2004 • 2005 • 2006\n Tō Wikiperia 'pepeha'.\nHe paku whakaaro noa iho tōku mō tō Wikiperia pepeha: 'Te mātāpunenga utukore'. \nKi a au nei, kua hē tēnei whakamāoritanga i te mea ko te mea nui o te kōrero 'The Free Encyclopedia' (L'encyclopedie libre', 'Die freie Enzyklopedie', atu rānei) ehara i te utukoretanga, ko te wāteatanga kē, arā, ka taea e a wai te pā atu, ahakoa ki hea, ahakoa āhea, ahakoa whairawa kore rānei atu rānei, arā, kua wātea mō te katoa. Nō reira mēna ka whakaae ngā kaiwhakahaere o ēnei whārangi reo māori, me huri pea te pepeha hei: 'te mātāpunenga wātea'. Kia ora, Hāpara 14 Poututerangi 2009\nPānui: Robin Patterson.\n:Kia mōhio te hapori, nā Meta i whakakore ngā tūranga kaiwhakahaere o User:Robin Patterson i tēnei rā, i te 31 o ngā rā o Haratua, 2007. Kahuroa 06:24, 31 Haratua 2007 (UTC)\n:(Notice: following a vote by the community, the bureaucrat and sysop access rights of User:Robin Patterson were removed today, 31 May 2007). Kahuroa 06:24, 31 Haratua 2007 (UTC)\nPānui: Kaupapa hou: mō ngā ingoa mātāwhenua reorua.\nKa whakatūria e ahau tētahi kaupapa hou kia kōrerotia e te hapori, hei whakapūmau ki ngā tikanga o tēnei Wikipedia Māori. Ko te kaupapa: I roto i te pouaka whakamōhiotanga o tētahi tuhipānui mātāwhenua mō Aotearoa, pērā i ngā tuhipānui mō ngā tāone, ka tuhia tuatahitia te ingoa Māori, ā, i raro iho, ka puta ko te ingoa reo Pākehā, pēnei:\n:Ingoa reo Māori \n:Ingoa reo Pākehā \narā:\n:Te Whanga-nui-a-Tara \n:Wellington \nKo te take, he reo tūturu o Aotearoa te reo Pākehā; ā, kua whakaaetia e te hapori Aotearoa o te Wikipedia reo Pākehā i :en:Wikipedia:New Zealand Wikipedians' notice board kia puta pēnei ai aua ingoa i ngā tuhipānui mō ngā wāhi o Aotearoa:\n:English Name \n:Māori Name (Māori) \nHe aha ō koutou whakaaro? Tēnā, whakamahia tētahi o ēnei tauira:  (support),  (oppose),  (neutral).\n: E pai ana ahua ki tēnei kaupapa.  Kahuroa 08:24, 5 Pipiri 2007 (UTC)\n: I support. I am working on a infobox over on en. If mi wishes to adapt this box for here, feel free (my draft includes a English/Māori name field).  Heoi anō; nā Brian  (talk) 08:52, 5 Pipiri 2007 (UTC)\nKia ora Brian, he whakaaro rangatira tēnā. Kahuroa 09:36, 5 Pipiri 2007 (UTC)\n: --ThT 08:56, 5 Pipiri 2007 (UTC)\n: --Wolfgang K 03:32, 6 Pipiri 2007 (UTC)\n:E  ana ahau mena he peenei te whakatakoto:\n:Te Whanga-nui-a-Tara \n:Wellington \n:Kaahore ahau e pai kia puta nga hoto e paa ana ki te reo. Matapihi 19:19, 8 Pipiri 2007 (UTC)\nKia ora rā e hoa, āe rā, pēnā tonu te whakaaro. Kahuroa 11:29, 9 Pipiri 2007 (UTC)\n.\nKua āraia (blocked) - he karetao whakawai (sockpuppet) o Jose77 aka BrianT77 aka Jason aka Joseph aka David.\nThe following have been redirected to old versions because Jose77 edited the pages in question to hide his activities:\nSection 'Stub request' of hi:सदस्य वार्ता:": {
        "id": 12,
        "processed": 1,
        "page_id": 629,
        "text_id": 81865
    },
    "Ka whakarārangitia i konei ngā kaiwhakahaere o te Wikipedia Māori. He whārangi anō tēnei hei tono kia whakatūria he kaiwhakahaere hou, kia whakakorea hoki te tūranga kaiwhakahaere o tētahi tangata.\n Ko ngā kaiwhakahaere.\n O nāianei (active administrators).\nKo ēnei ngā kaiwhakahaere e mahi tonu ana ki te paetukutuku nei (These are the active administrators of this site):\n Kaiāwhina (other administrators).\n Ngā kaiwhakahaere tautauā (inactive administrators).\nKei tēnei rārangi aunoa ngā kaiwhakahaere katoa e rārangatia ana. Engari, kia tūpato. Ko ētahi, kāhore he mahi o ngā tāngata nei mō te wā roa. Kāhore kau ngā mahi a ētahi i runga i ngā tau e rua kua hipa ake nei (This list shows all the users with administrator rights. However, most have made no edits for long periods - that is, they are inactive.)\n Ngā kaiwhakahaere o mua (former administrators).\n User:Robin Patterson: nō te 31 o ngā rā o Haratua, 2007, i whakakorengia ōna tūranga hei kaiwhakahaere, hei kaiwhakahaere matua. (Robin Patterson, formerly a sysop and bureaucrat, was desysopped on May 31, 2007.)\n Ā ngā kaiwhakahaere mahi.\nMā ngā kaiwhakahaere e whakarerekē ngā whārangi o te wāhi MediaWiki arā ngā pānui pūnaha. Mā rātou e ārai ngā kaimahi e mahi nanakia ana ki te paetukutuku nei, mā rātou ngā whārangi e muku, e pare i runga i te kaupapa.\n Ngā tohu o te kaiwhakahaere.\n Ngā tono whakakore tūranga kaiwhakahaere.\nMā ngā tuari e whakakore ngā tūranga o ngā kaiwhakahaere i runga i te tautoko hapori. \n Hei mahi mā ngā kaiwhakahaere.\nTirohia Wikipedia:Whakatūpato mā ngā kaiwhakahaere. Tuhia ō tono katoa ki taua whārangi.\n Tirohia hoki.": {
        "id": 14,
        "processed": 1,
        "page_id": 664,
        "text_id": 82021
    },
    "He rārangi i ngā tuhipānui e mātua hiahiatia ana\n Haurongo.\n Kaitito.\n Kaihōpara.\n He Kaihanga, he kaimātai pūtaiao.\n He Kaipāngarau.\n He Kaituhi, he kairapu whakaaro.\n He Tohunga Toi.\n He kaitōrangapū, he kaiarahi o mua.\n He kaitōrangapū, he kaiarahi o nāianei.\n He Wāhine rongonui.\n He tohunga rorohiko, he tohunga ipurangi.\n He kaiwhakamataku.\n Tikanga ā Motu.\n Te Ahuwhenua.\n He inu.\n Mātai matawhenua.\n Continents.\n Tāone matua, nunui.\n Moni.\n Mātai matawhenua - kaupapa kē atu.\n Kaupapa matawhenua.\n Moana.\n Poles.\n Mata o te whenua, kare o te tai.\n Hītori.\n Tōrangapū.\n Kaupapa tangata.\n Kaupapa o tāwāhi.\n Whakapono.\nWhakapono-kore:\n Tikanga.\n Pūtaiao.\n Mātau kōkōrangi.": {
        "id": 22,
        "processed": 1,
        "page_id": 4593,
        "text_id": 38891
    }
}